[
  {
    "title": "My wife thinks video games are juvenile and playing them makes me less attractive.",
    "body": "42M here. I've been playing video games all my life, in many different genres, from Civilization to Warcraft to Wolfenstein 3D to Halo to Half Life to Fallout to Fornite to Red Dead Redemption to The Witcher to Cyberpunk 2077 and many in between. My wife knew this shortly after we met and of course when we got married. She had always said that she doesn't \"get them\" or understand why anyone would want to play them but she understood that it was something I found relaxing and enjoyable.\n\nFast forward to this week and she flat out tells me (while we were arguing about something else) that she thinks video games are juvenile, she can't believe that a 42 year old man plays them, and that playing them makes me less attractive to her. For reference, I'm a manager at work, we have a nice house, four kids and 2 dogs. So it's not like I'm just bumming around. And I take care of my hygiene and appearance  - basically I don't fall into any of the negative gamer stereotypes. I also play when everyone else is asleep so it's not cutting into family or housework time. It does mean that I tend to sleep in on weekend mornings though, which she doesn't like, as she's more of a morning person.\n\nDoes anyone have any good advice here? Is there any hope of her changing how she feels? She knows that some of them are very much not for kids and that it's a bigger industry than movies, but it doesn't change how she feels. Should I give up gaming? That would feel like a huge sacrifice but would probably have big benefits. Or do we just live with this?\n\nWhat to do... \n\nEdit: RIP my inbox.\n\nEdit2: Holy crap. I really tried to keep up, but there have been 14 thousand comments in 14 hours. I might check a few more but there's no way I can read them all. Thankyou for those that added insightful, challenging comments. Thanks less to those who proposed divorce or assumed I was lying. Yes, there are likely underlying issues for both of us, and we need to work on our communication. Yes, r/gaming is biased and perhaps a strange place to post, but it's been worthwhile. Thanks. \n\nFor reference: Our kids are 11, 13, 15 &amp; 16. When I get up at 10am, they are either still asleep, gaming, or YouTubing. I start playing on Friday and Saturday nights (if we're not going out) once jobs are done and kids are in bed, which is usually between 10pm and 12am. I finish between 2 and 3am. ",
    "score": 45660,
    "url": "",
    "created_utc": 1744296024.0,
    "author": "AtreidesOne"
  },
  {
    "title": "This is still a perfect night",
    "body": "",
    "score": 32613,
    "url": "",
    "created_utc": 1744360027.0,
    "author": "qwest91"
  },
  {
    "title": "Unpopular opinion: I miss when games let you be a little lost.",
    "body": "Some of y’all never had to wander around for 45 minutes because the game told you to “go north” and gave you zero map, and it shows.\n\nI just replayed *Morrowind* for the first time in years, and forgot how little hand-holding it gave you. No quest markers, no arrows — just vibes and vague directions from a sketchy NPC. I was mad at first… but also? It kinda hit different. It made me *pay attention* in a way most modern games don’t.\n\nNow everything’s like “Go here. Follow the glowing footprints. Watch the cutscene. Press X to win.”\n\nAnyone else lowkey miss getting lost and accidentally stumbling into something amazing? Or am I just being nostalgic and delusional?",
    "score": 27187,
    "url": "",
    "created_utc": 1744033466.0,
    "author": "itswickedbby"
  },
  {
    "title": "I wasn't impressed but idk",
    "body": "",
    "score": 22735,
    "url": "",
    "created_utc": 1744484980.0,
    "author": "piggycurrency"
  },
  {
    "title": "‘A Minecraft Movie’ At $157M A Record Opening For Videogame Pic, Toppling ‘The Super Mario Bros. Movie’",
    "body": "",
    "score": 20500,
    "url": "",
    "created_utc": 1743953853.0,
    "author": "DemiFiendRSA"
  },
  {
    "title": "Multiplayer",
    "body": "",
    "score": 18036,
    "url": "",
    "created_utc": 1744199303.0,
    "author": "LitterboxComics"
  },
  {
    "title": "Nintendo confirms $90 price for full Breath of the Wild experience on Switch 2",
    "body": "",
    "score": 17853,
    "url": "",
    "created_utc": 1744473144.0,
    "author": "xenocea"
  },
  {
    "title": "Thanks for bringing down the mood Wrex.",
    "body": "",
    "score": 17284,
    "url": "",
    "created_utc": 1744085387.0,
    "author": "Aggressive_Donut_222"
  },
  {
    "title": "Welcome back, Gamecube",
    "body": "",
    "score": 15449,
    "url": "",
    "created_utc": 1744366896.0,
    "author": "Iraqi_Weeb99"
  },
  {
    "title": "Ubisoft holds firm in The Crew lawsuit: You don’t own your video games",
    "body": "",
    "score": 14814,
    "url": "",
    "created_utc": 1744213364.0,
    "author": "Hachiman-Hikigaya"
  },
  {
    "title": "SONY Selling Banned Consoles via PlayStation Direct.",
    "body": "Bought a nice PS5 Pro DIRECTLY from PlayStation Direct and got it today. So stoked, I hooked it up got the software updates and then it says \"your access to the PlayStation Network (PSN) is temporarily or permanently prohibited\". Called Sony and gave them the serial number and they proceed to tell me the console was listed as stolen...... HUH?!\n\nThey gave me a support link for PS Direct, chatted with a guy there who just apologized. Said he had to escalate and I'd get an email within 24 hours about it. Anyone ever heard of this? Sony selling banned consoles from PlayStation Direct? What the actual fuck?!\n\nEDIT: Sony rectified the issue and unlocked my console, woohoo!!  They said all they know is it was a \"technical error\".  I don't know what that means but at least it was quickly resolved.",
    "score": 14367,
    "url": "",
    "created_utc": 1744409243.0,
    "author": "illegalmonkey"
  },
  {
    "title": "Nintendo Has Indefinitely Delayed The Launch Of The Nintendo Switch 2 In China",
    "body": "",
    "score": 13039,
    "url": "",
    "created_utc": 1744216592.0,
    "author": "ReaddittiddeR"
  },
  {
    "title": "Nintendo's Doug Bowser, channeling the ghost of Don Mattrick, says if you can't afford switch 2 then switch 1 is still available",
    "body": "&gt;Nintendo of America's president Doug Bowser (no relation to Mario's nemesis) was slightly more forthcoming that day.\n\n&gt;\"We recognize there are some people that may not be able to afford \\[the Switch 2's\\] price point. That's why we wanted to make the other Switch platforms available, so \\[people\\] still have an opportunity to come into our gaming universe, be a part of these characters in these worlds, and see value, if you will, in whatever rung of the platform they come in.\"",
    "score": 12331,
    "url": "",
    "created_utc": 1744071197.0,
    "author": "Iggy_Slayer"
  },
  {
    "title": "Japanese Gaming Companies' Shares Tank Due to US Tariffs",
    "body": "",
    "score": 11754,
    "url": "",
    "created_utc": 1744022374.0,
    "author": "xenocea"
  },
  {
    "title": "Every... Single.... TIME!!!",
    "body": "",
    "score": 12194,
    "url": "",
    "created_utc": 1744497909.0,
    "author": "WastelandViking"
  },
  {
    "title": "Telling my kids this how the Crips and Bloods became rivals.",
    "body": "",
    "score": 10386,
    "url": "",
    "created_utc": 1744061143.0,
    "author": "LynchMob187"
  },
  {
    "title": "Game: Gothic 1",
    "body": "",
    "score": 9277,
    "url": "",
    "created_utc": 1744286444.0,
    "author": "MikeySama"
  },
  {
    "title": "'There is no lawsuit' against Schedule I: As negative Steam reviews pile up, Drug Dealer Simulator publisher makes a public plea for peace",
    "body": "Dear Gamers,\nWe’d like to address your Schedule I / Drug Dealer Simulator publication and share some facts regarding the situation.\n\n1. There is no lawsuit. 2. It is not our intention to prevent TVGS from selling or developing their game. 3. There is an investigation into the nature of similarities between the games since a preliminary legal analysis indicated there might have been an infringement. 4. The analysis and investigation were necessary in the light of repeating opinions that the games are very similar. By not investigating it, Movie Games, being a publicly traded company, could face severe consequences for negligence. 5. The above was communicated only via ESPI, a stock market communication system, where we are obligated to publish such information for full transparency. Not publishing it would also be a case of negligence. From there it was picked up by the media and, in some cases, wrongly reported as a lawsuit. 6. The above is handled only by Movie Games, the publisher, not Byterunners, the developer of Drug Dealer Simulator. The developer is not involved in it whatsoever.\n\nThere is no ill will towards TVGS. We even mailed them best wishes shortly before the release, when the game was already huge, but before the investigation was deemed necessary. However, we are obligated to perform this investigation, act accordingly to the scope of the infringement if it is confirmed, and inform the public about it via ESPI.\nBest wishes, Movie Games",
    "score": 7267,
    "url": "",
    "created_utc": 1744185496.0,
    "author": "Busy-Reality-1580"
  },
  {
    "title": "You can borrow and resell Switch 2 game-key cards. Nintendo confirms that Switch game-key card downloads aren’t locked to a specific Nintendo account",
    "body": "",
    "score": 7134,
    "url": "",
    "created_utc": 1744091300.0,
    "author": "ReaddittiddeR"
  },
  {
    "title": "Nintendo says tariffs aren't the reason the Switch 2 costs $449.99",
    "body": "\n\nMaybe they'll increase it now that the tarifyhave been announced, but I doubt it. Not many people will buy it if it costs $600 and they know that.",
    "score": 6896,
    "url": "",
    "created_utc": 1744034375.0,
    "author": "mndza"
  },
  {
    "title": "Microsoft unveils AI-generated demo 'inspired' by Quake 2 that runs worse than Doom on a calculator, made me nauseous, and demanded untold dollars, energy, and research to make",
    "body": "",
    "score": 6329,
    "url": "",
    "created_utc": 1744005340.0,
    "author": "Farranor"
  },
  {
    "title": "My predictions for the live action Legend of Zelda movie trailer",
    "body": "",
    "score": 6272,
    "url": "",
    "created_utc": 1744310887.0,
    "author": "JHallComics"
  },
  {
    "title": "The Legend of Zelda: Breath of the Wild's Nintendo Switch 2 Edition Won't Include the DLC",
    "body": "",
    "score": 5504,
    "url": "",
    "created_utc": 1744355006.0,
    "author": "ReaddittiddeR"
  },
  {
    "title": "Tekken 8 tanks to 'Overwhelmingly Negative' reviews as pros and players criticize the Season 2 balance update",
    "body": "",
    "score": 5383,
    "url": "",
    "created_utc": 1744044403.0,
    "author": "121jigawatts"
  },
  {
    "title": "Middle-Aged Man Trading Cards Go Viral in Rural Japan Town",
    "body": "",
    "score": 4676,
    "url": "",
    "created_utc": 1744164260.0,
    "author": "westphall"
  },
  {
    "title": "Halo render I made in Blender",
    "body": "",
    "score": 4080,
    "url": "",
    "created_utc": 1743972351.0,
    "author": "Cobbtimus_Prime"
  },
  {
    "title": "I always feel like I have to completely restart a video game when I haven’t played it for a while. Is this normal?",
    "body": "So whenever I take a break from a game for a couple months or so and am ready to get back into it for some reason I always feel like I have to make a new save and start over. It feels like jumping into an old save I just feel somewhat lost and not good to play whether it’s because of I want to start the story over again or just want to start fresh with more combat focused games. For example I made it to chapter 5 in Black Myth Wukong and stopped playing for a few months and want to jump back into it but don’t want to jump into my old game even though it will take me dozens of hours to get to where I was. Wanted to know if anyone else experiences this and what causes it. ",
    "score": 3799,
    "url": "",
    "created_utc": 1744317598.0,
    "author": "Sad_Buffalo795"
  },
  {
    "title": "All 40 player modes on Battlefront 2 are now completely unplayable after no-spawn hack updated to auto-load for every new match/lobby.",
    "body": "If you are thinking of buying the game on PC even for 5 bucks, don't bother. Before this, it seems the hackers had to be in the match themselves, meaning once they left for the day you could still find some clean games. But now players are reporting that a worse version of the hacking script got release recently so now it's happening automatically and every single match of Galactic Assault and Supremacy is auto-scripted to begin with no ability to spawn - essentially killing any possibility to play all 40 player modes in the game.\n\nSad to see the slow painful death of what had become a pretty good game. EA hang your heads in shame. ",
    "score": 3527,
    "url": "",
    "created_utc": 1744087093.0,
    "author": "kocknocker19"
  },
  {
    "title": "58% Of PC Gaming Revenue In 2024 Came From Microtransactions",
    "body": "",
    "score": 3369,
    "url": "",
    "created_utc": 1744308443.0,
    "author": "PrinceDizzy"
  },
  {
    "title": "Netflix’s 'Devil May Cry' animated series has been renewed for season 2",
    "body": "",
    "score": 3193,
    "url": "",
    "created_utc": 1744294626.0,
    "author": "DemiFiendRSA"
  },
  {
    "title": "What's a game I can play with one hand only?",
    "body": "I recently broke  two fingers in my right hand and have been bored out of my mind, are there any games I can play with only one band you would reccomend? I'm already on my fourth playthrough of Baldur's gate btw \n\nedit: GUYS STOP TELLING ME TO MASTURBATE GODDAMNIT IM A MINOR",
    "score": 3202,
    "url": "",
    "created_utc": 1744040309.0,
    "author": "igotbanned-_-fornow"
  },
  {
    "title": "I teach a high school English class based around playing Video Games, and analyzing their stories",
    "body": "We got these controllers donated by PowerA, so we can play Breathe of the Wild, and have more players in class tournaments of Mario Kart/Smash. ",
    "score": 3190,
    "url": "",
    "created_utc": 1744307014.0,
    "author": "AnonymousCerealBowl"
  },
  {
    "title": "Counter Strike 2 skins market hits record high $4.3 billion market cap",
    "body": "",
    "score": 3083,
    "url": "",
    "created_utc": 1744216814.0,
    "author": "HANAEMILK"
  },
  {
    "title": "Are there online games being kept alive entirely by player communities?",
    "body": "Just wanted to know if there are examples of games where the publisher/studio discontinued support and the players basically took over that, even at small scales, modding and providing online support (servers? I don't get the technical side of things).\n\nEDIT: Holy moly, I just asked this out of curiosity and there's over 1000 comments! Really glad to see various communities keeping the classics alive. Thanks everyone! ",
    "score": 3036,
    "url": "",
    "created_utc": 1744251834.0,
    "author": "kcvlaine"
  },
  {
    "title": "When the world was good",
    "body": "",
    "score": 2715,
    "url": "",
    "created_utc": 1744293577.0,
    "author": "R3en"
  },
  {
    "title": "Nintendo defends Switch 2 pricing amid tariff concerns and gamer backlash",
    "body": "",
    "score": 2553,
    "url": "",
    "created_utc": 1744055958.0,
    "author": "xenocea"
  },
  {
    "title": "The hardest part of The Witcher 3",
    "body": "",
    "score": 2302,
    "url": "",
    "created_utc": 1744229342.0,
    "author": "Shandokar"
  },
  {
    "title": "Nintendo switch 2 tariff pre-order delay hits Canada too.",
    "body": "",
    "score": 2286,
    "url": "",
    "created_utc": 1744167286.0,
    "author": "Heliosvector"
  },
  {
    "title": "Whats a game that you originally hated but grew to like?",
    "body": "I bought BG3 (Baldur's Gate 3) a while ago (around a year ago) but couldn't get into the turn based combat, i finally gave it a fair shot last night and I may or may not have stayed up until 5am. Seriously that game is so good. Whats your game? ",
    "score": 2156,
    "url": "",
    "created_utc": 1743964229.0,
    "author": "Wolfy_935"
  },
  {
    "title": "Rumor: Titanfall 3 is almost complete, based on UE5, features singleplayer, extraction mode, and others",
    "body": "",
    "score": 1924,
    "url": "",
    "created_utc": 1744219902.0,
    "author": "fatso486"
  },
  {
    "title": "Just finished Split Fiction, went in blind and left with a game engraved into my heart",
    "body": "Oh my God! Just finished this with my friend with whom I had played It Takes Two before. In ITT we both got tired of how repetitive it became in the end but this? Every single level felt like playing a different game. And the storyline was top notch. Did not expect such depth and emotion from such a game. GOTY for me.",
    "score": 1837,
    "url": "",
    "created_utc": 1744374103.0,
    "author": "TaskMaster130"
  },
  {
    "title": "Decided to give Cyberpunk 2077 another try, this game looks incredible. Possibly the best looking game I have ever played (all maxed out on PC) and the gameplay is really good right now.",
    "body": "",
    "score": 1538,
    "url": "",
    "created_utc": 1744249498.0,
    "author": "BlackNair"
  },
  {
    "title": "X-Men Origins: Wolverine game/movie character comparison",
    "body": "",
    "score": 1499,
    "url": "",
    "created_utc": 1744067225.0,
    "author": "Red-Raptor3"
  },
  {
    "title": "Former PlayStation CEO Says Companies Should Have \"Baked In\" $5 Price Hike in Every Generation to Acclimate Gamers",
    "body": "",
    "score": 1676,
    "url": "",
    "created_utc": 1744522681.0,
    "author": "brzzcode"
  },
  {
    "title": "What's a videogame hack or secret you thought you discovered",
    "body": "Only for it to be widely known. Mine was the original Pokemon games and getting the option from your PC in your bedroom.  ",
    "score": 1411,
    "url": "",
    "created_utc": 1744490058.0,
    "author": "cmayfi"
  },
  {
    "title": "PSA: You can still download your purchased games and updates for consoles, for which Nintendo has closed their E-Store",
    "body": "This goes for the Wii, the WiiU and also 3DS. Nintendo hasn't taken away your games, even after closing the stores. Yes, there are some cases (like Smash for 3DS), where some things might not work.\n\nThe same will probably also be the case for Switch and Switch 2. So no, the Game Key Cards will most likely not be worthless, once the stores close.",
    "score": 1253,
    "url": "",
    "created_utc": 1744124798.0,
    "author": "letsgucker555"
  },
  {
    "title": "My 75 year old father has almost finished Red Dead Redemption 1: Still can't believe it",
    "body": "**A quick recap of how this came to be:** My brother and I separately finished both Red Dead Redemption games. (I finished the second one as recently as last year, and belong to the perhaps 10% of people that believe the 1st is the best. But that both belong together as being, in unison, one of the top 10 of all time, certainly of my lifetime. The first one alone is 'perfect' which I find so rare a label to give a game personally)\n\nMy father, as you may guess from his age, grew up when the wild west, westerns were all the rage. He took us to Arizona, to Tucson, to Tombstone, to see heartland of Wyatt Earp, Doc Holiday, Wildbill Hickock and recounted all the stories he knew about them. Long before many people had heard 'Big Iron' through New Vegas, he had it playing in the car on that trip as part of a CD playlist.\n\nFlash forward to last year: I bought the game when it came out on PC (finally), my brother got him his first controller, (I stopped him from attempting to play with keyboard and mouse).\n\nOff he went. As of today, it seems this was the right decision. I knew when I first played it that this was the game for him, and now it's proven 100%.\n\nNot a given: Although I did get him to previously play the Mass Effect Trilogy, which he loved, I was not successful with some others: XCOM, Imperator, Mafia 2, Crusader Kings 2, DA: Origins, all unsuccessfully. They never stuck. He tried them, then just gave up and did something else.\n\nThis one however, I wanted to make damn sure he tried, even if he had to struggle with the controller. Set up whatsapp and Steam Broadcast to help when necessary.\n\nNext thing I knew he started doing the next mission, then bounty missions... I saw him in a few combat encounters which he got through....\n\nI had to prod him to use dead eye more often, and use the movement and camera sticks in unison for more fluid play, but it hardly matters. He got on fine and went from mission to mission with great interest (a lot of this stuff I think is obvious for those who grew up with GTA and other similar 3rd person action titles)\n\n**His experience starting up:**\n\nSome initial issues: I set auto-aim to normal which helped, he still had to explore getting used to the twin sticks, and the multitude of buttons. I had to explain to him via a videocall where the triggers where and how they work with aiming and firing.  Biggest issues he had was understanding how cover-based shooting works, initially he'd constantly use the crouch button which was wrong.\n\nBut eventually, I could just see him play on his own... past New Austin, past Mexico .... and now he's past the final gang member (&gt;!Dutch!&lt;) nearing the end of the game (though of course he has no idea).\n\n**Some questions on what he thought:**\n\n\\-I checked whether he was following the story, and he definitely could recount all the names, the Van der Linde gang, Javier Escuela and Bill Williamson, Bonnie, Seth... everything.\n\n\\-Got more or less the impressions I got of the characters.\n\n\\-I think he was impressed as anyone else about the Mexico part of the game.\n\n\\-He asked what the undead nightmare mode is: I told him to play it once the main game is over. I still have no clue how to explain to him what it is. 'How will I know when the main story is finished' 'You'll know'.\n\n\\-Spoiler (leave uncovered if you have not played RDR1) I think that &gt;!once the main story concludes and the shock comes, I'll tell him that the last part could have gone differently if he had used dead eye properly!&lt;... or not\n\n\\-At this point I think it's all but certain that he loves the game, more than I could have hoped for, but I knew he would. Now sort of wondering, if, as I expect, he wants to play RDR2, how to best do that. His computer was good enough for RDR1, but the sequel is a whole different ballgame.\n\nBest of all, I've refused to tell him anything about RDR2, except that most people disagree with me and think it's not only better than the first, but among the greatest of all time.\n\nWhatever happens, I am happy I got him to play this. It was an intention I had for years and knew immediately when the PC version dropped.\n\nI think however, apart from the personal story I've shared above, it definitely is a case in point that it really isn't ever too late to learn how to play a relatively modern game even with a controller one has never used. There is a certain amount of logic and intuition that can include most people with little prior experience.",
    "score": 1144,
    "url": "",
    "created_utc": 1744233428.0,
    "author": "SlightWerewolf4428"
  },
  {
    "title": "That Time When The Godfather and Scarface Had Their Own Video Game",
    "body": "",
    "score": 1140,
    "url": "",
    "created_utc": 1744077188.0,
    "author": "Djf47021"
  },
  {
    "title": "Its all fun and games till I pull out my life size 3d printed blue turtle shell.",
    "body": "",
    "score": 994,
    "url": "",
    "created_utc": 1744038739.0,
    "author": "CorruptedCombat8"
  },
  {
    "title": "‘The Last Of Us’ Renewed For Season 3 At HBO Ahead Of Season 2 Premiere",
    "body": "",
    "score": 915,
    "url": "",
    "created_utc": 1744215602.0,
    "author": "DemiFiendRSA"
  },
  {
    "title": "What already-released game are you waiting to buy until it's more polished?",
    "body": "Cities Skylines II is getting close for me. Now I just need to wait until it's on sale. Civ VII seems like it's gonna be at least year.",
    "score": 867,
    "url": "",
    "created_utc": 1744411635.0,
    "author": "blankblank"
  },
  {
    "title": "Are we hitting 'open world fatigue'? Or do players still crave massive maps with endless side quests?",
    "body": "Open world games have been a dominant trend for over a decade now—from Skyrim and Witcher 3 to Elden Ring and Tears of the Kingdom. But lately, I’ve seen more people saying they’re getting tired of huge maps filled with icons and filler content.\n\nPersonally, I love the freedom, but sometimes I miss tighter, more focused experiences with clear direction and pacing.\n\nDo you think open world games are becoming too bloated?\n\nWhat’s the perfect balance between freedom and structure?\n\nAny recent games that nailed this formula for you?\n",
    "score": 1084,
    "url": "",
    "created_utc": 1744521858.0,
    "author": "trending_zone"
  },
  {
    "title": "Which game, in your experience, results in the highest number of browser tabs open while playing?",
    "body": "I got curious about this just now after closing Pathfinder: Wrath of the Righteous and staring at the 20+ browser tabs open that I'd been using.  For me it's either that game or Terraria.  What's yours?",
    "score": 827,
    "url": "",
    "created_utc": 1743979229.0,
    "author": "abby-normal-brain"
  },
  {
    "title": "Tariffs affecting more than the Switch",
    "body": "",
    "score": 817,
    "url": "",
    "created_utc": 1743995268.0,
    "author": "Serpenio_"
  },
  {
    "title": "One of the best RPG",
    "body": "This game deserves a remaster, one of the best RPG games I played on PS2.",
    "score": 801,
    "url": "",
    "created_utc": 1744242273.0,
    "author": "1inch_floppy"
  },
  {
    "title": "Any body else feel a bit disinterested and like they can't get into games anymore?",
    "body": "I really wanna get lost in a game. Like any game, like that feeling you had when you were a kid you were itching to go back home to play just a bit more, cutting from your sleep from anything because you were super into this specific game. That hasn't happened to me in a long time. Maybe I got old maybe it's just life but I just can't get into games anymore like that. Even the games I used to love very much. Just killing time with online games mostly and  that's about it.\n\nBG3,CP77,RDR2,GOW,HZD like the list goes on there are so many certified banger games I bought and barely played couple hours. I just do not know why. I very recently finished Lies of P twice, I'm legitimately surprised at myself that I even managed to finish it once, let alone twice. Normally people are excited when they launch a game for the first time, my emotional state is utter boredom only when I'm like 10 hours into the game and a bit emotionally invested then I get excited about it. It's just so weird, it wasn't like this 10 years ago.",
    "score": 754,
    "url": "",
    "created_utc": 1744161643.0,
    "author": "2Norn"
  },
  {
    "title": "Weighted Companion Cubes that may threaten to stab you.",
    "body": "",
    "score": 761,
    "url": "",
    "created_utc": 1744045753.0,
    "author": "ashiketchum"
  },
  {
    "title": "What video game character remains strong after you unlock them?",
    "body": "You know in some games you have to fight a character to unlock them and the fight itself is hard but when you finally managed to beat the character and unlock them they suck so I'm asking are there any characters that remain OP after you unlock them",
    "score": 739,
    "url": "",
    "created_utc": 1744206917.0,
    "author": "Agent1230"
  },
  {
    "title": "PSA: The UK version of the Nintendo Direct stated that the Gamecube Controller only works on NSO Gamecube games.",
    "body": "",
    "score": 736,
    "url": "",
    "created_utc": 1743939476.0,
    "author": "2Dement3D"
  },
  {
    "title": "What's a popular game series you can't get into for one reason or another?",
    "body": "For me, the Switch Zelda's just feel like Skyrim with different skins, and I'm not that big into open world games.",
    "score": 689,
    "url": "",
    "created_utc": 1744141556.0,
    "author": "Shadow_Ridley"
  },
  {
    "title": "What games your parents play?",
    "body": "My mom doesn't identify as a \"gamer\" but clearly spends more time with mobile games than I do. She usually plays candy crush saga and some sort of word puzzles. She doesn't regonize it as gaming since it's just on her phone but she's actually using more time playing games than me. What kind of games your parents play and are they identifying it as gaming or not?",
    "score": 670,
    "url": "",
    "created_utc": 1744414403.0,
    "author": "mistermaximan"
  },
  {
    "title": "I play this old game called gothic 2, with some mods in it that adds random titles to mobs to make them more powerful, and this one was rly funny",
    "body": "",
    "score": 626,
    "url": "",
    "created_utc": 1744113999.0,
    "author": "MikeySama"
  },
  {
    "title": "My partner gets motion sickness playing/watching games",
    "body": "She's fine with 2D games but she can only handle 3D games with constantly moving cameras for a minute or 2. There are so many game worlds that she would love that I want to introduce her to but she can't take part in. \n\nI've thought about getting some eye-tracking software to see if her eyes are focusing on things mine aren't. Maybe, as gamers, our brains instinctually avoid trying to keep up with everything on screen and her eyes are trying to take everything in?\n\nI've never experienced this in anyone else. Has anyone ever come across someone who reacts the same way or does anyone have any advice on a possible solution? ",
    "score": 591,
    "url": "",
    "created_utc": 1744369964.0,
    "author": "the3rdconchord"
  },
  {
    "title": "After years of being in storage I finally have my game collection on display again!",
    "body": "",
    "score": 578,
    "url": "",
    "created_utc": 1744315703.0,
    "author": "Skullatoran"
  },
  {
    "title": "MARATHON - Gameplay Reveal Trailer. Out September 25, 2025",
    "body": "",
    "score": 559,
    "url": "",
    "created_utc": 1744477779.0,
    "author": "ReaddittiddeR"
  },
  {
    "title": "What are the games with the most complicated, weird, and convoluted stories?",
    "body": "Please try to avoid any spoilers if possible.\n\nMy entries are:\n- Kingdom Hearts\n- Guilty Gear\n- Nier\n- Honkai Impact 3rd",
    "score": 553,
    "url": "",
    "created_utc": 1744303907.0,
    "author": "arielzao150"
  },
  {
    "title": "\"All that we do, all that we are, begins and ends with ourselves\"",
    "body": "",
    "score": 555,
    "url": "",
    "created_utc": 1744293179.0,
    "author": "FatalDarkprince"
  },
  {
    "title": "Made a custom figure of my player character from Star Wars Jedi Academy",
    "body": "",
    "score": 554,
    "url": "",
    "created_utc": 1744371293.0,
    "author": "DanintheVortex"
  },
  {
    "title": "[OC] My New Goro Majima Painting",
    "body": "",
    "score": 531,
    "url": "",
    "created_utc": 1744226638.0,
    "author": "TylorHepnerArt"
  },
  {
    "title": "This part is all about 'true happiness'",
    "body": "",
    "score": 521,
    "url": "",
    "created_utc": 1744232291.0,
    "author": "Virasman"
  },
  {
    "title": "What games have you bought multiple times?",
    "body": "I’ve bought minecraft for pretty much every system since i first got it on my old Xbox 360. I’ve bought Dayz on both PS5 and Steam. I’ve bought Fallout New Vegas, Fallout 4, and Skyrim on Xbox and Steam",
    "score": 517,
    "url": "",
    "created_utc": 1743989688.0,
    "author": "BarryBlock78"
  },
  {
    "title": "What's a game that you were hyped out of your mind and thinking about the endless amount of potential that game had. Only for it to come out very underwhelming",
    "body": "A video game that had the potential to be something more. But sadly that potential was squandered once it came out to middling reviews. ",
    "score": 482,
    "url": "",
    "created_utc": 1743992287.0,
    "author": "DependentImmediate40"
  },
  {
    "title": "So, I heard you guys like arcades…",
    "body": "A couple of years ago I made a popular post with my home arcade &amp; Vaporwave-cave. I decided to open my own arcade bar and pizza place in my home town. I wish I could post more photos but the rules say I can’t. ",
    "score": 485,
    "url": "",
    "created_utc": 1744471487.0,
    "author": "SlawBoss"
  },
  {
    "title": "I know NOTHING about D&D, but really want to play BG3, will I be ok?",
    "body": "I love RPGS and really enjoy turn based rpgs but I really have no clue about anything related to D&amp;D…will this game be too overwhelming? I keep hearing how awesome it is and want to check it out",
    "score": 468,
    "url": "",
    "created_utc": 1744213673.0,
    "author": "walman93"
  },
  {
    "title": "Indiana Jones and the Great Circle Comes to PS5 on April 17 with PS5 Pro enhancements",
    "body": "",
    "score": 458,
    "url": "",
    "created_utc": 1744383541.0,
    "author": "ReaddittiddeR"
  },
  {
    "title": "Enter the Gungeon 2 — Announcement Trailer",
    "body": "",
    "score": 448,
    "url": "",
    "created_utc": 1744135866.0,
    "author": "EarthPuma120"
  },
  {
    "title": "found this relic in the back of my van, no idea how it got there",
    "body": "",
    "score": 359,
    "url": "",
    "created_utc": 1744217560.0,
    "author": "OverlySexualPenguin"
  },
  {
    "title": "It's kind of sad that modern kids will never get to experience waking up at 6am to watch animated video game adaptations that were essentially the fever dreams of coked up network executives.",
    "body": "",
    "score": 353,
    "url": "",
    "created_utc": 1744246053.0,
    "author": "OmegaLiquidX"
  },
  {
    "title": "What’s your weapon of choice when playing a game?",
    "body": "FUCKING DAGGERS, idc if it’s a shitty tool, idc if it’s absolutely broken I will always go the way of stealth and daggers are usually the way for it. I played the first half of Elden Ring just going behind people for a 50% health check or kill and that was with a dagger once I was able to get it. \n\nDual wielding is another, doesn’t matter if it’s a sword or a damn pistol I am always going to pick up two of the same weapon type to get that sweet satisfying kill with two instead of one. \n\nAlso, I don’t care if it makes the game easier or I lose an attachment slot for it. The silencer is my go to for anything. Sniper and handcanons are a close second, it’s the damn thrill of it. You telling me when you’re shooting a pistol like 007 you aren’t a fucking gangster? Absolutely hands down more fun but less viable depending on how you use it / if the game rewards it. ",
    "score": 340,
    "url": "",
    "created_utc": 1744300442.0,
    "author": "DarkIcedWolf"
  },
  {
    "title": "Games you wish still had active multi-player",
    "body": "Any games you guys wished would still be played for it's multiplayer?",
    "score": 335,
    "url": "",
    "created_utc": 1743946971.0,
    "author": "Weary_Control_411"
  },
  {
    "title": "Ark - The Island recreated in Minecraft",
    "body": "",
    "score": 328,
    "url": "",
    "created_utc": 1744391471.0,
    "author": "Cardycraft"
  },
  {
    "title": "What’s everyone’s favorite weapon in a video game?",
    "body": "Mine’s the Bullseye from Resistance Fall of Man. Tracking darts let it home in on enemies and you can tag a surface to create a swirling ball of bullets that can be tagged to another enemy or held down to explode in an AoE. \n\nSecondary shoutouts to the Rivet Gun lvl 3 from Metal Arms Glitch in the System and Tanegashima from MGS4 the musket that shoots a tornado ",
    "score": 331,
    "url": "",
    "created_utc": 1744438892.0,
    "author": "Royal_Mud893"
  },
  {
    "title": "Marathon | Save the Date Trailer",
    "body": "",
    "score": 315,
    "url": "",
    "created_utc": 1743990880.0,
    "author": "Nemlokt"
  },
  {
    "title": "‘A Quiet Place: Day One’ Helmer Michael Sarnoski To Direct Adaptation Of Popular Video Game ‘Death Stranding’ For A24 And Kojima Productions",
    "body": "",
    "score": 295,
    "url": "",
    "created_utc": 1744034850.0,
    "author": "ReaddittiddeR"
  },
  {
    "title": "Ghost of Tsushima sucks up time like Skyrim",
    "body": "Not many games I have played do this - but I remember back when I used to play it in the 2010s...I thought I had played Skyrim for maybe 45 minutes - only to realise I had been absorbed in it for a good few hours\n\nI've just started playing Ghost of Tsushima on PC - and although I found it initially boring (and graphically I've seen a lot better) - when I kept trying (and failing) to stealth as much as I could in one of the first areas (one where you have to recover 3 emblems / and then blow up a dynamite cart) - and finally (although not perfectly) succeeded with nearly all stealth kills - an hour had passed in what seemed like 20 minutes\n\nI hope the game turns out as I progress further into it to be as good as most people claim it is",
    "score": 312,
    "url": "",
    "created_utc": 1744504678.0,
    "author": "makarastar"
  },
  {
    "title": "After all these years, Left 4 Dead 2 still stands tall as an absolute masterpiece",
    "body": "That's it. It's just still such an enjoyable game after all this time. I'm 32, so in 2008 when the first one dropped I played it on the 360 with the same group of buddies I still play it with today. We probably pick it up twice a year and put a lot of time into it. Back 4 Blood just never hit the same.\n\nThe VR Mod for it also breathes new life into the game. Highly encourage you guys to check it out if you haven't.",
    "score": 250,
    "url": "",
    "created_utc": 1744229220.0,
    "author": "Polyrhythm239"
  },
  {
    "title": "Sadly my game genie is long gone, but my stickers still remain...and the GB SP still works.",
    "body": "",
    "score": 248,
    "url": "",
    "created_utc": 1743977468.0,
    "author": "dmbwater0"
  },
  {
    "title": "[OC] My New Goro Majima Painting",
    "body": "",
    "score": 246,
    "url": "",
    "created_utc": 1744398707.0,
    "author": "TylorHepnerArt"
  },
  {
    "title": "Astro bot appreciation.",
    "body": "Waited a year for this lil guy to get re-released in Japan. So worth it! Love the little guy. ",
    "score": 223,
    "url": "",
    "created_utc": 1744405463.0,
    "author": "N7Preston"
  },
  {
    "title": "From r/science: Action video gamers have enhanced functional and structural connectivity in the dorsal visual stream",
    "body": "",
    "score": 209,
    "url": "",
    "created_utc": 1744072307.0,
    "author": "PancakeExprationDate"
  },
  {
    "title": "Tequila Works, developer of Rime, is auctioning off its intellectual property after declaring bankruptcy.",
    "body": "",
    "score": 177,
    "url": "",
    "created_utc": 1744472608.0,
    "author": "laxusdreyarligh"
  },
  {
    "title": "Blue Prince review",
    "body": "",
    "score": 170,
    "url": "",
    "created_utc": 1744058014.0,
    "author": "Nachtfischer"
  },
  {
    "title": "New York in Division franchise is probably my favorite setting in any video game.",
    "body": "The entire point of this post is just how realistic the world looks like. You can absolutely imagine that the situation the World of Division is facing is real (massive civil unrest after an extremely dead virus made in a lab got released).\n\nIn the first game you have almost war-torn snowy Midtown NYC in Christmas decorations and in Division 2 DLC Warlords of New York you have the same war-torn Lower Manhattan just weeks after one of the worst hurricanes in human history to the point that it tore through Brooklyn bridge and beached an oil tanker. Also the game has LOTS of loot crates and crafting materials suitcases hidden in the world so exploring is really worthwhile. Almost every side alley is fully explorable, sometimes you'll find yellow switches that will unlock the buildings with even more shit to loot. \n\nI'm not even from USA nor have ever visited. I'm currently playing Division 2 and for the last couple of months it has been my most played game. I put some 100 hrs in Division 1 but that was in 2022 way past it's prime.\n",
    "score": 167,
    "url": "",
    "created_utc": 1744246673.0,
    "author": "WeetzCRo96"
  },
  {
    "title": "What's a scene in a video game you can't experience normally anymore because of a meme?",
    "body": "First immediate thought: Eggman's Announcement from Sonic Adventure 2\n\nit goes from \"look at how cool of a ruler I am\" to, well... you know",
    "score": 156,
    "url": "",
    "created_utc": 1743996791.0,
    "author": "HF484"
  },
  {
    "title": "Modified a Polycade Sente.  Can now play Intellivision using original controllers.",
    "body": "Getting the actual controllers going took some gymnastics. So happy with how it's working. Had to use jzintv emulator to map the keypad portion of the controllers. Could not figure out how to get the retroarch core that uses freeintv to map completely. I honestly don't think it can map the Intellivision controller keypad.\n\nUsed Intellivision Flashback controllers.\n\nI was then able to make use of a DB9 USB adapter sold here [https://www.retronicdesign.com/en/](https://www.retronicdesign.com/en/) Had to update the firmware from here: [https://www.retronicdesign.com/en/download/](https://www.retronicdesign.com/en/download/)",
    "score": 155,
    "url": "",
    "created_utc": 1744041346.0,
    "author": "SoBeefy"
  },
  {
    "title": "Sony, please re-make Fat Princess for PS5 and PC. I'm just screaming out to the void to see who else misses this masterpiece.",
    "body": "",
    "score": 154,
    "url": "",
    "created_utc": 1744211924.0,
    "author": "yomjoseki"
  },
  {
    "title": "SpeedRunners 2: King Of Speed Announced For 2025 Release",
    "body": "",
    "score": 146,
    "url": "",
    "created_utc": 1744391066.0,
    "author": "raitozen"
  },
  {
    "title": "I love making gaming props and replicas! Here are a few examples of props I have made! ❤️",
    "body": "I've been making props for over a decade now and love it! Hopefully some of you can recognise some of them! ",
    "score": 154,
    "url": "",
    "created_utc": 1744349188.0,
    "author": "Katesensei"
  },
  {
    "title": "Any Modern \"Rich\" sci-fi games that aren't dystopian",
    "body": "Played Star Ocean: Till The End of Time again somewhat recently and I miss that deep sci-fi lore. Literally every in game term has a dictionary entry with some attempt to explain the pseudo-science or history behind it and it generally has a 'hopeful' look at technology progression. You dive deep enough into star-ocean lore it is technically a post-dystopia but that's not really a sticking point in the story and is only loosely referenced.\n\nCan't think of many games that utilize that setting any more.",
    "score": 152,
    "url": "",
    "created_utc": 1744054931.0,
    "author": "bobmlord1"
  },
  {
    "title": "a series of unfortunate events",
    "body": "Cannot have scripted a better scene, wow. Happened to me in GTA5",
    "score": 146,
    "url": "",
    "created_utc": 1744334930.0,
    "author": "Xcellion"
  }
]