[
  {
    "title": "My 8-year-old son went around our garden today and cut all these daffs and twigs n shit and made this fabulous bouquet all by himself.",
    "body": "",
    "score": 7551,
    "url": "",
    "created_utc": 1743981991.0,
    "author": "Szichtawd"
  },
  {
    "title": "Giant volunteer fennel I grew on accident",
    "body": "",
    "score": 6881,
    "url": "",
    "created_utc": 1744073668.0,
    "author": "ChefCourtB"
  },
  {
    "title": "My 20 year old tree thing just sprouted a weird flower thing... What's it doing?",
    "body": "We've had this indoor tree forever. I think it's a yucca? It's gotten super tall before, so I've had to chop it down, and it keeps growing. But recently it sprouted this flower thing at the top. I've never seen that before in the 20 years we've had it. It's oozing sap. Whys it doing this? Is it happy? Sad? I'm confused....",
    "score": 6300,
    "url": "",
    "created_utc": 1744162011.0,
    "author": "ibarker3"
  },
  {
    "title": "5 babies built into my wreath!",
    "body": "",
    "score": 5951,
    "url": "",
    "created_utc": 1744315029.0,
    "author": "jks11345"
  },
  {
    "title": "What is happening ?",
    "body": "This shot up out of nowhere….what is going on?\n",
    "score": 5158,
    "url": "",
    "created_utc": 1743973245.0,
    "author": "InternationalFig56"
  },
  {
    "title": "What’s your favorite (personal) garden photo?",
    "body": "I obsessively take a ton of pictures of my garden every year, usually just for my own reference. But sometimes I take one I just really love. This is my fave pic from last year (and maybe all time fave). The cat just knows, ya know? Do you have a favorite picture of your garden? Would love to see it! ",
    "score": 3969,
    "url": "",
    "created_utc": 1743981687.0,
    "author": "Right-Department-584"
  },
  {
    "title": "How's your garden going?  Mine's just GREAT...",
    "body": "",
    "score": 3930,
    "url": "",
    "created_utc": 1744115866.0,
    "author": "soverylucky"
  },
  {
    "title": "Spring Garden Hack?",
    "body": "This IS how you make a Spring garden thrive... right?  \n\n#frogandtoad #gardeningnoob #spring",
    "score": 3903,
    "url": "",
    "created_utc": 1744155757.0,
    "author": "jenniezc"
  },
  {
    "title": "Fasciated asparagus, 3 week update",
    "body": "Still alive and weird. Not as fragile as it looks. Pretty firm to the touch and stiff. 🌊",
    "score": 3586,
    "url": "",
    "created_utc": 1744381730.0,
    "author": "dozazz"
  },
  {
    "title": "I transferred my tomato seedlings outside today!",
    "body": "",
    "score": 3523,
    "url": "",
    "created_utc": 1744403681.0,
    "author": "Adorable-Air-6901"
  },
  {
    "title": "AI slop is often hard to spot, but sometimes it’s so terrible it actually makes you laugh out loud",
    "body": "Try reading this out loud if you need a good laugh. And remember not to follow advice from anyone using AI online - that advice is often completely wrong! ",
    "score": 3484,
    "url": "",
    "created_utc": 1744228703.0,
    "author": "CryptographerLost357"
  },
  {
    "title": "Been waiting 2 yrs to see what iris this was and it didn’t dissapoint 😍",
    "body": "",
    "score": 3445,
    "url": "",
    "created_utc": 1744474163.0,
    "author": "Littlefacelucy"
  },
  {
    "title": "After 4 years, I’ve finally managed to grow a blueberry from store bought blueberries.",
    "body": "I’ve been trying to harvest berries from seed and I’ve finally gotten a blueberry to grow. I’ve already gotten a raspberry and three blackberry plants. The blackberries flowered after their first year but I’m still waiting for my raspberry plant to flower.",
    "score": 2846,
    "url": "",
    "created_utc": 1744051669.0,
    "author": "ljthepunisher"
  },
  {
    "title": "Someone left several of these on my porch. Any idea what they are?",
    "body": "",
    "score": 2490,
    "url": "",
    "created_utc": 1744401925.0,
    "author": "Resident_Oil4009"
  },
  {
    "title": "a bird nested and laid eggs in our plant",
    "body": "should i not water the plant anymore?? i dont wanna disturb them😭😭and what type of bird eggs r these?",
    "score": 2337,
    "url": "",
    "created_utc": 1744238873.0,
    "author": "lealuvsuu"
  },
  {
    "title": "IT BLOOOOOOMED!!!",
    "body": "HEHEEHEHEHE AAAAAA\nIT BLOOMED AHHHH OMG HEHEHEHEHEHEHE\n\nA few months ago I spread some poppy seed around a pot I had growing, but I moved that. But ya can't move a plant growing in desert sand right by a path! So I kept it in!\nSomeone wanted me to remove it. But I say. &gt;:(\n\nAnd I am so gosh dang excited and proud of this poppy flower oh my god.\n\nI previously bloomed a few poppies before but, they were all super tiny and didn't even make it to 1 foot.\n\nBut this baby, surpasses many feet, AND BLOOMED THIS GORGEOUS FLOWER!!\n\nThe flower started to upright itself last yesterday, and I knew it was getting ready to bloom.\nAND BLOOM IT DID. GOSH THIS IS SUCH A PRETYY FLOWER OMGGG. AA ITS SO BIG (to my growing standards xD) AND AAAAAAAAA\n\nAAAAA HAHAHAH YAYYYYYYYY",
    "score": 2285,
    "url": "",
    "created_utc": 1744207218.0,
    "author": "StarStruck1180"
  },
  {
    "title": "A monarch butterfly is drinking nectar from the flowers ☺️🌷🌹.",
    "body": "",
    "score": 2256,
    "url": "",
    "created_utc": 1743971819.0,
    "author": "sweetieritaaa"
  },
  {
    "title": "Tulips",
    "body": "Dug 3 long trenches. Planted variety of perennial tulips - pride mix, appledorn, purple mix, white, not sure what else but there was a lot. \n\nWondering if these will come back next year. \n\nLooks like half are still tight buds . ",
    "score": 2205,
    "url": "",
    "created_utc": 1744312984.0,
    "author": "Sassafrass2033"
  },
  {
    "title": "Who are they, and do they go in my compost with the earth worms?",
    "body": "Austin TX. Found under the grass. Thanks! ",
    "score": 2148,
    "url": "",
    "created_utc": 1744222278.0,
    "author": "picklopicklebaucher"
  },
  {
    "title": "The garden is finally taking shape!",
    "body": "And the greenhouse is full of plants impatiently waiting for that last frost. 😅",
    "score": 2177,
    "url": "",
    "created_utc": 1744453199.0,
    "author": "Eyesclosednohands"
  },
  {
    "title": "the most stunning wisterias I've ever seen. It is stretching for meters along the road",
    "body": "",
    "score": 1900,
    "url": "",
    "created_utc": 1743989939.0,
    "author": "Bitter_AttitudeX"
  },
  {
    "title": "Tomato hornworm turned wasp nursery… I did not expect this twist.",
    "body": "Found another tomato hornworm in the garden today… and this one’s not making it to moth life. Those little white things on its back? Not eggs. They’re cocoons—tiny wasps are literally growing inside it.\n\nHere’s what happens (kinda crazy): a parasitic wasp lays eggs under the hornworm’s skin. The baby wasps hatch, feed on its insides (yep), then chew their way out and spin those little cocoons. Eventually, the adult wasps emerge and the caterpillar dies.\n\nNature’s brutal… but efficient.\n\nMoral of the story: kinda glad I’m not a tomato hornworm.",
    "score": 1776,
    "url": "",
    "created_utc": 1744377400.0,
    "author": "RainbowSushi11"
  },
  {
    "title": "Went to buy toothpaste, came back with a Zinnia jungle",
    "body": "It started as the most mundane errand—I just needed toothpaste. That was it. A quick in-and-out at the store. But you know how it goes... one aisle leads to another, and suddenly I’m standing in the nearby nursery, staring at **Zinnia** plants, as if they had something personal to say to me.\n\nI don’t even know what made me pick them up. I’ve never been a serious gardener. But something about those bright flowers standing in harsh sunlight—so loud, so unapologetically joyful—made me pause. Maybe it was colors I was craving. Maybe I just needed to take care of something that wasn’t *me* for a change.\n\nSo I bought about **50 plants (20 rupees per plant**), along with the toothpaste. Potted them on a quiet afternoon, half-believing they’d ever grow.\n\nCut to today—my terrace looks like a Holi party exploded in a plant nursery. The Zinnias are THRIVING. They’re so loud and colorful; I feel like I need sunglasses just to water them.\n\n**Honestly, a 10/10 impulsive decision. Would recommend.**  \nSide effects may include excessive smiling, unsolicited compliments, and absolutely no regrets.\n\n**Moral of the story: Buy the toothpaste. But also... buy the flowers. 🌸**",
    "score": 1767,
    "url": "",
    "created_utc": 1744027370.0,
    "author": "pikachu0604"
  },
  {
    "title": "My dad's 28 year old lemon trees started shedding their bark. We're gutted :(",
    "body": "My dad's lemon trees were kept inside a shed for the winter, like every year. They usually stay there for around four months during the colder weather and get watered every two to three weeks. They don’t get much light at all, but they’re pretty hardy and have been going strong for over 25 years.\n\nThis year, when we took them out, we were shocked to see the condition of the bark. The damage seems to have developed over just a few weeks, and it looks pretty extensive.\n\nIs there any chance they’ll make it? My dad is feeling pessimistic and very sad about it, but we’re wondering if there’s still any hope. There are still a lot of green leaves, and a few of the lemons ripened :(\n",
    "score": 1754,
    "url": "",
    "created_utc": 1744466057.0,
    "author": "TheChopinet"
  },
  {
    "title": "My new greenhouse",
    "body": "I’m in love!!!",
    "score": 1674,
    "url": "",
    "created_utc": 1744086123.0,
    "author": "Standard-Twist-2795"
  },
  {
    "title": "Texas moves to ban over 40 plants",
    "body": "Texas Senate Bill 1868 \"Relating to adding certain substances to the Texas Controlled Substance Act and prohibiting the production, manufacture, distribution, delivery, sale, and possession of certain hallucinognic substances, creating offenses.\"  On the list is Texas mountain laurel, vinca, mimosa tree, angel trumpet, and morning glory.\n\n  \nLink to Texas Senate bill 1868- https://legiscan.com/TX/text/SB1868/id/3152868#:\\~:text=Texas%20Senate%20Bill%201868&amp;text=Bill%20Title%3A%20Relating%20to%20adding,hallucinogenic%20substances%3B%20creating%20criminal%20offenses.",
    "score": 1549,
    "url": "",
    "created_utc": 1744223765.0,
    "author": "TheRoofisonFire413"
  },
  {
    "title": "Birds got my first 3 tomatoes. That is all they will get!!!",
    "body": "",
    "score": 1354,
    "url": "",
    "created_utc": 1744155425.0,
    "author": "nineteen_eightyfour"
  },
  {
    "title": "Got to love the Dogwood",
    "body": "",
    "score": 1245,
    "url": "",
    "created_utc": 1744316357.0,
    "author": "Ok_Associate_8913"
  },
  {
    "title": "First iris bloom of the spring",
    "body": "I planted these irises three years ago and this is the first time they have bloomed! I have another variety that I am waiting for the buds to start opening so that I can see what they look like. ",
    "score": 1238,
    "url": "",
    "created_utc": 1744048947.0,
    "author": "Bald_Goddess"
  },
  {
    "title": "My wisteria deck",
    "body": "Worth losing the deck some day imo",
    "score": 1186,
    "url": "",
    "created_utc": 1744173088.0,
    "author": "coveredcallnomad100"
  },
  {
    "title": "The most beautiful poppy",
    "body": "This beauty has come back now two years in a row , all my other poppy’s are normal golden color . But she steals the show . Is this a mutation ? ",
    "score": 1132,
    "url": "",
    "created_utc": 1744149897.0,
    "author": "InfamousTreacle8270"
  },
  {
    "title": "Finally finished up our birdhouse gourds from last year.",
    "body": "",
    "score": 1129,
    "url": "",
    "created_utc": 1744210871.0,
    "author": "poconomtnman31"
  },
  {
    "title": "Why won’t the soil drink the water?",
    "body": "I planted some carrots and tomatoes. I’m using a bag of soil and I’m unsure of how old the bag is. Can soil go bad? It’s miracle-gro.\nThe water is just pooling on top and not soaking in. I’ve never had this happen. Do I need to start over?\nThanks!\n",
    "score": 1097,
    "url": "",
    "created_utc": 1744113071.0,
    "author": "Watervapor87"
  },
  {
    "title": "Nebula Corn, my own strain of corn",
    "body": "This has been a ongoing process for the last 13 years. Breeding selecting and turning on the true potential corn has to offer ",
    "score": 1048,
    "url": "",
    "created_utc": 1744440325.0,
    "author": "Thomasrayder"
  },
  {
    "title": "Cosmos have gone crazy",
    "body": "",
    "score": 973,
    "url": "",
    "created_utc": 1744230685.0,
    "author": "kallan0100"
  },
  {
    "title": "The shhhaadddee 😎 (saw on FB and wanted to share!)",
    "body": "",
    "score": 963,
    "url": "",
    "created_utc": 1744395977.0,
    "author": "HouseGecko6"
  },
  {
    "title": "I’m growing precious nuggets of gold in my garden! Well, California Golden Poppies that they are 😄 (Zone 9b)",
    "body": "",
    "score": 943,
    "url": "",
    "created_utc": 1744131781.0,
    "author": "alwaysrunningerrands"
  },
  {
    "title": "Had to share the way thee light came through",
    "body": "",
    "score": 929,
    "url": "",
    "created_utc": 1744383028.0,
    "author": "alleyrope"
  },
  {
    "title": "What is this tree on my property? Is it edible?",
    "body": "",
    "score": 893,
    "url": "",
    "created_utc": 1744209889.0,
    "author": "rebellula"
  },
  {
    "title": "Just wanted to say, anyone trying to be frugal definitely check out your local Dollar General / Dollar Tree / Family Dollar type stores. Their seeds are actually pretty decent. There is a catch though.",
    "body": "So couldn’t help myself and bought a bunch of seeds from Dollar General. Talking about the blue and white packs you see all the time. American Seed Co, I believe. \n\nI got probably 250 radish seeds in a pack that cost 33 cents and I bet 220 of them sprouted. One pack of lettuce (25 cents) sowed a 6 ft round patch of beautiful, delicious leaf lettuce. One pack of peas (33 cents) has given me at least 2 gallons of peas. \n\nThere are a few down sides. First their quantities don’t seem to be super consistent. One pack you’ll get 50 pea seeds, the next you’ll get 12. But feeling around to make sure the pack is full will fix that. \n\nNext the seed packet info is next to useless. It’s just extremely general information. It has me sowing peppers and brassicas at the same time in 9b. Yeah…that ain’t happening. But again…simple fix. Just do a bit of research. \n\nLast is, they don’t have a super large variety. Just standard, mostly hybrid or long time favorite heirlooms. But if you’re spending a quarter for your basic lettuce you don’t feel so bad spending $6 for a pack of fancy tomatoes online. \n\nAs I was checking out, the clerk lady gave me the ol hand cupped over the mouth and said “at the end of the year they mark ‘em all down to 1 cent / pack”. So, keep that in mind.",
    "score": 891,
    "url": "",
    "created_utc": 1744019788.0,
    "author": "Queef_Stroganoff44"
  },
  {
    "title": "Welcome to zone 5b everyone",
    "body": "I need tots and pears please. All the tots and pears.",
    "score": 876,
    "url": "",
    "created_utc": 1744461688.0,
    "author": "Miserable-Age3502"
  },
  {
    "title": "Cherry 🍒",
    "body": "Love this one i spotted in my city.",
    "score": 865,
    "url": "",
    "created_utc": 1744297934.0,
    "author": "MudSensitive2635"
  },
  {
    "title": "First time growing blackcurrant from cuttings is it supposed to make fruit when it is this small or what are those balls?",
    "body": "",
    "score": 853,
    "url": "",
    "created_utc": 1744128789.0,
    "author": "user836382819927"
  },
  {
    "title": "Purple azalea appreciation post",
    "body": "This azalea always blooms a few weeks before the others, and this year the colors are almost fluorescent. I inherited an amazing garden from the couple who built our home in the 50’s, I’m desperately trying to do right by them! ",
    "score": 785,
    "url": "",
    "created_utc": 1744332519.0,
    "author": "Cucurbita_pepo1031"
  },
  {
    "title": "Strawberries from our garden",
    "body": "",
    "score": 748,
    "url": "",
    "created_utc": 1744235726.0,
    "author": "Candid_Way8045"
  },
  {
    "title": "Unexpected snow in April",
    "body": "A few days ago we got a very unexpected snowstorm. Not the best thing to happen when all your trees are flowering but at least I took some nice pictures. All the flowers are fine now,  but ofc the trees won't be having much fruit this year (we had 4 consecutive  nights with freezing temperatures)",
    "score": 782,
    "url": "",
    "created_utc": 1744491305.0,
    "author": "gabsgarden"
  },
  {
    "title": "If they don’t find you handsome… they should at least find you handy.",
    "body": "Wife: I need a potting bench, like today…\n\nMe: Say no more!",
    "score": 727,
    "url": "",
    "created_utc": 1744402110.0,
    "author": "master_hakka"
  },
  {
    "title": "Help: I planted baby carrots. For every carrot I planted, two different sprouts popped up. Which one is carrot, which one is a weed to be pulled?",
    "body": "",
    "score": 719,
    "url": "",
    "created_utc": 1744059445.0,
    "author": "Son2208"
  },
  {
    "title": "I planted this flowering tree when the trunk was the size of my finger.",
    "body": "Just took these pics. I love spring—my backyard smells like French perfume! :) Life is good. God is good. I planted this flowering tree when the trunk was the size of my finger.",
    "score": 782,
    "url": "",
    "created_utc": 1744496262.0,
    "author": "DreamCabin"
  },
  {
    "title": "There is only one right way. Strelitzia, in her home town of South Africa.",
    "body": "",
    "score": 709,
    "url": "",
    "created_utc": 1744353042.0,
    "author": "emkie"
  },
  {
    "title": "What’s the name of this incredible tulip? It multiplies every year.",
    "body": "",
    "score": 719,
    "url": "",
    "created_utc": 1744478719.0,
    "author": "Traindodger2"
  },
  {
    "title": "Found out that my passion flowers can be used in a vase, now I'm unstoppable",
    "body": "Specifically the *Passiflora alata* ones. I also have incarnata and what I think is edulis, but their stems seem much less sturdy",
    "score": 672,
    "url": "",
    "created_utc": 1744025197.0,
    "author": "heyhardinera"
  },
  {
    "title": "Why do mine tulip leaves have purple stripes on them?",
    "body": "So I bought tulip bulbs from the flower market in Amsterdam and planted them in Bosnia. Their leaves have purple stripes on them. So my question is are my tulip bulbs fucked and is there anything I can do?",
    "score": 668,
    "url": "",
    "created_utc": 1744456589.0,
    "author": "Ok_Part_8486"
  },
  {
    "title": "Who is he, why is he on my pecan tree?",
    "body": "Google is telling me it’s Lypusa Tokari but I don’t know if I should trust it. Also my dad started messing with it and it kinda started striking(?) him.",
    "score": 639,
    "url": "",
    "created_utc": 1744245267.0,
    "author": "Aizensusu"
  },
  {
    "title": "Who else is late in the game and is *buying* starts instead of growing your own under your grow lights because you haven't set them up in time this year? 🙋",
    "body": "I am so embarrassed ",
    "score": 606,
    "url": "",
    "created_utc": 1743966313.0,
    "author": "futureflavors"
  },
  {
    "title": "How it started / how it’s going : Five years of growth on my flowering cherry 🥹",
    "body": "",
    "score": 581,
    "url": "",
    "created_utc": 1743985535.0,
    "author": "Samincity10003"
  },
  {
    "title": "My first iris of the year",
    "body": "",
    "score": 541,
    "url": "",
    "created_utc": 1744401698.0,
    "author": "csanchez0731"
  },
  {
    "title": "10 year old dandelion",
    "body": "Since I saw many fellow dandelion lovers on this sub i thought you would all fancy a pic of my dandelion that lives in the same pot as my olive tree for almost 10 years now.",
    "score": 529,
    "url": "",
    "created_utc": 1743948621.0,
    "author": "Inktvisjes"
  },
  {
    "title": "I built a little greenhouse!",
    "body": "After seeing the little greenhouses some people made on this subreddit from last year, I decided to design and build my own.\n\nI saw some people that had entirely pvc pipe frames and were worried about them maybe blowing down. I attached mine to a wood frame, but I also filled the pvc pipe with sand. \n\nI can grow a few hundred seedlings in here! \n\n",
    "score": 527,
    "url": "",
    "created_utc": 1743975583.0,
    "author": "FamilyFunAccount420"
  },
  {
    "title": "Sharing My Baby Garden",
    "body": "My husband and I started gardening in earnest this year. I can’t wait for it all to establish, but watching for new growth and waiting for blooms brings me daily joy as well 💕\n",
    "score": 512,
    "url": "",
    "created_utc": 1744081967.0,
    "author": "tarr333"
  },
  {
    "title": "Banana tree",
    "body": "Can someone help me please? We planted this banana plant on March 2024. It flowered in January 2025 and now April the bananas look thin and small and the bananas on the lower part have not grown at all and look brown. How much time do bananas need more or less from flowering to harvesting? Does my plant/fruits look Ok to you? Should I do something? Or it just need time. I am in Central Florida.",
    "score": 503,
    "url": "",
    "created_utc": 1744060816.0,
    "author": "Hungry-Bicycle-750"
  },
  {
    "title": "What can I do with this ‘sinkhole’ ?",
    "body": "Let me know if there is a better word for it, sinkhole is what all my neighbors use to refer to them.\n\nAnyway, how would you landscape this? There is almost a constant rainwater pond down there, it dries out maybe twice a year for a few weeks. It's hard to think of ways to use this part of land and how to decorate the surrounding. It is a circular piece of woods and has many trees, shrubs and weeds all throughout. I would love to maybe have a koi pond or something semi low maintenance and beautiful to look at since this is the view of my kitchen.\n\nPlease let me know what your creative ideas are and how you would use it, Thank you!",
    "score": 487,
    "url": "",
    "created_utc": 1744391456.0,
    "author": "AbbreviationsKey9475"
  },
  {
    "title": "In defense of bugs 🐛🐞🪲",
    "body": "There have recently been several posts about bugs in this subreddit about “what is this bug and how do I get rid of it.” I totally get the instinct to remove bugs. But it’s worth remembering that we’re all part of a bigger ecosystem, and every creature, even the ones that seem pesky, plays a vital role.\n\nCaterpillars, for example, are essential in food chains. They’re herbivores, which puts them near the base of the trophic levels—just above the plants they eat. Predators like birds depend on them for survival. A single nest of chickadees, for example, needs 6,000 to 9,000 caterpillars to raise their young to maturity. That’s a mind-blowing number, right?\n\nWithout bugs like caterpillars, we lose pollinators, decomposers, and critical food sources for birds and other wildlife. And that all trickles back to us—less pollination = fewer fruits and veggies, disrupted soil = weaker crops, and so on.\n\nIf a bug isn’t invading your home or harming anything, the best thing to do is let it be. If you’re like me, you garden because you love nature. Living in balance with nature means not disrupting those who aren’t harming us. So please consider throwing away your pesticides and next time you spot a caterpillar munching away on a tree, leave it alone.",
    "score": 485,
    "url": "",
    "created_utc": 1744285580.0,
    "author": "New_Attorney5670"
  },
  {
    "title": "Empty spot on my property with very clay heavy soil; what to plant?",
    "body": "I'd love to huck wildflower seeds into it and just water as needed, but the soil is so heavy and clay like (I can squish it into a ball) that I wasn't sure they'd grow. \n\nMy other idea was to add a thin layer of gardening soil, then rocks, and plant sedum, hens and chicks, and maybe a yucca or two. \n\nAdvice? 9a Portland, OR ",
    "score": 467,
    "url": "",
    "created_utc": 1744317238.0,
    "author": "murder_hands"
  },
  {
    "title": "Sad about my patio garden.",
    "body": "Edit: thank you all for the kind words! I’m trying to respond to all but there were way more comments than I expected. I’m looking into community gardens now and a few other suggestions that you guys made, and I’m so grateful for the advice.\n\nThis can be removed if it’s not the right place to post, I just need a little vent. \n\nWe have lived in the same apartment for over three and a half years now, and each summer I’ve received nothing but compliments on how lovely my patio looks. Every single one of the apartment ladies, my neighbors, the maintenance guys, almost every time I am outside someone compliments it and says “I wish I could grow plants like you do!” It’s very heartwarming and I’ve even given away a few propagates to my neighbors and at least two of the apartment employees.\n\nNow the property manager says her regional manager thinks my patio is cluttered with too many pots and she agrees. We got a note on the door that says I have to remove the plants within 24 hours or pay a $150 fine. Mind you, I do have a lot of plants, but I meticulously place them all to be as visually appealing as possible. I’m studying botany and microbiology in college and these plants are very important to my studies. There are no plants in the walkway. I have shelving against the wall of the apartment and the other big plants are up against the railing rather than on top, out of sight, and I have moved them very little since we moved in a few years ago. The lease says I’m allowed to have potted plants, but at the managers discretion, so there’s really not much I can do. I moved everyone inside and my kitchen looks like a botanical garden.\n\nI already received too much devastating news this month and my plants are one of the few things that bring me any joy anymore. Maybe I’m just too sensitive, but it really upset me when she said my patio is a cluttered mess and threatened a fine. I have OCD and was raised by military people- I KNOW what neat and tidy looks like. \n\nIt is what it is I guess. Sorry for the long rant, my world is crumbling around me and this was the small straw that is threatening to break my back. 🥹",
    "score": 461,
    "url": "",
    "created_utc": 1744343117.0,
    "author": "Known_Egg_6399"
  },
  {
    "title": "Flowers that grow in both Ukraine and Massachusetts",
    "body": "We have new neighbors who are Ukrainian and I thought it might be nice to plant some flowers or flowering shrubs that grow there over here in our yard so they can look over and maybe see something of their country. \n\nAnybody know of Ukrainian varietals that will grow here? ",
    "score": 454,
    "url": "",
    "created_utc": 1743946992.0,
    "author": "IllyriaCervarro"
  },
  {
    "title": "A lovely glimpse of the sunset from my backyard garden...",
    "body": "",
    "score": 437,
    "url": "",
    "created_utc": 1744346289.0,
    "author": "tned45"
  },
  {
    "title": "In zone 6b the daffodils get snowed on at least 3 times every spring",
    "body": "",
    "score": 384,
    "url": "",
    "created_utc": 1744287451.0,
    "author": "Suspicious_Reply9642"
  },
  {
    "title": "From last year’s garden. Hope I see them again this year",
    "body": "Coming home to a forest of butterflies and Zinnia is all I could ask for.\n",
    "score": 375,
    "url": "",
    "created_utc": 1744428046.0,
    "author": "GoldmanSachzz"
  },
  {
    "title": "Growing tomatoes in my back yard",
    "body": "",
    "score": 370,
    "url": "",
    "created_utc": 1744122494.0,
    "author": "toddcirella"
  },
  {
    "title": "I think my cat might have a quest for me",
    "body": "",
    "score": 355,
    "url": "",
    "created_utc": 1743963422.0,
    "author": "iamsarahb89"
  },
  {
    "title": "Tomato leaves are turning yellow",
    "body": "Hi\nCan anyone help me understand why my tomatoes leaves are turning yellow? \nThank you",
    "score": 344,
    "url": "",
    "created_utc": 1744035377.0,
    "author": "mmkabri"
  },
  {
    "title": "My desert rose",
    "body": "",
    "score": 349,
    "url": "",
    "created_utc": 1744470064.0,
    "author": "Lila-Irene"
  },
  {
    "title": "I think I’m addicted",
    "body": "I went to bed at 11 last night with full intentions to sleep for work. At 1 AM I bought beneficial nematodes. By 3:30 AM I guess my brain was fully satisfied with all of the garden plot layouts I had thought of that it allowed me to sleep before waking up at 7. Since I received my community garden plot on Friday, I’ve gone for multiple hours every day. Is this normal???? And I never going to think about or care about anything else forever?? ",
    "score": 347,
    "url": "",
    "created_utc": 1744130172.0,
    "author": "Bens_kitchen"
  },
  {
    "title": "Part Time Gardener",
    "body": "One of my cherished hobbies is gardening—particularly the process of sowing seeds and nurturing a thriving vegetable garden. It serves as a fulfilling way to unwind and keep my mind positively engaged\n\nPS: My wife took this picture :P",
    "score": 318,
    "url": "",
    "created_utc": 1744279178.0,
    "author": "obaidtariq"
  },
  {
    "title": "Queen Earrings",
    "body": "This flower is called the queen's earrings \n",
    "score": 288,
    "url": "",
    "created_utc": 1744229557.0,
    "author": "Azalea_garden"
  },
  {
    "title": "Forgotten potatoes are now an alien life form - how to proceed?",
    "body": "tl;dr can/should I try and plant some of these babies alongside my new starts?\n\nIf it hadn’t snowed yesterday, I would have been getting potatoes in the ground today… instead I stayed inside and did a pantry inventory, which is how I discovered this…\n\nIt’s not that I didn’t *know* the potatoes were in the pantry… and it’s not that I didn’t know they were capable of this… but after two months of nagging the spouse about eating pantry potatoes rather than buying, I game up and I guess just selectively “forgot” - only to get a bit of a start when I started pulling things out out!\n\nI have never personally encountered this, so I’m looking for advice on what to do with these fellas. Plant? Eat? Compost? Bonus points for any advice that also passive-aggressively screams “I TOLD YOU SO” at my spouse…\n\n",
    "score": 277,
    "url": "",
    "created_utc": 1743977363.0,
    "author": "onthestickagain"
  },
  {
    "title": "these tulips and daffodils are insane.",
    "body": "",
    "score": 275,
    "url": "",
    "created_utc": 1744252211.0,
    "author": "MentalCelebration542"
  },
  {
    "title": "I’m getting super sick of this.",
    "body": "I guess I’ll just have to put fencing around these fig trees that deer supposedly don’t eat…",
    "score": 262,
    "url": "",
    "created_utc": 1743957576.0,
    "author": "JwPATX"
  },
  {
    "title": "How the heck do people in 4B and below stay sane in April?",
    "body": "I heard it still snows and gets below 32°F there in April, how the heck do you people stay sane?",
    "score": 253,
    "url": "",
    "created_utc": 1744075585.0,
    "author": "Broad-Cartoonist-973"
  },
  {
    "title": "What are your favorite, random “sleeper” tools?",
    "body": "I had some skewers laying around and they’ve surprisingly become my favorite “sleeper” tool… something I wouldn’t have ever thought of being so useful! \n\nI’ve cut them in half and used them as mini stakes for seedlings, used them as a poker tool to loosen up seedlings when I’m sizing up pots, used them as the stick to my labels, etc. They come in handy in so many ways. \n\nWhat are some of the favorite, random “tools” you use that have the most utility?",
    "score": 244,
    "url": "",
    "created_utc": 1744493909.0,
    "author": "Afmudbone"
  },
  {
    "title": "first harvest from my golden raspberry bush",
    "body": "",
    "score": 239,
    "url": "",
    "created_utc": 1744087604.0,
    "author": "stayinalive_123"
  },
  {
    "title": "Martha Stewart Soil Sucks",
    "body": "It also has weird shit it in. I found a few pieces of broken glass and even some sidewalk chalk in the 3 bags a friend gave me. \n\nDon’t use it. It sucks. Trust me. ",
    "score": 233,
    "url": "",
    "created_utc": 1744463333.0,
    "author": "BostonFishGolf"
  },
  {
    "title": "A small garden I built for my mother, we added the alpines and rockery over the weekend! Looking forward to seeing it all grow in!",
    "body": "",
    "score": 232,
    "url": "",
    "created_utc": 1744052731.0,
    "author": "SameCycle2974"
  },
  {
    "title": "Classic rookie mistake",
    "body": "I threw a bunch of seeds into a pot and didn’t label them because “I’ll remember” \nOne month later: I have only an inkling to what’s what. Possibilities are echinacea, maybe bee balm or butterfly weed, and zinnia \nAny help sorting these out is greatly appreciated! \n",
    "score": 231,
    "url": "",
    "created_utc": 1744200921.0,
    "author": "Livid-Algae-9813"
  },
  {
    "title": "Orange azalea",
    "body": "",
    "score": 235,
    "url": "",
    "created_utc": 1744502013.0,
    "author": "drchopsalot"
  },
  {
    "title": "How it started vs how it's going",
    "body": "",
    "score": 220,
    "url": "",
    "created_utc": 1744397004.0,
    "author": "Joeykandah"
  },
  {
    "title": "Neighborhood kid ran over my park strip plants",
    "body": "For the second time, a neighborhood kid ran over plants in my parking strip. \n\nI’m devastated because I love my plants and wanted a cottage style garden space people can enjoy as they walk past. I’ve been working on this garden for the last two months. \n\nThe first time we chalked it up to an accident and let it slide. \n\nThe second time, the teen ran his bike right through the center of three lavenders, three verbena de la minas, one African daisy, and one whirling butterflies gaura. I have broken branches and plants with stems broken right down the base and of course lavender that is squished down the middle. Each plant cost me about $12, not to mention the zinnia/cosmo/shasta daisy seedlings in between, so it’s not nothing. \n\nI’m still giving the kid the benefit of the doubt and let his parent know what happened, that I was the second time and if they could please remind him to not ride there in case it was intentional. They did not take it well…\n\nNot sure what to do, I’m tempted to take it all out and replace with ground cover, but I’m thinking that’s my sadness talking. \n\nUpdate:\nI did end up filing a police report, but didn’t press charges. I would prefer to protect our peace and just end this here instead of continuing something that would bring more drama and my husband is in agreement, but now we have some recourse if it happens again or escalates. I also saved our video evidence so it doesn’t get deleted. \n\nI will leave the plants there to see if they recover, though I feel lavender will have a tough time bouncing back from being smashed down the middle and may not recover to a pleasant mounded shape. If I remove them, I’m considering bougainvillea since it does well here and the ones I have in my backyard are mean and tough as hell as well as adding boulders. \nMany swears are sweared when I prune them. \nI’m not sure how to keep it as ground cover or prune it in a cottage garden style.\n\nI appreciate y’all for understanding my garden woes 😂❤️\n\n",
    "score": 219,
    "url": "",
    "created_utc": 1743987622.0,
    "author": "tarr333"
  },
  {
    "title": "My garden is starting to bloom!",
    "body": "",
    "score": 212,
    "url": "",
    "created_utc": 1744165428.0,
    "author": "GalaIglesias"
  },
  {
    "title": "Japanese Maple is “dull red” this year.",
    "body": "This is our pretty mature Japanese Maple. We love this tree and it’s an anchor in our lower garden.  Usually in the Spring it comes in much brighter red.  I’ve tried to research a bit and can’t find anything that says duller red is an indicator it’s disease.  We are in NC and other than maybe later frost this year and lots of pollen everything has been normal.  ",
    "score": 213,
    "url": "",
    "created_utc": 1744032198.0,
    "author": "Skybrinks"
  },
  {
    "title": "Oh so it likes the compost bin and being ignored",
    "body": "This is growing out of the lazy garden compost bin I throw stuff into at the end of the season that won't winter over well. Pretty sure this is the resurrection of the lemon balm that refused to live in the planter I had it in last year. Growing not in soil but genuinely just a pile of dried out branches and old leaves. \n\nIt's mocking me, clearly. ",
    "score": 213,
    "url": "",
    "created_utc": 1744460597.0,
    "author": "justprettymuchdone"
  },
  {
    "title": "Blueberries, 3 year progress",
    "body": "\nAfter 3 years of hard work my blueberry plants that I started from seed are showing their first flowers! The bushes are nearing about 4 feet tall and we could be getting some fruit this summer!\n\nI started them out in an apartment moving my seedlings from window to window twice a day for a year in order to get sun. Now I rent a townhouse with a tiny backyard that has 15 plants! I'm feeling so fulfilled knowing I got it all right.",
    "score": 211,
    "url": "",
    "created_utc": 1744132218.0,
    "author": "FHQWHGADMANS123"
  },
  {
    "title": "This guy is popping off in the club right now.",
    "body": "Pretty sure I should just start putting down amaryllis bulbs everywhere. ",
    "score": 206,
    "url": "",
    "created_utc": 1744054587.0,
    "author": "ViciousAsparagusFart"
  },
  {
    "title": "The bees are in action!",
    "body": "",
    "score": 206,
    "url": "",
    "created_utc": 1743948074.0,
    "author": "alleyrope"
  },
  {
    "title": "Black tulip magnolia tree has 2 different flower blooms",
    "body": "My black tulip magnolia is blooming and it’s producing 2 different flowers.  One is the traditional black tulip bulb-like short petal flower and the other one is a longer petal flower.  Is my magnolia a hybrid?",
    "score": 200,
    "url": "",
    "created_utc": 1744145260.0,
    "author": "kermsims"
  },
  {
    "title": "Hand stamped Garden Tags",
    "body": "Made a couple more garden tags/bling for my garden",
    "score": 202,
    "url": "",
    "created_utc": 1744313711.0,
    "author": "Rough-Brick-7137"
  },
  {
    "title": "This Dark Rose Looks Fake Compared To The Others",
    "body": "No filter whatsoever, just taken at different angles. You can easily point it out all the way from the road! It's breath-taking that something so vibrant is grown naturally. No fertilizer or any special soil, just water and sun ☀️ ",
    "score": 193,
    "url": "",
    "created_utc": 1744290229.0,
    "author": "ImmediateMistake9191"
  },
  {
    "title": "Person asking questions on a first date knowing I'm autistic: is that your special interest? Me realizing I have managed not to drop a plant fact for nearly two hours: uh no",
    "body": "",
    "score": 180,
    "url": "",
    "created_utc": 1744451308.0,
    "author": "TXPersonified"
  },
  {
    "title": "Any salvaging these hydrangeas?",
    "body": "There's some new growth but doesn't seem like anything is coming up from those shoots. \n\nI'm on 7b, BTW. \n\nThanks in advance! ",
    "score": 181,
    "url": "",
    "created_utc": 1744030828.0,
    "author": "RippingAallDay"
  },
  {
    "title": "Turned a simple pallet into a vertical flower garden for my small backyard! Still learning, any tips to make it even better?",
    "body": "",
    "score": 171,
    "url": "",
    "created_utc": 1744276457.0,
    "author": "GlamorousKinkyDivine"
  }
]