[
  {
    "title": "Never ceases to amaze me when people decide to ride a foil at the most crowded spots possible.",
    "body": "",
    "score": 575,
    "url": "",
    "created_utc": 1743950002.0,
    "author": "BarefootCameraman"
  },
  {
    "title": "Airs can be pretty sick, actually.",
    "body": "Do they get overscored? Yes, all the time. But let's stop acting like there's some battle between \"style\" and aerials. This air from Italo was insanely cool, I don't care what decade you're from. That lip is pitching over him as he hits it 🚀",
    "score": 504,
    "url": "",
    "created_utc": 1744387765.0,
    "author": "TheBungoMungo"
  },
  {
    "title": "Waikiki this morning. Probably the best photo I've ever taken",
    "body": "",
    "score": 372,
    "url": "",
    "created_utc": 1744442916.0,
    "author": "360Logic"
  },
  {
    "title": "Surfline has REMOVED the ability to watch LIVE CAMS on your computer for free",
    "body": "The enshitification continues boys. If you don't know, surfline now only lets you watch yesterday's stream. Live cams at all surf spots are only availible to premium users. \n\nNo longer can we have a live stream of the surf on our computers while we do other work or just have it on in the background. \n\nAds every 15 seconds aren't enough for these greedy people apparently. Its only a matter of time until they roll this out on all platforms mark my words.\n\nAll the boys hate surfline. \n\n\n\nEdit:\n\nTo clear any confusion for the Surfline defenders, a premium subscription should only offer premium benefits. Add a glance reports, past broadcasts, and any highlights offered, are premium. Charging to even view live cams on cams they don't even own, just have exclusive rights to use, and monopolize, is exploitative and an extremely scummy business model. I can't respect anybody who defends these practices. This WILL continue to get worse because corporations like surfline depend on people being okay with this kind of stuff until the next thing comes thats even worse and more exploitative. They have successfully created a problem and are now charging for the solution. ",
    "score": 355,
    "url": "",
    "created_utc": 1744143843.0,
    "author": "graphite-777"
  },
  {
    "title": "Its official: SURFLINE HAS REMOVED ALL LIVE CAMS to non-premium users",
    "body": "DO NOT UPDATE THE SURFLINE APP. They say the update has only bug fixes but it's a lie. After updating you will be greeted with every cam only showing yesterday's footage. \n\nThe Surfline monopoly has finally paid off for them, and the true enshitification has occurred. You have no other options to watch cams unless you want to shell out money to these greedy scumbags. \n\nThe only thing surfline offers for non-premium users is forecasts, which we all know how good those are...\n\nI recommend wind guru for forecasting as they do it a lot better. As of now there are no other cam options to view cams except any random local ones you may have near you. \n\nFuck Surfline. Fuck monopolys. ",
    "score": 270,
    "url": "",
    "created_utc": 1744215612.0,
    "author": "graphite-777"
  },
  {
    "title": "DELETE Surfline app",
    "body": "I just did it this morning cause what fucking use are they if I can't even check a goddamn live cam for 10 seconds? \n\nSure, I can see the tide and wind. But I can google all that in 5 seconds. So FUCK SURFLINE. Delete that shit.\n\nIdk if deleting the app will actually hurt them, but it won't help. So FUCK SURFLINE. Delete that shit.",
    "score": 223,
    "url": "",
    "created_utc": 1744212331.0,
    "author": "KingofRears"
  },
  {
    "title": "I shaped my first board",
    "body": "Posting this to hopefully inspire some surfers to build a board. Everyone says your first few boards will turn out terribly. But, if you take each step slowly and carefully, you can make something cool. Patience… \n\nThe general design of it kinda sucks but I was going for a fun small wave board anyway. \n\n6’6” x 21” x 2.5” \nEPS / Epoxy \n6oz bottom + 6oz patch\n2 x 4oz deck + 4oz patch\nClose quad cluster to feel more like a twin\n\nI now realize how much EPS sucks, and how annoying epoxy is to work with. People recommend keeping your first board simple (no color), but since I wanted to learn as many techniques as I could, I went for this crazy resin job. Was so exciting seeing that lamination work out.",
    "score": 222,
    "url": "",
    "created_utc": 1744149649.0,
    "author": "colterx"
  },
  {
    "title": "I love texas",
    "body": "",
    "score": 205,
    "url": "",
    "created_utc": 1744295435.0,
    "author": "DiverProfessional898"
  },
  {
    "title": "Young Florenceses (2005)",
    "body": "",
    "score": 170,
    "url": "",
    "created_utc": 1744136001.0,
    "author": "GoodOlBluesBrother"
  },
  {
    "title": "Why would Slater and co. want to build a wave pool in Abu Dhabi . Who goes there ? Whose gonna use it ? And how come Kelly didn't catch any flak for building in a country where homosexuality is punishable by death .",
    "body": "",
    "score": 162,
    "url": "",
    "created_utc": 1744429777.0,
    "author": "grapsta"
  },
  {
    "title": "Palpatine has entered the chat",
    "body": "",
    "score": 136,
    "url": "",
    "created_utc": 1744386263.0,
    "author": "llNormalGuyll"
  },
  {
    "title": "Imagine the waves on Pangea",
    "body": "The swells would cross almost the entire globe building up so much energy. Surf must have gone crazy",
    "score": 119,
    "url": "",
    "created_utc": 1743970128.0,
    "author": "TheGuyWhoDoesThings"
  },
  {
    "title": "Momentum Generation Vs Modern Surf YouTubers",
    "body": "One crew had grainy footage, punk soundtracks, and changed the culture forever. The other has drones, edits in 4K, and gets millions of views. But who’s really got the soul, and who’s just selling it? Would love to hear your thoughts",
    "score": 120,
    "url": "",
    "created_utc": 1744031264.0,
    "author": "BarrelBandit"
  },
  {
    "title": "What are some of the scariest situations you've been in while surfing?",
    "body": "Mine are a kind of mundane but there's three. First was surfing at Blacks on a good sized day and a canyon set rolled in! I managed to scratch to the horizon and get myself exactly where you'd never want to be. Second was paddling for my life at Fort Point during an outgoing tide. Last one didn't totally bug me out but I was sitting outside with a friend at OBSF when a really big and boxy fin went by us. I'm sure it was a whale but it reminded me how small I was in the ocean. I know a good portion of surfers are stoic and act unfazed but we've all had our Oh Sh$% moments. ",
    "score": 114,
    "url": "",
    "created_utc": 1744226143.0,
    "author": "kidzwitskidz"
  },
  {
    "title": "Daily fuck Surfline thread",
    "body": "Taking away the ability to even watch the cam for 3 seconds before a 90 minute ad is just insane. Surfline is ran by kooks, total sell outs. ",
    "score": 114,
    "url": "",
    "created_utc": 1744211112.0,
    "author": "EcstaticBoysenberry"
  },
  {
    "title": "Easter in  Peru",
    "body": "🇵🇪 ",
    "score": 111,
    "url": "",
    "created_utc": 1744423725.0,
    "author": "maumau2168"
  },
  {
    "title": "It was popping today in Rockaway Beach - NYC",
    "body": "",
    "score": 104,
    "url": "",
    "created_utc": 1744510660.0,
    "author": "Surfing_Nurse"
  },
  {
    "title": "STAB article on the tariffs....pretty interesting",
    "body": "  \nSTAB just put out a pretty well written and thoughtful article about how these tariffs will affect the industry. I won't post/steal the whole article but here's a couple quotes.  Surprisingly Biolos comes off pretty well (I haven't agreed with a lot of his \"philosophies\" in the past. Pyzel as well.  Anyway, if you have an account go check it out it's pretty interesting. [https://stabmag.com/features/how-will-the-us-tariffs-looming-recession-affect-surfboard-prices/](https://stabmag.com/features/how-will-the-us-tariffs-looming-recession-affect-surfboard-prices/) :\n\n**Stab: You’ve been thinking about surfboard tariffs for over two decades. Why is this such a big deal to you?**\n\nMatt Biolos: Well, for me, it goes all the way back to the early 2000s. That was when Surf Tech came in like a wrecking ball. They were taking all these board designs, mass-producing them overseas, and dumping them into the U.S. market. And they were aggressive about it. They were approaching every big name in surfboards to license their models. And most guys took the deal. Channel Islands, Rusty, Donald Takayama — they all did deals with Surf Tech. And people were telling me I should too. I had people saying, “If you don’t do a deal, you’re going to be out of business.”\n\n  \n**Jon Pyzel is, in his words, “probably on the opposite end of the political spectrum from Matt Biolos.” He runs a B Corp-certified surfboard business with his wife Dali. And while he doesn’t pretend to make “sustainable” surfboards — because, as he points out, nobody really does — Pyzel Surfboards tries to offset some of the damage. That means paying employees fairly, hiring underrepresented folks, and making sure people aren’t getting screwed over in the supply chain.**\n\n**Unlike many of his peers, Pyzel doesn’t manufacture boards in Asia. Outside his two factories in Oceanside and Haleiwa, he works with licensees to build boards regionally.**\n\n**Stab: What’s your first impression on these new tariffs?**\n\nJon Pyzel: I mean, who knows what’s really happening? Every day there’s a different headline. One minute it’s 10% on everything. The next day it’s 25% on Mexico. It’s chaotic. I’ve got a close friend, Andrew Jakubowski, who owns Arctic Foam, and he’s just tripping out. He’s like, “How am I supposed to plan my business?” And I get that. It’s a hard time to be running anything that depends on international trade.\n\nWe’ve used Arctic Foam for years. They make great blanks down in Ensenada. So if something drastic happens — if suddenly the cost of those blanks jumps significantly — yeah, there’s a chance we’ll have to look at other options. There’s no “extra” for us to absorb those costs. Margins are already razor thin. But I’d still try to support Arctic as much as possible. I believe in them.\n\n**Would that mean switching to U.S.-made blanks if prices equalize?**\n\nPossibly. I’m not going to lie and say we’d just eat the cost forever. If U.S. blanks suddenly became the same price as what I was paying for Mexican ones, we’d probably make the switch. Not because we want to, but because we have to. Surfboards are expensive to make and margins are already incredibly small.",
    "score": 85,
    "url": "",
    "created_utc": 1744031643.0,
    "author": "Known_Lengthiness_11"
  },
  {
    "title": "My second go at making a surfboard.",
    "body": "Hand shaped a mini Mal in 2001 but had it professionally glassed. Took another stab at it but this time went the shape3d cnc route because i cant mess too much. Used the Twinzer fish template and decreased rocker a bit. 5'8 37litres. Struggled with the fcs because the cnc didn't cut the holes deep enough...I'll make jigs for my next boards.\n\n",
    "score": 85,
    "url": "",
    "created_utc": 1744397991.0,
    "author": "darook73"
  },
  {
    "title": "$2,000 Foamie",
    "body": "Not just one… but two boost fins",
    "score": 84,
    "url": "",
    "created_utc": 1744318920.0,
    "author": "-SassyTheSasquatch"
  },
  {
    "title": "New Torren Video",
    "body": "Tuck in with a cup of coffee/tea and just relax for a bit and enjoy. Always such nice vibes",
    "score": 65,
    "url": "",
    "created_utc": 1744338287.0,
    "author": "greasedupbeefcake"
  },
  {
    "title": "Landes 2025",
    "body": "",
    "score": 61,
    "url": "",
    "created_utc": 1743965412.0,
    "author": "anticafard"
  },
  {
    "title": "My interpretation of pipe on the 23 of March",
    "body": "It was big and everywhere ",
    "score": 48,
    "url": "",
    "created_utc": 1744406718.0,
    "author": "tokseo"
  },
  {
    "title": "Tips on back hand? Video attached",
    "body": "Tips for backhand hits to the lip? Where to put weight, arms, etc? My form looks like shit haha ",
    "score": 48,
    "url": "",
    "created_utc": 1744310240.0,
    "author": "tattoo22903u4928"
  },
  {
    "title": "rate my fin setup guys",
    "body": "it goes straight well",
    "score": 42,
    "url": "",
    "created_utc": 1744298338.0,
    "author": "broseidonswrath"
  },
  {
    "title": "How do i convince my girlfriend that traveling to Nicaragua is safe?",
    "body": "How do i convince my girlfriend that traveling to Nicaragua is safe?\n\nI've been there like 5 times. We go straight from managua airport to popoyo, which is super touristy and protected. How do i make her feel at ease? I understand where she's coming from but once you go there for yourself you realize it's pretty chill.",
    "score": 42,
    "url": "",
    "created_utc": 1743961293.0,
    "author": "Altruistic_Hope831"
  },
  {
    "title": "Thoughts On Dark Arts Boards?",
    "body": "Recently bought this from a second hand boards shop, it genuinely feels noticeably faster and lighter than most boards. Though im wondering if that’s just a placebo since I think it looks sick. Anyone have any insight or experience to share on dark arts boards?",
    "score": 38,
    "url": "",
    "created_utc": 1744295502.0,
    "author": "BarrelBandit"
  },
  {
    "title": "Anyone got back in the water after a long time away, how long until you were happy with how you were surfing?",
    "body": "Hi all,\n\nAbout 5 years ago I broke 3 ribs in the surf which put me out for a fair chunk on time, before being able to get back to it I had a knee injury resulting in surgery and then another knee injury which had kept me from surfing for the past 5 years. \n\nI use to surf 2-4 days a week depending on work and the conditions. I am now all clear from the doctor and physio to surf again.\n\nI’ve sold all my boards over the past 5 years, put on about 12kg/25lbs and am planning to pick up a board and go for a paddle this weekend.\n\nHas anyone else been in a similar situation, how did you find getting back to it after a long break, I’m hoping it’s going to be like riding a bike but I’m also expecting to feel like an absolute kook.\n\nAlso any recommendations for boards to start back with, currently just have beach breaks close to home. Weigh around 95kg/210lbs. I use to ride anything from 5’10-6’2 and 32-35L, thinking now to get something over 7’ and 50L and just cruise around on small days.\n\n\n",
    "score": 37,
    "url": "",
    "created_utc": 1744057257.0,
    "author": "2kidsto3mothers"
  },
  {
    "title": "Last one from this winter",
    "body": "",
    "score": 32,
    "url": "",
    "created_utc": 1744392128.0,
    "author": "anticafard"
  },
  {
    "title": "Anyone in the Invercargill/Dunedin area? Pic for attention lol.",
    "body": "Down here cruising for a few days and on the hunt for some surf. I have a few spots in mind but looking to link up with some locals. Also what forecast are you looking at, swellnet? ",
    "score": 34,
    "url": "",
    "created_utc": 1744000084.0,
    "author": "Garand_guy_321"
  },
  {
    "title": "barrel or no",
    "body": "",
    "score": 35,
    "url": "",
    "created_utc": 1744136252.0,
    "author": "broseidonswrath"
  },
  {
    "title": "Putting up a free surf cam",
    "body": "Just bought a house the second row back from a solid beach break and as there’s no surf cam for that area, I’m thinking about putting one up on the third story/lookout roof of my house.  Seriously insane views of the surf from up there.  Anyone who’s done this who can let me know best cams for hosting a live feed in a wet ass area that gets super high winds somewhat frequently?? Prefer to keep it free to view vs on Surfline or something where people have to pay a fee. Thanks dawgs \n\nETA: k change of plan i’m not putting up a cam. fun idea for a minute tho ",
    "score": 26,
    "url": "",
    "created_utc": 1744044243.0,
    "author": "iamnotroalddahl"
  },
  {
    "title": "Surfers Ear in Mexico?",
    "body": "So I pulled the trigger, sold everything and moved to Nayarit a couple of years ago. I still work, and I'm not rich, but I couldn't be happier with my life in Mexico. Even though I'm in warm water here, my surfers ear has finally caught up with me and I'm completely closed in my right ear. \n\nMy insurance in Mexico only covers inpatient, catastrophic, so I'll be handling this out of pocket. I'm no longer insured in the US, so hopefully the cost isn't too crazy.  I'm going to talk to a couple of doctors here and get a feel for them, the procedure they use and the cost. \n\n**Long shot, but I'm just curious if anyone has had this surgery anywhere in Mexico?** \n\nI'm willing to look for a doctor in Baja/TJ where surfers ear is surely more common. \n\nWish me luck, and wear ear plugs kids!",
    "score": 26,
    "url": "",
    "created_utc": 1744338304.0,
    "author": "stiladam"
  },
  {
    "title": "Free SoCal Surf Cams",
    "body": "With the post about surfline locking their cams behind a paywall, I thought people in SoCal should know about swell magnet. They host free cams from Malibu to San Diego.",
    "score": 20,
    "url": "",
    "created_utc": 1744177930.0,
    "author": "awildpotato"
  },
  {
    "title": "Slacklining for Surfers Back Pain",
    "body": "Been regularly surfing for a year now and encountered severe back pain after long paddle sessions. I am closer to 40 than to 30 so what did I expect... anyway - I tried some of those YouTube videos for surfers back pain (legs up the wall etc...) and it did not really help me. \n\nWhat does the trick for me is going on my slackline for 10 minutes after longer sessions - totally does the trick for me - no more back pain! It's actually quite logical as the passive back musculature is heavily demanded when \"slacklining\" (I don't even know if that is a term or if I just made it up).\n\nSo - I am thinking about changing career to become a YouTube content creator that I might call \"Slacklining for Surfers\" - or even have an app where I would post videos of me on the slackline especially for surfers (with content I stole from other youtubers) - a subscription would only be 24,99€ a month or 199,99€ for a year (yes - I am european).\n\nAm I a good surfer? Absolutely not! I suck badly! But isn't that a requirement in itself to become an online surf coach?\n\nAnyway - stay tuned for further updates! \n\nTLDR: Old and back pain after surfing? Try some slackline after sessions! ",
    "score": 16,
    "url": "",
    "created_utc": 1744273680.0,
    "author": "Tubetraveller89"
  },
  {
    "title": "WSL Sucks....but Punta Roca is firing this morning for the finals....",
    "body": "Women in the water and Simmers just caught a bomb that might have been too big/powerful for her.\n\nhttps://preview.redd.it/q704tdxtneue1.png?width=1212&amp;format=png&amp;auto=webp&amp;s=1eebf44af1748403f220b86a64a7f6a30074d548\n\n",
    "score": 15,
    "url": "",
    "created_utc": 1744464274.0,
    "author": "Kovy2000"
  },
  {
    "title": "Dilemma",
    "body": "Wife is 5 days past due date and there is a swell. Should I paddle out?",
    "score": 15,
    "url": "",
    "created_utc": 1743941449.0,
    "author": "Spiritual_Abalone322"
  },
  {
    "title": "Jordy Smith riding a Mayhem in the WSL El Salvador Semi Final",
    "body": "I read Jordy’s dad Graham used to hold the license for shaping LOST boards in South Africa but Jordy has been riding exclusively SMTH shapes for a while. \n\nAnybody know why the switch and the details on the Mayhem board he’s riding? \n\nI can only assume the SMTH boards he had brought for the event weren’t working great for onshore Punta Roca. Wonder if he had the Mayhem with him as backup…\n\nEDIT: Had to pull up the clip to make sure I wasn’t seeing things. Watch the last 5-10 seconds of the Semi-final heat replay against Cole Houshmand as Jordy is exiting the water for a clear view of the Lady Gaga board.\n\nhttps://youtu.be/ApXkZfeFxFA?si=do2rULB0QxV99pQL",
    "score": 15,
    "url": "",
    "created_utc": 1744478844.0,
    "author": "No_Dimension6375"
  },
  {
    "title": "Beloved Momentum Generation Hero Greg Browning Succumbs to ALS",
    "body": "",
    "score": 13,
    "url": "",
    "created_utc": 1744498490.0,
    "author": "dumbassthenes"
  },
  {
    "title": "May you burn on Mustafar",
    "body": "",
    "score": 12,
    "url": "",
    "created_utc": 1744257550.0,
    "author": "llNormalGuyll"
  },
  {
    "title": "Is Buell Wetsuits still open?",
    "body": "Are they still in business? An add popped up that they were having a clearance sale so I ordered a new wetsuit and booties for my son. This was last week and no notice for shipping has gone out yet. I tried calling the number listed but it says out of service. I emailed them but no response. ",
    "score": 13,
    "url": "",
    "created_utc": 1744223935.0,
    "author": "baloneyboobs2"
  },
  {
    "title": "rate my waxwork!",
    "body": "setting the intention! ",
    "score": 14,
    "url": "",
    "created_utc": 1744380733.0,
    "author": "brane-stormer"
  },
  {
    "title": "It’s pumping at doho!",
    "body": "Seems to be some sort of glitch. Thought it was funny. Looked at the cam and it was 1-2 max.",
    "score": 11,
    "url": "",
    "created_utc": 1744344710.0,
    "author": "Iwillnotbeyoirfriend"
  },
  {
    "title": "Whats ya favorite kind of wave?",
    "body": "So I'm interested in what people prefer. I love a sand bottom point break, but that's maybe because I've grown up with them. Something about the magic of the lind up sand and top to bottom barrels gets me amped.  I'd say peaky beach break barrels are second. Backdoor a section and get absolutely slotted before kicking out a few 80m from where you take off from.\n\nI need to spend more time in coral reef was before I'm super comfortable getting dragged over the coral heads.\n\nWhats your favorite setup?",
    "score": 10,
    "url": "",
    "created_utc": 1744365785.0,
    "author": "Parko-is-a-good-boy"
  },
  {
    "title": "Ryan Burch explains his deck contours",
    "body": "He drops the v-bomb an awful lot",
    "score": 11,
    "url": "",
    "created_utc": 1744518396.0,
    "author": "Elgabish"
  },
  {
    "title": "How long would it take to learn to surf pipeline?",
    "body": "Edit:  I'm just trying to get a sense of what it takes. Is it a case of having to be a lifetime surfer and super talented, or is it something that someone could learn and train for over a shorter period of time. I'm not planning on it. That would be insane.",
    "score": 8,
    "url": "",
    "created_utc": 1744086015.0,
    "author": "baconpancakesrock"
  },
  {
    "title": "Surf Forecasta",
    "body": "Hey all, regarding this talk about Surfline…I’ve been using Wave Cast for a while now. It’s been reliable and free. Updates every Tuesday and Thursday. Just thought I’d share. Ya no cams. But it helps with the big picture stuff. ",
    "score": 9,
    "url": "",
    "created_utc": 1744251530.0,
    "author": "Life_in_Bones"
  },
  {
    "title": "Twin fin rear foot position for turns in smaller waves",
    "body": "I have a few different types of boards but for the last several years I have primarily been riding a traditional fish - beaked nose, if you squint there is rocker, thinner tail. My question is primarily around rear foot position during turns - where should my back be relative to the rails when executing turns? If going frontside, does it make sense to position back foot more towards the beach, further away from the inside rail? I found this helps in smaller/weaker surf but want to ensure it’s not a bad habit",
    "score": 8,
    "url": "",
    "created_utc": 1744211691.0,
    "author": "ilikebourbon_"
  },
  {
    "title": "Ozzy Wright Talks About Surfing Life with Airs, Artworks & Music with his band \"The Goons Of Doom\"",
    "body": "",
    "score": 8,
    "url": "",
    "created_utc": 1743995097.0,
    "author": "_gre2199"
  },
  {
    "title": "South Sumatra…or other suggestions?",
    "body": "Planning a budget trip from Aus in late Feb 2026 for myself and my wife who doesn’t surf. I’m only an intermediate surfer and very unfit these days as I no longer live on the coast. \n\nLooking around Krui because it looks to have a few wave options and I’m wondering if there are some protected spots with smaller waves if the swell does kick up. \n\nWe have a window a month later at the end of March which historically looks more manageable in terms of size, but it’s Ramadan and a couple of the places i have enquired at are shut. \n\nAny other suggestions would be awesome. I was keen on Sri Lanka, but the flight costs are a killer, as well as the time lost to get there and back as we only have a 10 day window away from the kids. \n\nNeeds to tick a few boxes:\n\n- Suitable for intermediate surfer with some right hand options. \n- Wife friendly. Doesn’t need to be fancy, just need some things to do aside from surfing i.e. just cruising around on scooter and checking out some food spots and waterfalls etc. \n- Total budget 6k (it’s the flights that are a killer). \n- Not Bali. Been there done that. ",
    "score": 7,
    "url": "",
    "created_utc": 1743937743.0,
    "author": "fckyashtup"
  },
  {
    "title": "Papi only goes out if it’s double over head",
    "body": "Said 25ft earlier today here too, seems accurate. Prolly cause I don’t have the AI",
    "score": 7,
    "url": "",
    "created_utc": 1744320209.0,
    "author": "royalchoch"
  },
  {
    "title": "Arizona Wave Pool",
    "body": "Going to be in Phoenix for a few days. Thinking about going to the revel surf park in Mesa for a day or two. \nAnyone been there? What wave did you surf, any tips on boards to bring, or just general stuff? \nComing from Santa Cruz for context .",
    "score": 6,
    "url": "",
    "created_utc": 1744311403.0,
    "author": "mailboxhead007"
  },
  {
    "title": "Sub Driver 3.0 sizing",
    "body": "**Curious to hear any experience with sizing the Sub Driver 3.0**. Any thoughts on ideal length in relation to your height? Do you want it a little shorter than a standard shortboard because it's a small wave performance board? Is right at your height good? I saw a couple things saying Sub Driver 2.0 went best a little shorter.\n\nI'm looking at getting my first \"performance\" shortboard a it seems like a good option for a true shortboard, without having as much rocker like the Driver. \n\nFor reference, I'm: 6'1\", 175 lb , intermediate, still progressing, surfing mediocre waves in Oregon, with a couple tropical trips per year. This would be my board for when the waves are decent+, and I want to push my progression. I'm moving down in volume slowly as I progress - coming from a Lost / Lib Tech Quiver Killer 6'0\" 34.9L (*feels solid in good waves, but kinda sluggish in mediocre waves, probably because it's a little oversized and a lib-tech*). I have an RNF96 5'8\" 33L that has been my go to for smaller days (*love the RNF, kinda attracted to the SD3.0 as a step up from this in the quiver*). Looking at 6'0 30.7L and 6'1 32L for the SD3.0. Considering going custom and adding a liter or two to the 6'0, cause I'm not sure I'm ready for 30.7L.\n\nAight now tell me why I'm wrong about everything thanks",
    "score": 6,
    "url": "",
    "created_utc": 1744255533.0,
    "author": "adventuresofsleepyD"
  },
  {
    "title": "Fin box placement for big wave board?",
    "body": "For an 8’6” gun quad/thruster I’ve seen anything from 12-16 inches for the side front boxes, rears 5-7”?? and centre rear from 4-6”…\n\nSpacing from the rail 1-1 3/8” for the front fins? And no ideas for quad rears??\n\n\n\n",
    "score": 7,
    "url": "",
    "created_utc": 1744092332.0,
    "author": "Mountain-Condition-8"
  },
  {
    "title": "Thoughts on this board?",
    "body": "A friend found this board in the neighborhood. Pressure dents are pretty big and deeper than any I've seen as you can kind of see in the second photo. Thinking I can at least keep the fins from it and leave it out on the street again cuz im too fat for it. Anyone think they would want to try to ride or fix this or are pressure dents that deep even reparable?",
    "score": 6,
    "url": "",
    "created_utc": 1744083290.0,
    "author": "Middle-Ad9381"
  },
  {
    "title": "Just curious, what is Ozium and what does it have to do with surfing and music?",
    "body": "",
    "score": 5,
    "url": "",
    "created_utc": 1744427674.0,
    "author": "Adorable_Painter3037"
  },
  {
    "title": "In your opinion, what is the best surf section of all time?",
    "body": "Can be from a movie, short film or even just a internet clip from YouTube or vimeo? Can be because of the surfing done, the soundtrack, location or even the type of surfer.\n\nFor me it's dear suburbia.. the end section where yadin nicol, a young john Florence was on the come up and Dane reynolds was at his peak. Almost a changing of the gaurds. Combine that wave with the soundtrack and it's hands down my favourite section ever. ",
    "score": 5,
    "url": "",
    "created_utc": 1744424823.0,
    "author": "D0ctordoom"
  },
  {
    "title": "What the hell is on this shirt? Skull wave thing...?",
    "body": "",
    "score": 4,
    "url": "",
    "created_utc": 1744274893.0,
    "author": "karmaportrait"
  },
  {
    "title": "Bali question: what about the custom board factories (shapers)",
    "body": "Hi! Curious if anyone here had a custom board made in Bali, I noticed there are many \"factories\", making so many boards. \nThey all have so many pictures on the Google account but the reviews are really low like as low as 1 review.\n\nHow do they operate? If they don't rely on Google reviews directly they must work together with some shops? \n\nI got into contact with an owner through marketplace but yeah.. not sure if his company is any good. \n\nCurious to hear good or bad things from you!\n\nAlso not really worth it imo to buy a secondhand, since the midlengths are all almost all fully painted. Which probably means they got really badly damaged, that's my guess, never saw repainted boards before, so didn't even know that was a thing.\n\nThanks!\n\n",
    "score": 5,
    "url": "",
    "created_utc": 1744210162.0,
    "author": "gaatjesprikker"
  },
  {
    "title": "Lost Pisces",
    "body": "Anyone in here have any insight on a lost Pisces? Never tried a RNF but have heard nothing but good things, figure the Pisces would be just as good if not better",
    "score": 5,
    "url": "",
    "created_utc": 1744100700.0,
    "author": "IAmABanana69420"
  },
  {
    "title": "Mid length twin recommendations",
    "body": "Hey guy I recently bought a 6’9 Channel Islands mid twin (unreal board). I currently have the Britt merrick twin fins whom I am borrowing off a mate. So I I’m the market to get some new ones just wondering what other keel options people are using and like the feel of?",
    "score": 5,
    "url": "",
    "created_utc": 1743990751.0,
    "author": "Ok_Librarian8594"
  },
  {
    "title": "NC shapers",
    "body": "Looking for a nice daily short board and would love to support local shapers. What are your favorite North Carolina board makers? Any recs for a daily that will handle smaller surf year round is much appreciated!",
    "score": 3,
    "url": "",
    "created_utc": 1744397066.0,
    "author": "Ultraproxy5647"
  },
  {
    "title": "HI Mini MOE",
    "body": "My 1st epoxy so light and such a fun board. Mines the 610. Looking at getting 8 to replace my 9 foot mal. ",
    "score": 5,
    "url": "",
    "created_utc": 1744186638.0,
    "author": "j56_56j"
  },
  {
    "title": "Deborah Walley as Gidget in the 1961 Movie \"Gidget Goes Hawaiian\"",
    "body": "",
    "score": 4,
    "url": "",
    "created_utc": 1744173875.0,
    "author": "davidinkorea"
  },
  {
    "title": "Foundation in SoCal to donate my surfboards to",
    "body": "Hey folks,\n\nI'm moving abroad and have no real need to bring my two surfboards with me. They're not the newest models, but in working condition (with fins and leashes and bags). I'd like to donate them to a foundation in the LA area that does work with underprivileged people of sorts. Anyone know of a good local foundation that does solid work and could use boards?\n\nIt's a 6'4\" thruster with quite a bit of foam in the middle/front (mini midlength style) and a 8'2\" single fin egg.",
    "score": 4,
    "url": "",
    "created_utc": 1744161480.0,
    "author": "Betherealismo"
  },
  {
    "title": "Recent Rincon pics / video?? (Fri March 28th)",
    "body": "What up. Rincon was pumping with no lulls on Friday March 28th. Been looking for pics or videos - there was a few guys on the beach taking pics and stuff. I just wanna see any footy if anyone can point me in the right direction. Have a good one, cheers!",
    "score": 4,
    "url": "",
    "created_utc": 1744146447.0,
    "author": "CariaJule"
  },
  {
    "title": "HB Cliffs",
    "body": "Edit: changed wording\nHere comes the neighborhood https://laist.com/news/housing-homelessness/could-800-homes-be-headed-for-this-coastal-stretch-of-huntington-beach",
    "score": 4,
    "url": "",
    "created_utc": 1744084009.0,
    "author": "punkslaot"
  },
  {
    "title": "San Onofre Surf Company still in business?",
    "body": "Anyone know if they are still operating? Doesn't seem like it...  \n\n[https://www.sanonofresurfco.com/](https://www.sanonofresurfco.com/)\n\n",
    "score": 5,
    "url": "",
    "created_utc": 1744061225.0,
    "author": "CountySurfer"
  },
  {
    "title": "La Jolla surf films?",
    "body": "Just got back from visiting and was wondering if there's any good films that capture Windansea, Bird Rock, or spots in La Jolla. Shop vids or something other than the all the drone stuff on YouTube. Thanks.",
    "score": 3,
    "url": "",
    "created_utc": 1744050617.0,
    "author": "tealergang"
  },
  {
    "title": "How to prep for a trip after not surfing?",
    "body": "For those of you who rarely get to surf between trips, how do you prep? \n\nRecently had surgery that kept me out of the water (and gym) for 4 months and have a trip coming up. I am concerned I’ll injure something from overuse when paddling etc.\n\nStretching? Shoulder workouts leading up to the trip? Focus on cardio? Everything related to the surgery is sorted- just haven’t been able to lift anything heavy in a while. \n\nI know it’s an ambiguous question but any tips would be helpful since getting injured is the last thing I want. I have about 1 week where I’m now cleared to exercise before the trip. ",
    "score": 4,
    "url": "",
    "created_utc": 1743948853.0,
    "author": "AwayConversation4333"
  },
  {
    "title": "Surf-Forecast vs Surfline",
    "body": "I’m looking at the reports/forecasts for Monday and Surfline and surf-forecast are saying 2 different things, sort of contradicting each other. \n\nIt’s an hour drive away and I’m still gonna go and take the chance either way cus it’s my day off but I wanted to see what your experiences and opinions are on the 2 different sites and their reports?",
    "score": 3,
    "url": "",
    "created_utc": 1744465989.0,
    "author": "Dry_Lake_6274"
  },
  {
    "title": "Knee Brace",
    "body": "This has probably come up here before, but does anyone have recommendations and good experience with any knee braces or sleeves? Recovering post meniscectomy (meniscus) surgery and feel like I might need a little support, perhaps even mentally when paddling back out. ",
    "score": 3,
    "url": "",
    "created_utc": 1744303872.0,
    "author": "dyno2219"
  },
  {
    "title": "Looking for oversized shortboard",
    "body": "Okay, this is a bit clickbaity.\n\nI shape my own boards, and I want to shape something with a wide point a little further back, bumpwing squash tail, and dedicated thruster, kind of like what was popular a few years back. Somethat good for pumping and generating speed, which my mid-lengths can't do very well.  I am also missing the feeling of just being planted near the tail when I pop up.\n\nThis is the diference between a professional shaper and a bullshit one like me,  I could tell a shaper what I want and they can make it happen.  I can make a board based on someone else's work and tweak it to what I know I like, so I am looking for inspiration.\n\nThe only thing that comes to mind is the El Patron from ...Lost.  Obviously scaling up my HPSB is going to have super weird rocker/outline.  and redrawing my mid-length templates looks bad, really bad.\n\n  \nEdit: Vernor Bazooka, I never rode one, but  that was the board style I had in mind.  Doesn't look like its on his webpage anymore. ",
    "score": 3,
    "url": "",
    "created_utc": 1744063268.0,
    "author": "Equalized_Distort"
  },
  {
    "title": "Album Twinsman vs. Lost RNF! Backside caveat*",
    "body": "Hello everyone! \n\nI've read through the many post here on both these boards, and the takeaway is that both boards are great performance fishes. It's really hard to find anyone that doesn't like either of them. \n\nI've been surfing for about 12 years and am a solid intermediate. I'm currently riding a 6'2 Lost Subdriver, which I love, but I think I'm ready to switch sides and start riding Twin/Fishes on the daily. I've realized I'm never going to be a total shortboard ripper at this point in my life (I just turned 40), but I love surfing as much as I ever have. Fishes are just more fun for me personally. \n\nSo now I'm trying to decide which board to go with. Albums are very expensive, but honestly buying a new RNF run's about $800 and there's some Twinsman around for $950- I don't mind the difference if it's worth it. \n\nOne factor that has stopped me from making the switch to fishes earlier in my surfing journey is that I live in a beautiful, remote part of Panama blessed with a few long right point breaks, which are backside for me (Goofy). Anyone here have any advice on which board will be more fun riding backside? Also open to other models but these two seem to check the boxes. Any help appreciated!",
    "score": 3,
    "url": "",
    "created_utc": 1743978736.0,
    "author": "Double-Wave-3106"
  },
  {
    "title": "2020 Subaru Forester)What do you do with your car key when you surf?",
    "body": "Trying to figure out the best move for key storage while I’m in the water. I have a 2020 Subaru Forester and noticed I’ve got a valet key that I can remove from the electronic part. Can I just leave the electronic fob at home and take the valet key in my wetsuit? Will that still let me unlock the door and start the car?\n\nOr is there another way I can disable the electronic part and take the valet key with me while surfing?\n\nI know some people use the trunk passcode (I think mine has that?), or stash one somewhere, or lockbox. Just curious what other folks are doing? I’d like to avoid leaving the fob under a rock and hoping for the best.",
    "score": 2,
    "url": "",
    "created_utc": 1744492835.0,
    "author": "Simple_Bet"
  },
  {
    "title": "Shoulder partial dislocation",
    "body": "Happened to me early this week in a wipeout.\n\nThink it was a partial dislocation since I’ve managed to put the shoulder back in place in the water (then ended the session of course).\n\nIt’s the 3rd day and I already started to do some rotator cuff strengthening (slowly). I feel well, no pain if I don’t put to much effort. Still feels a bit fragile.\n\nDid it happen to you? How long did it keep you out of the water?\n\nNow summer is coming and I think I will be spearfishing more so I don’t get stressed.\n\nCheers ",
    "score": 2,
    "url": "",
    "created_utc": 1744456165.0,
    "author": "Last-Lack6239"
  },
  {
    "title": "Does temperature matter during ding repair?",
    "body": "It's currently ranging from about 0 degrees Celsius outside up to 10. Any drawbacks to doing ding repair outside in the cold?",
    "score": 2,
    "url": "",
    "created_utc": 1744397638.0,
    "author": "globocorp1"
  },
  {
    "title": "Choosing Shortboard",
    "body": "Anyone who has/had any of these boards in their quiver who’s able to give me a review on either board? I can’t make a choice of which one to add to my quiver ",
    "score": 2,
    "url": "",
    "created_utc": 1744310877.0,
    "author": "No-Nothing5812"
  },
  {
    "title": "Navigating locals",
    "body": "Hi peeps, \nIm an intermediate surfer and currently on fuerteventura and have run into some mean locals. \nI reaaally dont want to disrespect anyone and always try to find out if waves are \"locals only\" but here basically every point is. I cant surf party waves on a tourist beach anymore. \nNow i've had days without issues but a few days ago I had a run in with a local. He was sitting at the point (always paddled back there, disregarding any fellow surfers positions, local or not). It was an A Frame wave, but everyone only kept taking the left because it was better. I sat a bit off of the croud and noticed the right being empty so I wanted to paddle around him (The alpha at the point) to sit a few meters next to him to take the right. \nHe took that personally and had a fit. \n\nWhat can I do better? \nAnd also: if there are too many ppl to keep track of waves per person and waiting times, is it just battle royale? \n\nRespecting locals to me does not mean giving them lube to assfuck me. \n\nThanks!",
    "score": 2,
    "url": "",
    "created_utc": 1744230513.0,
    "author": "Coronalangeweile"
  },
  {
    "title": "Thoughts on a restored DT board?",
    "body": "Been shopping for an egg shaped board to transition down from long boarding. \n\nCame across this Donald Takayama board which has been restored, wondering if it will serve me well or if it has high chances of becoming junk/being unsellable in the future.\n\n",
    "score": 2,
    "url": "",
    "created_utc": 1744164827.0,
    "author": "BoonPiece"
  },
  {
    "title": "Surfing without ACL",
    "body": "tl;dr looking for s&amp;c tips specifically for surfing to protect knee post ACL tear.   \n  \nHowiye kooks\n\nSo back in January I either partially or fully tore my ACL on the side of by back foot. Not gunna get an MRI / go down the surgery route till after summer, but my physio thinks it's most likely gone based on current stability after 3 months and the work we've been doing so far. \n\nThe injury occurred doing bjj, and my physio is a coach/team mate, so naturally the program is very bjj focused along with adjusting my game plan to train safely. \n\nPrior to the injury I had been organising a sabbatical from work with the sole purpose of surfing for a few months. Kind of a last opportunity before life gets in the way kinda thing. I've pushed it till August / September at this point. The plan in the meantime is to get my body in as good shape as possible, and give the muscles, ligaments etc surrounding the knee the best chance to compensate. So far I already feel great, aside from not being able to trust my knee. \n\nI'm looking for:  \n \\- Mobility exercises for surfing  \n \\- Strength exercises  \n \\- Tips on easing back in  \n \\- Tips on positional stuff on the board. Adjustments when driving with my back leg to put less strain on the knee, etc  \n \\- Do I ditch shortboards all together? Just bodyboard even?\n\nI had a search in the post history and most of the advice in related threads was \"just get surgery\", so I'm trying to avoid that, but I'll create a comment thread for discussion / surfing specific anecdotes. \n\nCheers! ",
    "score": 2,
    "url": "",
    "created_utc": 1744120796.0,
    "author": "mullarkb"
  },
  {
    "title": "Cabo / Southern Baja",
    "body": "I’m going to be in southern Baja next week. It’s my first trip and I was looking for a guide if anybody can recommend someone. Looking to explore East Cape, and also maybe some spots on the Pacific side past Todos. ",
    "score": 2,
    "url": "",
    "created_utc": 1743994499.0,
    "author": "CarlitosSurferWay"
  },
  {
    "title": "Recs for Northern Nicaragua early May?",
    "body": "I'm basically looking for uncrowded lefts for 2 weeks. I don't care about luxury. Is it worth it to pay for an all inclusive surf camp? \n\nI think I'd rather play things by ear and be free to stay at different hostels. Will I have a hard time finding/getting to good waves without a local guide?\n\nI'm interested in the ThunderBomb surf camp but it's like 3k for a week...",
    "score": 2,
    "url": "",
    "created_utc": 1743961345.0,
    "author": "Lucid_Presence"
  },
  {
    "title": "RI beach inflation",
    "body": "Weekday/Weekend parking at 2nd beach is up to $25/35 / day and up to $180 for non-resident season pass. Stupid tariffs! ",
    "score": 3,
    "url": "",
    "created_utc": 1743947560.0,
    "author": "JohnnyYukon"
  },
  {
    "title": "Lost big rig driver",
    "body": "Any big rigs surfing a big rig ?",
    "score": 2,
    "url": "",
    "created_utc": 1744540330.0,
    "author": "breakingpoint82"
  },
  {
    "title": "Anyone used a Finjak before?",
    "body": "Wondering if anyone has used a Finjak before? Is it easy enough that you can adjust in the water?",
    "score": 1,
    "url": "",
    "created_utc": 1744539797.0,
    "author": "karmaportrait"
  },
  {
    "title": "Weekend Question Thread",
    "body": "",
    "score": 1,
    "url": "",
    "created_utc": 1744393983.0,
    "author": "dumbassthenes"
  },
  {
    "title": "Any decent surf shops in nyc?",
    "body": "I know this is probably a dumb question but I’m going to be in nyc next weekend and I’m coming from an area of Canada with 0 surf shops for miles so just curious if nyc has anything to offer since it’s a bit closer to surfing ",
    "score": 1,
    "url": "",
    "created_utc": 1744134893.0,
    "author": "Xxg_babyxX"
  },
  {
    "title": "Where is this?",
    "body": "",
    "score": 0,
    "url": "",
    "created_utc": 1744493686.0,
    "author": "EhukaiMaint"
  },
  {
    "title": "Seeking advice on a board for Nica",
    "body": "Hey all,\n\nI'm heading down to Nica for a few weeks. Going to buy a used board when I get down there and currently looking at a few options.\n\nI currently ride a 5'9 x 20 x 2 1/2 / 29.5 L back home. My top contenders are a 5'10 x 19 1/4 / 32 L board or a 6'6 x 18 7/8 / 33 L one (both 2 1/2\"). Can't tell from the pics on what the rockers look like.\n\nNot sure what might be the best one to pick (or keep looking at my other options) given how each might ride as well as the waves (punchier beach breaks and points). It feels like the 6'6 might almost be a step-up for me?\n\nTIA for any guidance.",
    "score": 0,
    "url": "",
    "created_utc": 1744308315.0,
    "author": "ArgumentAlternative8"
  },
  {
    "title": "Is there a Surfline cam at your local break?",
    "body": "\n\n[View Poll](https://www.reddit.com/poll/1jvogt4)",
    "score": 0,
    "url": "",
    "created_utc": 1744255554.0,
    "author": "Lucid_Presence"
  },
  {
    "title": "Roxy Womens Wetsuit Sizing",
    "body": "Hi! Need help with Roxy wetsuit sizing. Do they fit true to size?\n\nI'm a pretty average, lean build, 5'4 and about 115 lbs with a 25\" waist. Looking to get a 5/4/3 hooded wetsuit from Roxy and thinking of going with a size 6. I wear a size 6 in a Hyperflex 4/3 wetsuit. Thoughts if size 6 roxy will fit me? The size chart says size 6 is for 5′4″-5′6″ and 105-125 lbs. Thanks!",
    "score": 0,
    "url": "",
    "created_utc": 1744212708.0,
    "author": "Acceptable-Fun4124"
  },
  {
    "title": "Where should I go for 6 weeks from mid May.",
    "body": "\nhunting left barrels. Indo, aus, NZ and Fiji are off the cards. \n\nWhere would you go. \n\nCheers all",
    "score": 0,
    "url": "",
    "created_utc": 1744193118.0,
    "author": "hizzydizz"
  },
  {
    "title": "San Elijo question",
    "body": "I camp/surf with my son there every year. Forecast shows pretty small the week of 4/14. Wondering if anyone has an idea of a spot close by with a bit more swell on a 1-2 foot day. Not looking to compete, just catch a few nice ones. Thanks. ",
    "score": 0,
    "url": "",
    "created_utc": 1743992095.0,
    "author": "nocandu99"
  },
  {
    "title": "follow your passion.",
    "body": "",
    "score": 0,
    "url": "",
    "created_utc": 1744318453.0,
    "author": "Mannotafoot"
  },
  {
    "title": "Surfing northern Baja in summer",
    "body": "What are some summer surf spots near Ensenada? I know it’s best during the winter but I’m trying to plan a trip with my wife and trying to catch some waves. Mahalo 🤙\n\n",
    "score": 0,
    "url": "",
    "created_utc": 1744256594.0,
    "author": "Admirable_Dig3832"
  },
  {
    "title": "Indo in September - intermediate loggers",
    "body": "So my wife, my buddy and I are planning on heading out to Indonesia at the beginning of September for a 2-3 week trip. Primary objective is to surf our faces off. \n\nWe currently live in Sayulita and have been surfing 5-7 days a week on 9’+ boards. Can easily catch anything from 1-6 feet and walking the board is standard, with a few 5’s and an occasional 10 if we are really in the zone. So I would consider us to be intermediate level longboarders.\n\nSeeing as we are only going to be there for 2-3 weeks, I’m guessing that we will need a guide and access to boards, boats, etc. would prefer to settle into one “resort” or “camp” and travel from there. Any recommendations on islands/resorts/guides? From what I have read, I’m thinking that Lombok or West Java is where we want to be. \n\nTLDR: Intermediate Longboarders, 2-3 weeks in September. Looking for recommendations ",
    "score": 0,
    "url": "",
    "created_utc": 1744417491.0,
    "author": "Rock_Toy"
  },
  {
    "title": "Calumet park localism?",
    "body": "Was wondering if the spot in front of Calumet park in SD is localized like bird rock or if the lineup is chilll. wave looks fun…",
    "score": 0,
    "url": "",
    "created_utc": 1744268759.0,
    "author": "trilltrapio"
  },
  {
    "title": "How do offshore wind gusts time up perfectly with sets?",
    "body": "God? ",
    "score": 0,
    "url": "",
    "created_utc": 1744308461.0,
    "author": "climb-high"
  },
  {
    "title": "How to be a big wave surfer",
    "body": "Hello, im an advance surfer, surfing regularly on 4-8 ft spots,and i want to became a big wave surfer. So, i want to ask you for advice and recommedations about anything you wanna share, i mean training, gear, etc",
    "score": 0,
    "url": "",
    "created_utc": 1744290326.0,
    "author": "Realplayer88"
  }
]