[
  {
    "title": "5 things that anxiety wants you to forget (but I came to remind you)",
    "body": "1. You've overcome difficult times before!\n\n2. You don't need to believe all your thoughts!\n\n3. Making mistakes does not mean failing!\n\n4. People aren't judging you as much as you think!\n\n5. Now is always more real than any fear of the future!\n\n\nDid you need to read any of these now?",
    "score": 309,
    "url": "",
    "created_utc": 1743031547.0,
    "author": "_mmessias"
  },
  {
    "title": "Is there any long term drug that actually works for anxiety",
    "body": "Benzos work but not even really, I’d have to take way more than my doctor prescribes me, and it’s not long term. 4 weeks of Zoloft and it does fuck all. Promethazine id hoped would make me sleepy and then less anxious but also too weak and doesn’t work either. \n\nWhat are my remaining options here. Pregablin ? Gabapentin ? Both of which I see are also addictive\n\nAnother SSRI? \n\nBuspar ? Which from what I see is pretty weak. \n\nAny advice would be appreciated cause it’s becoming unbearable ",
    "score": 245,
    "url": "",
    "created_utc": 1743096098.0,
    "author": "Available_Heart5556"
  },
  {
    "title": "Called 911 for panic attack and feel so embarassed",
    "body": "I have had diagnosed anxiety for almost 10 years now and have had panic attacks before but I forgot to take one of my meds this morning and when you miss a dose it can make your heart rate higher, and took adderall this afternoon for ADHD planning on doing school work, but once it kicked in I noticed my resting heart rate was high in the 120s. I sat there trying to calm down but it kept increasing all the way up to 180 and all of a sudden I couldn't catch my breath and didn't know what to do and started feeling dizzy so I called 911... the firefighters showed up first and they were nice but I could tell they were kind of skeptical, but once the paramedics showed up they left and the paramedics were super nice about it... they checked my vitals and helped me slow my heart rate some back to the 110s and told me since my vitals were stable I was ok unless I wanted to go to the ER which I definitely did not and they left. I just feel so stupid and like I wasted resources for people who really need them, especially the firefighters. I am so embarrassed I don't even want to tell anyone in my life and I live in an apartment complex so I know all my neighbors hears and saw the ambulance and fire truck...",
    "score": 206,
    "url": "",
    "created_utc": 1743198486.0,
    "author": "FollowingOnly4659"
  },
  {
    "title": "For anyone who feels like they're \"too broken\" to ever get better",
    "body": "Look, I've been there. Like, rock bottom, eating-cold-spaghetti-in-the-dark-at-3am-while-crying there. For 6 years I couldn't even order a coffee without my hands shaking. But here's the thing that finally clicked for me last year:\n\nYou're not actually broken. You're just really damn good at convincing yourself you are.\n\nThink about it, you've managed to survive every single bad day you've had so far. Every panic attack. Every social situation that felt like actual torture. Every time you were CONVINCED you couldn't make it through? You did. You're still here, reading this post.\n\nThe fact that you can even recognize your anxiety as a problem means you're already halfway there. Broken people don't question if they're broken. They don't try to get better. YOU ARE TRYING.",
    "score": 178,
    "url": "",
    "created_utc": 1742744728.0,
    "author": "Grounded_Growth"
  },
  {
    "title": "Propanonol counters anxiety!",
    "body": "I wanted to share with you this medication that is rarely prescribed and is much less addictive and dangerous than benzodiazepines! \n\n*Talk to your doctor* ",
    "score": 150,
    "url": "",
    "created_utc": 1742677045.0,
    "author": "Big_brother2"
  },
  {
    "title": "I got through my pelvic exam today!",
    "body": "So context: Last month I had a very awful experience at the gynecologists to the point of where I puked in a trash can in the exam room after my exam because it was my first time getting one and I completely mentally freaked out. Went pale and everything too. My doctor was awesome it was just the overall anxiety I had bubbling up. It's been an issue with certain conversations about my body before.\n\nWell today I had an appointment with my endometriosis specialist today and I had to have one just to check some things out and I actually got through it! Not a single hint of nausea when my doctor actually had to look! ",
    "score": 121,
    "url": "",
    "created_utc": 1742857485.0,
    "author": "godessnerd"
  },
  {
    "title": "Reminder to be careful with benzodiazepines.",
    "body": "I'm not demonizing benzos or people who take them at all. I still safely take Xanax once or twice a week and it's extremely helpful for my panic attacks or just any type of severe anxiety I'm going through.  \n\nI just wanted to remind everyone to be careful. I feel like some doctors aren't clear enough on how often you should usually take them if it's a permanent med you want to have in your life to take occasionally and \"as needed\". My doctor basically told me nothing when prescribing me Xanax as a teenager and it didn't go well because I used it everyday. It was complete HELL getting off of it.  \n\nLong term consistent and everyday use can eventually cause addiction/dependency which is seriously one of the worst feelings in the world especially the withdrawal that can come with it. Severe withdrawal that happens from being dependent on larger doses can even be dangerous. \n\nBe sure to ask your doctor any questions you have before starting them. Like I said before I'm not trying to demonize benzos or anyone who takes them. Not looking to scare anyone either I just don’t want anyone to go through what I did as a teenager when I didn't know much about the topic before it was too late. \n\nBenzodiazepines can be an amazingly helpful tool and medication when used the right way. Just be careful friends that is all. ",
    "score": 119,
    "url": "",
    "created_utc": 1743074202.0,
    "author": "idkbr0idk"
  },
  {
    "title": "What’s something people think helps with anxiety—but actually makes it worse for you?",
    "body": "I’ve been looking into how people manage anxiety, and I’ve realized… not everything works for everyone.\n\n\n\nIs there something you’ve tried—maybe meditation, breathing apps, “calm down” advice—that just made things worse?\n\n\n\nCurious what feels useless or frustrating in real-life situations. Trying to avoid those same mistakes in something I’m building.\n\n",
    "score": 119,
    "url": "",
    "created_utc": 1743001866.0,
    "author": "Sea-Spring-6008"
  },
  {
    "title": "Does anyone really have their shit together??",
    "body": "I’m 20 years old and unemployed, can’t find a job, living at home. Feel like I’m going crazy. Does anyone really have their fucking shit together. I’m constantly thinking about what other people my age are doing and how come I’m not doing that, or how come I’m not able to do that etc etc. I’m realizing I have so much fucking anxiety and I’m honestly going crazy. Anyone else in the same boat please say yes.\n\nUpdate: Thank you all for your advice and videos you’ve sent. I live in a house where it’s hard to talk about your feelings, and everyone just fakes it till they make it, which isn’t the worst thing, but I have a hard time with that. Seriously thank you to all of you who took the time to make someone like me feel just a little better about life happening. \n\nWe really are all in this together. ",
    "score": 87,
    "url": "",
    "created_utc": 1742695080.0,
    "author": "Dry_Two_9109"
  },
  {
    "title": "Terrified of surgery tomorrow",
    "body": "Hi,\nI’m having surgery under general anesthesia tomorrow, and I’m really scared. It’s not just the procedure itself — it’s mostly the anesthesia. I’ve never had it before, and the thought of going under, of being completely vulnerable and not in control and the possibility of something going wrong terrifies me. I know this level of fear might seem irrational, but I honestly don’t think I’ve ever felt this afraid before and can't imagine everything going well.\n\nWhat’s been hardest is feeling like I don’t really have many people to lean on — actually, there’s only one person who’s truly there for me, despite having friends and family. I guess that’s why I felt the need to get this off my chest and write here.\n\nThank you for reading and any advice regarding how to cope with this fear (especially as someone who has very strong physical symptoms when being afraid) is greatly appreciated.\n",
    "score": 79,
    "url": "",
    "created_utc": 1742927376.0,
    "author": "zildra55"
  },
  {
    "title": "Does feeling calm make your anxiety worse?",
    "body": "When I'm calm I freak out that I'm actually calm because it feels like something is wrong!!!!!!!",
    "score": 81,
    "url": "",
    "created_utc": 1742645525.0,
    "author": "hkondabeatz"
  },
  {
    "title": "Has anyone had a panic attack that lasted a day? I'm currently having one and need advice. I'm tired and it's weighing on me.",
    "body": "I'm sweating, nauseous, diarrhea, confused, sense of dread, body aches and headache. I feel like I'm dying. No matter what I do to calm down I just can't.",
    "score": 78,
    "url": "",
    "created_utc": 1742791631.0,
    "author": "DogAccording6956"
  },
  {
    "title": "Does anyone else feel incapable for a normal adult life and wants to die so they don’t have to face it?",
    "body": "Just what the title says.\n\nI grew up quite confident. Never had anxiety issues or something. I was only ever insecure about my looks and had some abandonement and attachment issues but that never affected anything but my romantic relationships. Doesn’t really matter for the story.\n\nThen, when I was 21 I got IBS out of nowhere and my life just went straight to hell. Failed year after year of uni, was too afraid to go outside at one point, got severly depressed and anxious. \n\nI managed to get my degree and managed to land a job I like that’s also hybrid. And I still feel like wanting to die everyday because the anxiety of leaving the house and going to work is too much. I worry all the time. I worry that my IBS will act up at work, I worry I’ll get fired for using more days WFH than what we are contractually allowed. I talked to my managers about my issue and they said that it’s no problem if I need more days from home some weeks, but that didn’t lessen my anxiety.\n\nI’ve achieved exactly nothing in my life and my every day is a battle with anxiety from the moment I wake up. I lash out at people who love me because I feel like a trapped animal only the trap is my body so I can never get away from it. I feel like such a burden on my mom, who gave me everything she could only to have to listen to me say on daily basis that my life is just one big struggle and I’m not happy and want to be dead. \n\nIf I stay alive, I’ll just burden and wear out all people who love me. They are so worried and I am so mean. I keep telling them that more time with them is no longer enough for me to deal with life and that I want to rest. I keep thinking I’ll never be fully independant let alone be able to actually take care of someone else. Of my parents, when they get old, of a child some day… I can’t take care of myself… \n\nI just want to end it because I feel like I’m doing all I can to be a functioning adult and still failing miserably. \n\nI’m in therapy, it’s not helping. I tried meds, they do help, but not longterm and they make me sleep all the time and gain weight. I tried journalling, I have multiple hobbies, I try, I try, I try. And my life still seems reduced to anxiety of getting out of the house… I’m so tried and I feel so guilty for being like this. \nI know no one wants to lose the person they love, but I often feel that if I killed myself, my family, my friends, my partner, they would lose me once and mourn me. Like this, they are losing me everyday, all the while having to put up with me being angry at them, at my body, at my life, at everything.\n\nI’m so tired and so angry and so guilty and it doesn’t change…",
    "score": 57,
    "url": "",
    "created_utc": 1742903618.0,
    "author": "LadyLazarusAlbatross"
  },
  {
    "title": "Phagophobia destroyed my life.",
    "body": "I developed the irrational fear of choking while I eat, around a year ago (not so irrational, because it can really happen anytime...) and since then my life has been upside down between a rock and a hard place.\n\nWhen I first felt the symptoms, I spent a whole week just drinking water, fruit milkshakes, just to keep myself from dehydration. It was torture, and still is, because we need to eat everyday, more than once.\n\nYou know what made me feel a little better? Wanting to die. I used to think \"why bother if I choke right now? I don't want to live anyway.\" And this thought comforted me somehow and made me feel more brave to keep eating. A little after I was finally able to eat everything again. But this demon comes back everytime and I think I'll never be totally healed from this mental issue.\n\nThis problem made my suicidal ideation come back to me as some type of comfort, a thought that gives me strength somehow.\nI'm handling and going on, but nobody deserves to fear their every meal.",
    "score": 56,
    "url": "",
    "created_utc": 1743003820.0,
    "author": "Seralysle"
  },
  {
    "title": "Health anxiety",
    "body": "I'm 24 and although I've always been a very anxious person, I never struggled with specifically health anxiety. My health anxiety started about 6 months ago and it is awful. I find myself constantly triggered on social media and also in just advertisements online. I'll see these stories of young people getting the big C and I'll see articles about how that's becoming more common in younger people and I feel like I just see it everywhere now. This is the kind of thing that I used to be able to ignore, but I am in a horrible place mentally. Does anyone else experience this or know how to stop feeling this way?",
    "score": 52,
    "url": "",
    "created_utc": 1742962004.0,
    "author": "Amnemonemmamne"
  },
  {
    "title": "Does anxiety leave you feeling constantly exhausted/drained?",
    "body": "I'm just wondering if anxiety can leave you feeling exhausted/drained because you're constantly on edge, waiting for the next thing to happen/thing to go wrong, panicking, worrying that something is seriously wrong, etc? ",
    "score": 50,
    "url": "",
    "created_utc": 1742728589.0,
    "author": "heart_emojis0"
  },
  {
    "title": "Ok, who has had a little win with their anxiety recently?",
    "body": "I had panic at the grocery yesterday and managed to get through it and drive myself home safely and calmly. Who else has made a little progress recently? What did you do?",
    "score": 47,
    "url": "",
    "created_utc": 1742835234.0,
    "author": "RepulsiveMaterial167"
  },
  {
    "title": "What are your tips for anxiety stomach",
    "body": "My anxiety has been so high recently, so I have the constant uncomfortable anxious feeling of dread/butterflies in my stomach for a week straight. It's difficult to eat and sleep and I am CONSTANTLY going to the bathroom. Does anyone have/do/take anything that helps calm their digestive systems when they are stressed?",
    "score": 46,
    "url": "",
    "created_utc": 1742748783.0,
    "author": "Beloved_Fir_44"
  },
  {
    "title": "Is this right? Please be kind.",
    "body": "For those who are in talk therapy or have had therapy- \n\nThis was my first appointment with a therapist. He was nice, but he made me feel weird? I just had this feeling in my gut 15 minutes into my appointment that something wasn't right. I guess it's when he told me I'm just like him and that I can tell that something is \"currently off in the universe right now.\" I never said that; all I said was I sometimes have intrusive thoughts. He was telling me about his marital problems and just often repeating how alike we are. He admitted to me that he smoked weed after I admitted I do it myself, but he again made it weird… like he told me why he stopped recently, \"a spiritual awakening\" he called it. He told me why he initially started smoking, and he said it was because he couldn't stand his wife or kids anymore, and they were close to a divorce. Right before our session ended he said “go on a walk and write five things you find beautiful, besides yourself, and tell me why.” I guess I'm just wondering if my gut is right? Or is this just how therapy works? I can’t tell if it’s my anxiety or if these are actual red flags. I'm not sure if I even want to go back to my next appointment, but it was so hard to get in with anyone I waited 3 months for this appointment. ",
    "score": 46,
    "url": "",
    "created_utc": 1743182768.0,
    "author": "Anxious_Momma710"
  },
  {
    "title": "Quit alcohol, quit caffeine, quit weed. Haven’t felt this bad in years.",
    "body": "Edit: i do not believe i am suffering withdrawals, i believe i am struggling with the absence of dopamine.\n\nHi everyone. \nMid December i decided to quit weed, a week later i decided to quit alcohol and caffeine too. I almost immediately noticed a loss of interest towards my hobbies. \n\nEver since then it’s been a living hell. Up until February i was having bad panic attacks, i worked on those with a therapist and i’m now doing much better under that aspect. \n\nWhat hasn’t changed, and has worsened honestly, is the complete disinterest i have developed for all of my hobbies and life in general. The most i do is go to work, force myself to go work out, and sit on the couch with my gf, then go to sleep. \n\nI have lost all interest in editing photos, in taking photos, in posting them, in going to events where i can take them. I lost all interest in going out with my friends and acquaintances. I just feel so empty and unmotivated. I believed it was winter doing its thing, but the seasons are changing and my situation is mostly the same. I have even lost interest in sex. I am eating the same two foods for every meal. I don’t even find enjoyment in playing on my pc anymore, i bought myself a brand new pc for Christmas and have used it a few hours at most. I spent more time setting it up and building it vs the time i actually used it. \n\nI am getting tired of living like this, but i just feel so unmotivated to do anything, i lost all my drive and i’m just waiting to be better, waiting for the physical pains to go away, waiting for my mind to stop being so on edge. \n\nI miss my old self and have no idea how to get it back. I miss driving for hours to go to events and take photos there, i miss the late nights with friends, i miss being able to just go to a restaurant on my own and enjoy myself, i miss going out with my girlfriend and living our lives. I miss the person i was a few months ago, i feel like i’m just a shell of my old self, as if i’m running on power saving mode. And it only makes everything worse. \n\nPlease share some advice if you can. I don’t know where i’m headed. \n\nEdit to add: I quit in order to become healthier, not because i had problems regulating myself. I'd smoke weed in the evening before bed (3/4 puffs) and on sunday morning (a bit more). As for alcohol, i was drinking to the point of being drunk once per month, tipsy twice per month. With the occasional beer here and there. \nAs for coffee, i never went over two small cups (30ml) of coffe, so only abput 100mg of caffeine at most. i do not believe i am suffering withdrawals, i believe i am struggling with the absence of dopamine.",
    "score": 43,
    "url": "",
    "created_utc": 1742895718.0,
    "author": "cannavacciuolo420"
  },
  {
    "title": "Why the fuck am I so sensitive to every single medication? Doctors don’t even believe me.",
    "body": "I was prescribed the starting dose of 25 mg of hydroxyzine. Because I know better, I crush it and swallow about a fifth of it. 5 mg. That’s all I can take and I wake up the next day 12 hours later with swollen eyes. I am a zombie. I tried this for one week. It’s 1: hours after I took the bit last night and my mouth is still so dry I feel sick.\n\nThe same thing happens with my medication for bipolar, Depakote and lamotrigine. My doctors do not believe me when I tell them how insanely sluggish it makes me, I’ve been cutting the starting pills into half for years now and am very stable mood/wise with that. I am unable to increase like my doctors insist for no good reason.\n\nI sleep with a CPAP every night, because for as long as I can remember after a brain surgery in high school, I am stuck hyperventilating and forget to breathe until I remind myself. The anxiety medication makes me breathe better I see on my charts, but at what cost? I can’t function like this during the day.\n\nI had DPDR for many years due to my first incident with weed. This ruined me once and for all. I get panic attacks if I see someone 20 feet away from me smoking it. I tried drinking a very small amount of Kava for anxiety, which threw me into a panic episode of depersonalization. \n\nThe only thing that has ever helped me was alcohol. And that’s that. There is really nothing else that comes close for me. Unless anyone else has any ideas. I am very afraid of most medications, but any ideas would be of help.\n\nIs anyone else like me, so sensitive? The doctors do not believe me and think I just exaggerate with how small of an amount of medication it is.",
    "score": 45,
    "url": "",
    "created_utc": 1743107593.0,
    "author": "SnooRegrets3555"
  },
  {
    "title": "Does anyone feel like they are going to have a heart attack bc they are so anxious?",
    "body": "Whenever I get anxiety, I get crazy chest pain. I get heart palpitations because of my anxiety, and they usually only last about 2 secs and go away and usually aren’t accompanied by pain. I have a lot of chest tightness too. This happens A LOT at night time when I’m ready to sleep. I’ll be better throughout the day, but as soon as I’m lying down, my chest hurts. I feel like I can feel very time my heart beats. I convince myself I’m lightheaded, my heartbeat is off, and that if I don’t concentrate I’ll die. Sometimes I convince myself something is wrong until I actually have a heart palpitations and I think “yup this is it”.  Does anyone else experience this? How do you cope?",
    "score": 44,
    "url": "",
    "created_utc": 1742964988.0,
    "author": "Hot-Milk1211"
  },
  {
    "title": "Anybody else raw dogging anxiety & fighting to get back to your old self ?",
    "body": "I started having anxiety/panic attacks a couple of years ago and realized that I have to accept it to move forward with my life &amp; in the last year or two it’s calmed down a lot for me (cut down on drinking a lot) still have those negative thoughts in the back on my mind but I remember that I used to be someone that has always had great mental strength &amp; been able to push past any challenges that I have came across so it’s hard to bend a knee to anxiety and let it take over my life. I know some of my triggers are caffeine &amp; not being able to freely move around examples are sitting in a barber chair / airplane seat or being in a meeting where I have to stay seated &amp; still for a period of time but I still do these things knowing that I will feel anxious. \n\nWhat has helped me stay strong in the moment is staying healthy &amp; getting blood work done and checked by your doctor to make sure that everything is fine with me so I know that when I feel terrible/anxious I know that it’s anxiety and it will pass, also I wouldn’t consider myself a very religious person but I like to pray in the mornings &amp; I believe that having faith can help keep a positive attitude and outlook on certain situations. \n\nIs anybody else going about anxiety like this ? \n\n",
    "score": 42,
    "url": "",
    "created_utc": 1742651031.0,
    "author": "Ok_Eagle_3178"
  },
  {
    "title": "the sad truth",
    "body": "i have come to a point where i’m fed up with my health anxiety. it ruins my mood all the time and i hate how creative my mind decides to get when catastrophizing. the only way for me to get over this is to just accept it. accept the fact that you’re fine but if something does happen, let it happen. you’ll come out at the end. if you have a brain tumor, oh well you’ll fight it or get surgery. if you faint, someone will help you. if you have a heart attack, you’ll go to a hospital and they’ll help you. if you have a ANYTHING, you’ll figure it out i promise. my health anxiety contradicts itself all the time. i always think well let’s go to the er because i think im having a heart attack, but then at the same time i don’t want to go because what if im right. and i dont want to be right. i think we all just need to accept it no matter how uncomfortable we get. we only live once and im sorry but i don’t want to live my life anxiously it’s exhausting. no amount of regret can change the past and no amount of worry can change the future. ",
    "score": 39,
    "url": "",
    "created_utc": 1743003635.0,
    "author": "KindlyBerry6169"
  },
  {
    "title": "I’m terrified of my mom dying",
    "body": "In 2020 my mom had something happen to her that ended up with her in the hospital for weeks, her heart stopped multiple times and she had to have surgeries. This all happened in the middle of the night while she was at work and I was at home with my dad and siblings, I’m the eldest and at the time I was 14. My mom is fine now but we’ve had a few close calls. After she came back home I became extremely anxious of it happening again so I stayed away from her, she noticed it and we talked about it. The issue is that for the past five years I can’t be mean or rude or even far from her that I start to get this anxious feeling of “what if she dies and I didn’t spend more time with her?” Idk what to do anymore because it’s gotten so bad that I can’t even get mad without sobbing a few minutes later in fear of her dying. I check in on her during the night to make sure she’s still alive, I have nightmares, I’ve told her of this but I think she’s brushing it off as me being silly. I’m supposed to be going off to college this year but I can’t bring myself to leave her thanks to this fear. \nDisclosures: I do have an autism diagnosis and I’m currently in therapy (have been for 3 years), my mom has a medical condition that can kill her at any moment and that’s part of what scares me, and my dad isn’t in therapy picture anymore so if she dies I’m left completely alone.",
    "score": 35,
    "url": "",
    "created_utc": 1742863927.0,
    "author": "Ramen_n0ddles"
  },
  {
    "title": "An important reminder for you today!",
    "body": "If today is difficult, remember: you have overcome many bad days before and this one too will pass.\n\nAnxiety can make it seem like everything is permanent, but each emotion is like a wave: it comes and goes. Take a deep breath, take care of yourself and trust that better times are coming. 🌿\n\n💬 What do you do to feel better on difficult days?",
    "score": 36,
    "url": "",
    "created_utc": 1742863829.0,
    "author": "_mmessias"
  },
  {
    "title": "Does anyone else have a fear of being allergic to certain foods?",
    "body": "I have no allergies so I really dont understand why I feel this way. For the last few months I have been having this irrational fear of being allergic to foods. Even to foods I’ve had before. For a while, I was avoided these foods that trigger my anxiety. But after working with my therapist, I started to slowly reintroducing foods I’ve had in the past but have been avoiding. So far that has been a success and I was confident to try a new food- so I did and I was almost convincing myself that my throat was closing. Obviously I was fine but it’s so frustrating. And this fear extends beyond food. I was given as needed hydroxyzine that I have yet to try due to fear of an allergy. \n\nI feel very alone and frustrated. I was wondering if anyone else had struggled with this and overcame it? Or if there is anyone else out there that has a similar struggle so I don’t feel so alone. ",
    "score": 38,
    "url": "",
    "created_utc": 1742784850.0,
    "author": "Fine_Department7947"
  },
  {
    "title": "Does anyone else feel like their life is pointless?",
    "body": "It seems this anxiety is never ever going to end and it's a nightmare...every day, every night, just constant...what's the point?",
    "score": 32,
    "url": "",
    "created_utc": 1742935818.0,
    "author": "AnxietyChats"
  },
  {
    "title": "Does anyone else remember what life was like before anxiety?",
    "body": "Anxiety seems to the norm now...is constant! to the point that I wonder if anyone can even remember their lives without it!",
    "score": 29,
    "url": "",
    "created_utc": 1743044429.0,
    "author": "AnxietyChats"
  },
  {
    "title": "I want to try magnesium glycinate but my health anxiety won’t let me",
    "body": "I have seen so many people say it helped them. And I know it doesn’t work for everyone. But I feel like it’s at least worth a shot. I’ve tried to get it through food but it’s just not enough. Like I don’t eat terribly but I don’t eat the things I would need to on a regular basis. I’d love to try the supplement. But I have severe medication anxiety. I can’t even take a Tylenol for a headache. And I know it’s natural and not really a medication but it’s foreign to me and I’m scared I would have some kind of bad side effect or a psychosis episode or something. I absolutely can not do anti anxiety meds so I want to try this. Words of advice or encouragement? ",
    "score": 32,
    "url": "",
    "created_utc": 1742782138.0,
    "author": "Bananafofeather4"
  },
  {
    "title": "Meditation for 45 minutes - wow…",
    "body": "I have been suffering with anxiety my whole life; sometimes it’s manageable, but there have been moments - like the week I have just had - where it is unbearable. Since Monday, I have woken up with the most painful,\nvisceral anxiety; I have cried every day uncontrollably.\n\nSince January, I started to incorporate meditation - maybe 10 minutes a day, if I could muster up the patience. \n\nToday, I woke up with that deep, muscle clenching anxiety yet again. I turned to meditation in the hope that I could take the edge off, except, this time, I didn’t open my eyes after the first ten minutes - I just kept going. It was the most calming experience (without taking any sort of medication) I have ever experienced. Turns out I managed to sit with my feelings for 45 minutes. I completely calmed my nervous system and let the thoughts wash over me.\n\nI’m not fixed; I’m not suddenly overjoyed with happiness. However, considering the mornings have been unbearable, I’m currently sat here writing this post with almost complete calmness. \n\nNo idea what other people’s experiences are with it, but I really wanted to share this today. \n\n",
    "score": 29,
    "url": "",
    "created_utc": 1743155450.0,
    "author": "Free_Custard_8460"
  },
  {
    "title": "Buspar is taming this bitch",
    "body": "",
    "score": 29,
    "url": "",
    "created_utc": 1742733145.0,
    "author": "Unlikely-Elephant969"
  },
  {
    "title": "How many random symptoms have you had and how long have they been happening?!",
    "body": "I've counted almost 40 symptoms that started since last June so 9 months of this! Ranging from heart palpitations to dizziness, shortness of breath etc. \nbeen to emergency/many specialist/doctors/labs etc probably 50 tomes and everything has come back clear.",
    "score": 27,
    "url": "",
    "created_utc": 1743110280.0,
    "author": "Typical-Reality9077"
  },
  {
    "title": "how long did it took you to recover from your first  time panic attack?",
    "body": "so for context i 26m was totally normal never had mental health or physical health issues till February last year \nit all started with that one panic attack that came outta nowhere and after that one panic attack i struggled with severe anxiety symptoms thats not related to mental anxiety its just physical anxiety , you know the symptoms \nso my question is to people with the exact same thing i know there are many how long did it took you to recover from your first panic attack",
    "score": 27,
    "url": "",
    "created_utc": 1743209433.0,
    "author": "ComplaintGreat3991"
  },
  {
    "title": "How do you guys get passed overthinking",
    "body": "I'm having a hard time getting passed my thoughts because I'm always thinking the worst is going to happen. Have you guys figured a way through that yet?",
    "score": 26,
    "url": "",
    "created_utc": 1742939537.0,
    "author": "Kindly_Reindeer9795"
  },
  {
    "title": "Do I go to the mental hospital",
    "body": "I’ve been going through the toughest time of my life constant panic attacks intrusive thoughts that are incredibly disturbing these thoughts make me incredibly anxious and scared why would I think such a awful thing and I start too spiral and I get these warm feeling in my brain and I start too panic for some reason  that I’m gonna blackout and do something crazy I’m not a violent person whatsoever and I love my family and my life but these thoughts that I’m gonna lose control are overwhelming and scary is this even a possibility I can just blackout and turn into a monster I don’t know in my area the mental facilities are flooded with bad reviews reports of abuse roaches and I don’t know if that environment would make me worse or better I heard one say a crazy person wouldn’t recognize they are crazy and have rational thoughts but I don’t know I’m scared and don’t know what I should do my parents strongly are afraid of me going too ",
    "score": 27,
    "url": "",
    "created_utc": 1742865406.0,
    "author": "WearySpot3625"
  },
  {
    "title": "I can't stop feeling extremely anxious about death.",
    "body": "Hey guys. I posted a couple days ago RE struggling with recurring panic attacks and nocturnal panic attacks. They have made me physically and mentally exhausted. My soul feels tired. They have also abruptly shook me to my core and made me come face to face with the fact that I am going to die. The panic attacks would come and my brain would say, \"you're going to drop dead.\" And now that thought is on loop. It makes my head fuzzy. I do yoga, I eat well, I run, I live in nature, I tend to a garden, I get outside the house every day, I live with others, and none of its helping. I feel like my brain is inflamed or sick because the thoughts are so intrusive. I used to live my life in anticipation of the future, or thinking happy memories in the past, but it's like something shook me so strongly and reminded me that all we really have is now and that realization is sobering. I am grieving everything I have lost and will lose.\n\nI keep thinking about how everyone I love will die. All the beautiful birds I watch every day, they will die. The opossum under my bird feeder at night will die. My precious cats will die. It makes me so anxious to the point where I am genuinely feeling ill 24/7 and I cannot go anywhere or do anything without this constant anxious panic about death.\n\nI assume most humans think about mortality but it is making me depressed and sad. I have been a generally happy person and I love life, but I feel like I've been mentally hit with a weight that just won't lift. I am a lover of nature and environmentalist and have always found so much awe and beauty in nature but now when I look out at the trees or the creeks I just see my own reflection of sadness and the constant anxiety I've lived with my whole life.\n\nWhy do we have to die? It doesn't bring me peace knowing my atoms will dissipate, it makes me sick. All I know is right before me, and all I know will be stripped away into nothing. So what is the point? What are we doing here? It feels like a sick game, and humans have gone so far off the rails that everything in our society seems like it is just some unhealthy coping strategy. \n\nI look at strangers and think of how fleeting their existence is too. I think about all the terrible ways humans treat each other and the Earth and my heart is just so full of grief for the amount of suffering I am witnessing. I literally cannot even look at lobster tanks in the grocery store without wanting to bawl my eyes out. The worst part is that death is starting to sound peaceful because at least I won't have to think. But I love thinking and I don't want to die. I keep imaging myself screaming and crawling during my final days and all I see is terror. It makes me think about the blackness after death. We don't even experience death. What if its because of the sheer terror of it all? Ugh. It makes me sick.\n\nI am only 28 and I want to live a long and happy life, but this is by far the hardest experience in my life I've had to go through. I'm just so sad. I am crying all the time over my own death and the death of us all. I have isolated myself from society and I know that doesn't help. Is this just depression? Anxiety? PTSD? A mix of it all?",
    "score": 26,
    "url": "",
    "created_utc": 1742753206.0,
    "author": "NormalConfidence3654"
  },
  {
    "title": "Can anxiety eventually get better with time?",
    "body": "Sorry if the question sounds insensitive but I've been a very anxious person since I was 8 or so, it got worse when I turned 13 though and since then I've found myself worrying and obsessing more and more about pointless stuff. I heard my entire teenage years that this chronic anxiety and paranoia of mine is just a symptom of being a teen and lately I've been hoping that's true. Will it get better with time? ",
    "score": 24,
    "url": "",
    "created_utc": 1743201831.0,
    "author": "Repulsive_Weather_39"
  },
  {
    "title": "Anxiety is a pot of boiling water",
    "body": "My therapist had the best analogy for anxiety that ACTUALLY helps me view it better when I'm in the midst of heightened anxiety:\n\n  \nYour anxiety is like a pot of boiling water on the front burner. When it boils over - the water has gotten too hot and you are not in control (ie an anxiety or panic attack). \n\n  \nThe goal of 'controlling' your anxiety isn't to forget about it. It's to take the pot of water and put it on the back burner. That water is still there and it's still hot. and it could boil at any point - but it's on the back burner cooling. \n\nThings like therapy, medications, walking, deep breathing, exercise, healthy food etc. (whatever works for you - anxiety is a tricky thing) cool the water down and/or help it stay cool. \n\nSpiraling thoughts, alcohol, missing out on sleep, caffeine, etc. are things that may warm that water back up. \n\nAnd the goal of anxiety management is to be aware of the pot - not to ignore it - and to work on keeping it cool. \n\n  \n\\^ This analogy has seriously helped me view my anxiety as a thing. and something I can actively 'work on the temp'. And I explained this analogy to my partner and now we have a common language for how I'm feeling. 'The pot is hot today' vs 'feelin luke warm - its a good one today'. \n\n  \nHope this helps someone. I was surprised at how much it helped me. \n\n",
    "score": 25,
    "url": "",
    "created_utc": 1743087485.0,
    "author": "PersonOftheNorth"
  },
  {
    "title": "Has anyone developed physical symptoms that became chronic?",
    "body": "Has anyone developed physical symptoms, that severely affect function, in a matter of days, from a sudden onset of anxiety? \n\nLike heaviness, dissociation/depersonalization, brainfog, muscle/neck stiffness?",
    "score": 25,
    "url": "",
    "created_utc": 1743016319.0,
    "author": "Ok_Doughnut5007"
  },
  {
    "title": "What's one thing that helps you fight anxiety?",
    "body": "Hey everyone,\n\nOn tough days, I find that something simple like deep breathing or a quick walk makes a huge difference. What's one small thing that helps you get through anxiety? Let's share tips! ",
    "score": 24,
    "url": "",
    "created_utc": 1743057117.0,
    "author": "NeatMacaroon5675"
  },
  {
    "title": "How do you cope with anxiety?",
    "body": "Hi! I have GAD, OCD and agoraphobia. Just wondering how others cope and make life work?",
    "score": 22,
    "url": "",
    "created_utc": 1742990217.0,
    "author": "Stoneadge"
  },
  {
    "title": "Does anyone else get more anxious when it’s dark outside?",
    "body": "I’m not scared of the dark, but as soon as it gets dark outside my anxiety is more likely to spike \n\nI prefer night over day, but darkness feels so claustrophobic and suffocating. I get anxious that I can’t turn on the light. I think it’s sort of a fear of not being in control. And it’s gloomy and depressing and it makes me feel hopeless and sad. The winter darkness is totally black and it feels heavy and empty (I love the summertime dark though. When there’s a bit of colour in the sky even at midnight)",
    "score": 20,
    "url": "",
    "created_utc": 1743108142.0,
    "author": "heelhene"
  },
  {
    "title": "I am afraid of the side effects of Xanax withdrawals.",
    "body": "I've been taking 0.5mg Xanax for about 3 years from inconsistent phycologists. 1st time was prescribed once a day. 2nd was 2 times a day. 3rd was 3 times a day. I was already on an ADHD medication (for 20 years) on top of that and Prozac (Before Xanax) making this situation real unsettling. On top of that, I vape. Now, my body's shaking, my chest feels like its slightly burning, and I'm afraid. The new doctor just cut me off from Xanax without any further explanation than me already having a controlled substance prescribed (35mg Dexmethylphenidate). I have not seen the doctors faces and I was already in blindly trusting it over visiting the counselor a few times. I think the Clinic has stopped the visits after I found a job. The 2 phycologists, I never met face to face, only over the phone. This is I suppose day 4 after the last Xanax, of my withdrawal and I am lost.\n\n  \nUpdate: Thank you everyone for the support and advices! I really appreciate it! Unfortunately, I'm not going to reply to each comment atm but I did read them and upvoted. Also, reading that most of you had went through similar situations shows that I'm not alone in this. Sorry that y'all went through those experiences but glad for your recovery, even in process. I'm not trying to say that \"benzo is completely bad\", just a fear of having 2 control substances prescribed without proper monitoring and blind trust. I just went to a hospital yesterday night, got examined, and was prescribed with a temporary replacement to help me with the Xanax withdrawal. It's a bit rocky with the day 5, but I am getting there.",
    "score": 21,
    "url": "",
    "created_utc": 1742916838.0,
    "author": "VaccinatedKarren"
  },
  {
    "title": "The idea of Pregnancy scares me to death",
    "body": " \nBasically what the title says, although there is currently no risk of it happening the thought of me (20M) impregnating someone terrifies me. In my life I've hooked up with four Women but never properly had sex so there's no chance of that happening right now I am still somewhat scared to have sex with a Girl because of what I've just said and if worst comes to worst that hell might extend to her wanting to keep the Child. \n\nOften when I open Facebook and other social media platforms it seems as if someone else my age or who I went to school with is either pregnant or going to be a Father and though I'm so glad it's not me burdened with a Child I sometimes worry that one day I will get unlucky. I'm honestly so young and there's so much I want to do with my life, I'm not sure if I ever want Children but certainly not now. \n\nThis may seem irrational as I couldn't possibly have impregnated anyone so I don't have anything to worry about, I put it down to the fact I have Autism and often suffer from anxiety from it but seriously though the thought of this is pretty bad. I reckon if I think about it too much longer the anxiety is gonna give me diarrhoea. \n\n",
    "score": 22,
    "url": "",
    "created_utc": 1742904031.0,
    "author": "jacoblm28"
  },
  {
    "title": "How are you right now….mood wise?",
    "body": "",
    "score": 20,
    "url": "",
    "created_utc": 1742869325.0,
    "author": "AnxietyChats"
  },
  {
    "title": "Do you think talking help relieve anxiety?",
    "body": "\n",
    "score": 21,
    "url": "",
    "created_utc": 1742845388.0,
    "author": "Fffgfggfffffff"
  },
  {
    "title": "it's going to be okay.",
    "body": "i know that it feels hard to believe it rn but trust me, everything is going to be okay 💙\n\nif you need someone to talk to/help you move on from your anxiety, feel free to dm me :)",
    "score": 21,
    "url": "",
    "created_utc": 1742738757.0,
    "author": "Unlucky-Ad8021"
  },
  {
    "title": "My story of getting over anxiety and panic attacks hope this helps someone",
    "body": "Hey,\n\nSo as stated above, I got over my anxiety and panic attacks (Sort of read more ). ( Male 25 currently )\n\nRight, so a bit about me and my anxiety:\n\n1. Had my first panic attack in 2023, which resulted in thinking I was having a heart attack and calling an ambulance. Imagine my surprise when I was told it was a panic attack, especially when the only anxiety I ever felt was during a presentation in front of a big crowd.\n2. The first panic attack led me to call an ambulance for the next 6 nights, as it kept happening and I couldn't sleep at all during nighttime, and was confused about how to fix this.\n3. The panic attacks then moved on from night time into daytime, which made me even more miserable, and after being sleep deprived for a month and getting depressed from this, I realised I had to do something.\n\n**The process of understanding my panic attack process:**\n\n1. The first thing I did was go at it symptom-wise. Once the panic attack starts, it spirals out of control into an ambulance call cause my brain says I am dying, help please. So did every test possible on my heart and other organs, including a brain, lung scan, and even checked for cancer just for fun. After getting all the results that no shit I am completely fine I was now reassured that I am not dying.\n2. The panic attacks still happened constantly, but they stopped spiraling into an ambulance call, as now I was sure I was not dying, it just meant I had to suffer my brain going at 500 km/h for the next 30 mins until I fried myself out. So this was the next step I needed to fix to stop this process.\n\n**The process of finding a \"cure\":**\n\n1. This was the more difficult part as I was physically healthy it meant my mind was fucked. Now a psychologist seems like a scam in my head as they just read books, passed some test and got their shit license / or they don't even have one. I chose psychotherapy, meaning a medical specialist who can help me.\n2. The psychotherapist (from now on referred to as therapist for easier writing), during my first sit down that lasted always 60mins on the dot, asked one simple question what do I want out of this I explained I want to stop having panic attacks, she explained I can just take Xanax and be done with it. Which was a fair take, I had these drugs with me, I didn't like taking them as it slowed my brain down to such a point where I felt like a zombie. So she asked again What do I want to achieve with this? This time, after thinking for a few minutes, I explained I want to get my life back, meaning sleeping and enjoying life without thinking and anticipating that I am about to feel like I am dying. Now this was a small but very important moment in my battle with this new anxiety. She said this \" Your subconscious now has understood that there is a psychological problem,\" which she was correct in. This was not a disease like a common flu this was my brain saying hey somethings wrong fix it or i will keep fucking your life. After this I was now ready to start fixing my life.\n\n**What is a panic attack?**\n\n1. Panic attacks are your subconscious not agreeing with your conscious mind. Meaning my reality is going against everything my brain was programmed with from my young developing years. In total, I did 5 sessions 60 minutes each, 1 session per month. The reason for this was this explanation from my therapist:\n\n\" Your subconscious takes 30 days to undergo a change, and you can only speak with it for 60 minutes. \"\n\n**How do you speak with your sub-concious?**\n\nMy sessions went like this, a 5-minute. talk about how my life is going, if anything has changed, and then a 5-minute \"ritual\" more like guiding steps I have to do with my eyes close,d which would lead to a whole world opening in my mind. I would have these visions which I won't go into detail cause of course personal stuff, but your subconscious is so strong you can feel wind, water, heat, sadness, happiness,s and even pain while doing this. During my third session, I was able to not just see but also walk around instead of being just guided by my mind. Being able to stop and analyze was important. Now, if anyone is interested, I can explain in the comments the process to do this as I have been doing this as a party trick now, I just won't be able to explain what you saw, it's for you to analyze :D\n\n**My last session, a 5-month result:**\n\nAfter the 5 sessions, I have realised the life I was living was going against my mind and my brain was protesting against it now it's not something I can fix in one day after realising, but the 5 sessions in which my therapist pretty much just listened what I saw and wrote my panic attacks every month got less and less frequent. It's as if my two consciousnesses were now slowly starting to agree as there was more understanding of each other. This made them less frequent, but as i said in session 1 I want them fcking gone.\n\n**After all this, this was the final fix:**\n\nThe final fix will sound stupid, but quote my therapist here:\n\n\"We have the ability to program ourselves and our minds, all you have to do is do it.\" Now, if you told me this 5 months ago, I would have called this person a scam artist or a cult leader. But now feeling more in touch with my brain, I got to thinking, can I do it?\n\nI asked my therapist for more sessions, he said this is the MAX amount any person should need, and this is it now, work on it. So I got home, the day went by, I kept thinking about it, and once again I went to bed I had a panic attack. Only this time, this was my thought process:\n\n1. I am not dying\n\n2 This is a panic attack\n\n3. Why are you sending me this signal?\n\nAnd during my third question in my head I felt an answer or a thought, I still don't know what it is, but I had a sudden impulse to go make green mint tea. I heated my water, I made the tea, I drank it panic attack was gone while I was making it. I thought, OK weird, the next day, same again. I go to bed, have a panic attack, I press the button to make the tea panic attack gone.\n\nAnd on the third day, I made green tea before going to bed, and I haven't had a panic attack since, except anxiety when I still have to present in front of a big crowd :P\n\n**What the fuck is with this mint tea?**\n\nNow, after all this, I called my therapist and explained the situation and asked if this was what she meant, should I just drink tea, is this some magical fix?\n\nNow it turns out I have hyper brain activity, as most people do these days, it's not ADHD, it's just the brain always working very fast, it doesn't mean you can't focus. And my \"talks\" or \"meetings\" with my subconscious somehow made me understand that hey, let's make this ritual of making mint tea before we go to bed, which can cool our brain down, and also mint has a relaxing effect too.\n\n**So mint tea = no panic attacks?**\n\nFor me, yes; for you, no.\n\nThis story is about the process I went through to understand my condition and how I got in touch with my core consciousness. Since those sessions my outlook on life was clearer I was more happy and I was overall enjoying life more after every session even while I was still having panic attacks, so what I recommend to you is going to a psychotherapist a real doctor and trying this method out or just thinking about this on your own as I still have a habit of speaking to my self when I am laying in bed just mimicking a discussion and see if any bad thoughts come up.\n\nIf you read all of this, I hope this helps you somehow, and don't settle for just taking medicine, you are just avoiding and suppressing your mind instead of fixing it.\n\n**THE REPLY ABOUT THE PROCESS: (also this got way more attention than I thought xd )**\n\nWell first of all it takes two people as someone needs to be your guiding voice:\n\n1. You sit down on a couch, sofa or arm chair sth that is comfortable.\n2. Close your eyes and relax don't cross your legs or arms just have them straight next and relaxed almost as if they are limp.\n3. Now once your sitting relaxed and comfortable the seconds person needs to start the guiding.\n\nTHE PROCESS:\n\n1. The guiding person should start speaking in a calm voice through this whole time. I will just write the exact words he needs to say with a few second pauses ( This is translated from my own language so make some adjustments to make it sound correct in your lagnague)\n\n\" You feel a small warmth in at the center at your chest, pause 2s you can start to feel it going down through your ribs, your stomach and it stays there you feel it there making you warmer and warmer almost too warm but pleasant like a warm bath, from there it goes on down to your legs, the warmth spreads to your knees, the back of your feet and finally reaching the tip of your fingers staying there. PAUSE 6s. From here, it starts going back up once again from your toes, going to your knees, your stomach, and stopping at your chest area once again, stopping but then moving on to your arms. It reaches your shoulders, your arms, your palms and staying at your fingertips. The warmth is warming up your fingers as if a fire on a cold, snowy day. (PAUSE) It then moves back once more, reaching your chest and this time going u,p warming your spine, reaching your ears and stopping at the top of your head. What do you see? \"\n\nHOW TO NAVIGATE:\n\nAt the what do you see point, you don't open your eyes an image should pop up in your eyes, some sort of image. It can be as simple as a forest, a road and it's the second person's job to guide you.  They can never suggest you do something, they can only ask and give a small hint and only communicate when you stop talking or exploring, they can't interrupt your process. For example my first image was a forest view. My therapist asked explain in detail what I see. I started explain the color of the trees and explained that something doesn't seem right ( she doesn't ask me what ), she waits for me to open up my self as the answer just pops into my head usually. I explained this view is fake and I recognise it it was the Windows XP screen saver and it's not real, and I am not aware what to do in an image not a real forest.\n\nShe then finally asked me if I could look around in all directions. That's when I notice I have legs and decide to walk on my own and I walk into this fake image that pops up a big door ,which I enter. (won't tell more here as it's private ) and I am aware this sounds like a random dude on the internet making shit up but trust me I was as freaked out myself xd\n\nSome common tricks I learned and questions for the leading person\n\nWe can identify our age in these visions, by looking at our feet small feet young age, larger older.\n\nUsually, the stuff we don't want is behind us or in dark areas.\n\nIf you encounter darkness you can try to walk into it but you can also not be allowed which is called a sub conscious block. I have had these areas in my visions always at some point I would reach them, but I had friends who would break the darkness and go past it.\n\nA friend of mine wanted this experience he landed in a forest as he liked nature a lot at first it was fun cool (his feet were as if of a baby) as he kept going deeper and deeper the forest turned dark I asked him how he feels in this new forest, he explained fear, anxiety and painful coldness at this point he asked me should he continue and this is the response your guiding person should give always \" Its your vision you choose what to do\" he kept going forward as he was also interested the deeper he went the colder and darker it got and thicker but after walking in his mind for at least 10mins and real life 10 mins he reached light and warmth when he looked at his feet in the cold forest they were bigger but still of a young kid, when he left the dark forest his feet looked as that of an adult.\n\nNow maybe it means sth about his childhood idk that's why I said you need a professional to analyze it, but it helped him realise sth about him self that he kept to him self.",
    "score": 20,
    "url": "",
    "created_utc": 1743115425.0,
    "author": "Ok_Alarm_9367"
  },
  {
    "title": "Anxiety and Caffeine….",
    "body": "IK IK, caffeine can make anxiety worse in some people. But the thing is I love coffee 😢. Decaf doesn’t do it for me and regular just shoots me like a rocket to the moon and I mean like not even half of a small coffee…\n\nAnd I’m just mad about it.\n\nIf anybody knows any decent decaf coffee either for home or a coffee place lmk.\n\nSincerely a sad girl who just wants to enjoy coffee.",
    "score": 18,
    "url": "",
    "created_utc": 1742699185.0,
    "author": "Poloma-Mule22"
  },
  {
    "title": "Is it possible to recover and feel normal after a severe episode?",
    "body": "The last 5 months of my life have been incredibly stressful, and I feel like it broke me. Things like unemployment, the possibility of losing my apartment, and being completely alone to name a few. I was thinking of suicide every day at the worst of it. I have nausea and nervousness almost constantly. I have some glimpses of relief where I'm in a good mood, but 90% of the time I feel so anxious.\n\nSome of the things in my life are getting better, but I feel like I've damaged myself by having sustained severe anxiety for months. I tried buspar for a few days but it completely wrecked my sleep, which has still not gone back to normal after 3 weeks off it. It also increased my tinnitus.\n\nSo mentally I know my situation has improved and the original triggers are getting better. But my body doesn't want to let go of the anxiety! I'm so tired and I just want relief. I want my old self back.\n\nI don't know how to recover. I go to the gym 3 times a week. I go for hour-long walks almost every day. I cook food at home and try to eat nutritious foods. Drink plenty of water. TV can't even distract me.",
    "score": 18,
    "url": "",
    "created_utc": 1742690981.0,
    "author": "AirSharp4003"
  },
  {
    "title": "I feel a strange anguish/agony. Does anyone else feel this way?",
    "body": "**I rarely feel well, relaxed, or at peace.**\n\nOne thing that has been bothering me a lot is that, after having some panic attacks, I developed a feeling of anguish that comes out of nowhere and sometimes lasts for hours (or even the whole day). **It is different from a panic attack**, which is very intense but lasts only a few minutes.\n\nThis anguish has a more persistent nature. Most of the time, my heart is not racing, there is no sweating or trembling—just this lingering feeling of terror and agony, accompanied by muscle tension and a sensation of weakness or fainting.\n\nThere have been days when I thought I was losing my mind, that I wouldn't be able to handle it and would end up being hospitalized because I felt completely disconnected from reality. Nothing seemed to calm me down.\n\nThe feeling of derealization scares me because it feels like a delusion, as if I am losing control and my sense of reality. Occasionally, I feel the urge to cry or something like a need to \"vomit\" the anguish. I've noticed that sometimes this feeling tries to return, and I try not to think too much about it or focus on myself too much to keep it from taking over.\n\nDoes this happen to anyone else? I've never heard anyone talk about this kind of anguish.\n\n**P.S.:** I’ve been experiencing other symptoms, I’m seeing a psychologist, and I have Klonopin for panic attacks, but I created this post specifically to share this feeling of anguish.",
    "score": 18,
    "url": "",
    "created_utc": 1743184523.0,
    "author": "Confident-Witness-43"
  },
  {
    "title": "If meds never worked for you, what keeps you going?",
    "body": "",
    "score": 18,
    "url": "",
    "created_utc": 1742846387.0,
    "author": "Personal_Common1635"
  },
  {
    "title": "is this normal ?!",
    "body": "I had a huge anxiety attack on Friday night after taking a bong hit (about 2 days ago). It lasted over 2 hours, and it was the worst anxiety attack of my whole life. I genuinely thought I was gonna die. but now, the days following it, I feel really weird. it's a bit more difficult to breathe, I'm lightheaded, way more tired, and I have this sense of dread in the back of my head. have any of you experienced that before ? if you have, how long does it take to feel \"normal\" again ?",
    "score": 19,
    "url": "",
    "created_utc": 1742775916.0,
    "author": "Puzzleheaded-Worth-8"
  },
  {
    "title": "Does anyone else pee in excess",
    "body": "I'm not talking that you need to pee more often, I mean, you have a full bladder, empty, 30 min later full bladder ...despite not having fluids or food yet. I'm talking volume, not frequency or the feeling of needing to pee. I'm talking about urine coming Maybe I nthe middle of the night or during the day.  No diabetes",
    "score": 16,
    "url": "",
    "created_utc": 1743175597.0,
    "author": "Global_Status3018"
  },
  {
    "title": "How do you do it-people with chronic pain or illness?",
    "body": "I don’t know how to word it better so if this is offensive I am very sorry but I’m just very curious. Chronic pain and illness is already a tough battle and then anxiety on top of it…I just can’t fathom it and that’s very privileged of me even though illness and pain can happen to anyone…I admit I have a bit of health anxiety but when I think of people who have chronic health issues everyday I feel so stupid. We can all become disabled, chronically ill and such but…how do you get through the day? ",
    "score": 17,
    "url": "",
    "created_utc": 1742759972.0,
    "author": "Personal_Common1635"
  },
  {
    "title": "I can't relax no matter how hard I try, does anyone know tips?",
    "body": "I've always been a really nervous person but these years my anxiety is terrible! I can't calm down when I feel stressed (which is very often) No matter how many breathing techniques I try, it's impossible and it always comes back. I've got diagnosed hypochondria and that just worsens my overthinking. I don't know what can I do, because I feel like I'm really damaging myself both physically and mentally and I can't stop it. Plus, my family doesn't allow me to go to any kind of therapist or similar so I'm alone in this. Please any advice is appreciated.",
    "score": 16,
    "url": "",
    "created_utc": 1743021223.0,
    "author": "opheliemoon"
  },
  {
    "title": "My Crippling Anxiety Is Getting Worse",
    "body": "I'm a 23, almost 24 year old female and I think my anxiety is getting so much worse. \n\n  \nI've had anxiety for as long as I can remember, even as a young child. I have some memories of when I was 2 years old, where I was EXTRA cautious about jumping around, running around, etc. I was constantly afraid of hurting myself for NO good reason.\n\n  \nThroughout my childhood, I had typical social anxiety that eventually got worse. I would cry as I gave presentations in class. I would physically shake if I had to talk to any adults (other than family). I got diagnosed with depression and social anxiety. I tried a few different meds, but got bad about remembering to take them.\n\n  \nFast forward to today. I have CONSTANT anxiety. If I have ONE bad experience, I believe that experience will happen every time and I'll try to avoid getting myself into those situations again. I am paranoid about everything. I have tornado and storm phobia and live in the midwest, so I am CONSTANTLY having anxiety attacks about storms. I'm terrified of going out in public for fear of kidnapping or getting hurt (even though I'm in a safe area). I've seen too many things online; and I have made myself stay off the internet for fear it was ruining my view of the world, but I've already seen things and know how messed up it can be and my view of the world has already been ruined. I was playing a video game with my boyfriend where you can roleplay with other players and I was driving a semi truck and hit someone's expensive car on accident. They called me a horrible name and I just started SOBBING. I felt horrible, even though it was a game. I'm now afraid to ever drive again for fear I'll hit someone's car IRL because if I can't handle being insulted and confronted by a real player in a video game, how can I handle it in real life?? I had two traumatic experiences with my knees and while they're okay now, I have anxiety over walking for fear I'm going to hurt myself again. I cannot even WALK without freaking out!\n\n\n\nI barely go out with my boyfriend other than for dates because I'm terrified of people and their intentions. My anxiety LITERALLY controls my life and it is just getting worse. I feel like I should've never been born as a human because I cannot mentally or physically handle this anxiety. It's bad enough I have some sort of heart issues (my heartrate rests higher than normal people) and I have pre-hypertension with my blood pressure, so I feel like every anxiety attack (which I can have several a day, though usually only ONCE a day) is getting me closer to a heart attack or some other cardiac event. I do not know how to handle my anxiety... I think it's just going to continue getting worse.",
    "score": 16,
    "url": "",
    "created_utc": 1742785334.0,
    "author": "Crippling_Anxiety28"
  },
  {
    "title": "Anyone else feel like or are scared of regressing cognitively?",
    "body": "My biggest fear is losing the ability to speak or read be of a cognitive decline. I've always considered myself a good reader and used to read all the time. Over the past few years I got really into fanfiction and was reading about the same characters just different stories involving them. My husband thinks it's just burnout, but I can't even read them anymore. Everytime I try to start a new story the words just don't make sense to me anymore or I can't read it at all like I don't have a desire to. But the thing is I do enjoy reading those fanfictions. Now it's like expanded to anything I try to read like an article online, even text messages sometimes I receive. If I'm writing it it doesn't really happen only when reading. But now I feel like my speech is becoming affected. Like when talking I feel like I jumble my words up and feel like I'm getting stupider or something. Idek please help this has been an ongoing thing for a while now.",
    "score": 13,
    "url": "",
    "created_utc": 1742773916.0,
    "author": "Aggressive_Cat7989"
  },
  {
    "title": "When i work i'm healthy, when i'm unemployed i spend my life to go to the doctor, i don't know if it's anxiety",
    "body": "I worked for 2 years i went to the doctor only once in two years. Now i'm unemployed. \nIn the past six months, I’ve been to the doctor five times, to the physiotherapist, had one ultrasound, three MRIs, and one blood test.\nAnd I still have one more ultrasound, one X-ray, and one blood test to do. (Thankfully, I don’t have to pay for all of it.)\nI don’t know if it’s anxiety or something else, but I tend to have more health issues when I’m not working.\n\nIt was the same before my two years of work, I was at the doctor’s all the time.\n\n",
    "score": 13,
    "url": "",
    "created_utc": 1743084284.0,
    "author": "Nytliksen"
  },
  {
    "title": "Panic Attacks on a plane",
    "body": "Recently started getting really bad panic attacks. The feeling is scary. Like your life is doomed. Heart starts to beat super fast, dizziness, and feel like I’m about to pass out. I’m hopping on a plane soon. But I’m feeling anxious of being trapped in a tin can 30,000 ft up in the air for 7hours with no where to run. worried that one of my attacks will happen during the flight. What should I do ? ",
    "score": 14,
    "url": "",
    "created_utc": 1743052992.0,
    "author": "_xmichaels"
  },
  {
    "title": "I think I’m insane.",
    "body": "Or going insane? \nI won’t know if I’m insane, crazy people don’t know they’re crazy. \nMy brain is on turbo 24/7, even when I sleep I have 5 dreams on average. \nMy body is falling apart because of all the anxiety. No medication or therapy worked. \n\nAm I gonna live the rest of my life like this? I’m so scared I’m actually losing my mind. \nEvery day it’s the same thing but sometimes I get new surprises. Like what the fuck is up with the obsessive intrusive thoughts of someone I love dying? It’s all I can think about when I’m with them. I’m so fucking tired.",
    "score": 12,
    "url": "",
    "created_utc": 1743042464.0,
    "author": "Desert_Flowerr"
  },
  {
    "title": "Natural ways to manage anxiety?",
    "body": "I decided to go off my meds due to too many unwanted side effects. What are some natural remedies to anxiety? (I’ve already started cutting back on caffeine and trying to get a full night of sleep) Any suggestions welcome! ",
    "score": 12,
    "url": "",
    "created_utc": 1743168419.0,
    "author": "Environmental-Ad1800"
  },
  {
    "title": "Does anybody have a way of stopping anxiety nausea at the moment?",
    "body": "I just can't keep going on with this \n(Quick addition, I'm already on my full dose of Paroxetine 20mg but the first day it's being hell, I was with 5mg before)",
    "score": 12,
    "url": "",
    "created_utc": 1743005733.0,
    "author": "Visible_Tax_9044"
  },
  {
    "title": "Does anybody else get anxiety about these things?",
    "body": "Having to complete all of life:\nIf I've done this much and struggled so much already, how am I supposed to do the next 70 years?\n\nHitting rock bottom again:\nWhat do i do if it gets bad again, what do i do if it gets too much one day and I decide enough is enough?\n\nNever getting better:\nWhat if I'm stuck like this for the rest of my life? How will I have kids and do my dreams if I feel like this forever?\n\nI just feel alone and that nobody else has these thoughts like me",
    "score": 12,
    "url": "",
    "created_utc": 1742932539.0,
    "author": "lolacolauk"
  },
  {
    "title": "I’m looking for friendly advice please anxiety is ruining my life.",
    "body": "I’ve been anxious my whole life. I’ve always suffered from anxiety and worrying about everything. I feel like I have gotten significantly worse, and my boyfriend also keeps telling me it’s worse. Lately I’ve been having a panic attack almost every. single. day. I’ve been having panic attacks about dying, what will happen to me when I die, and every freaking sickness I read about online I then fall into a downward spiral thinking that’s going to happen to me. Right now I can’t stop panicking that I’m going to go blind, and now I keep having pains behind my eyes. My boyfriend is so sick of me I think he’s going to break up with me. He is getting to a point where he’s starting to freak out on me every time I try to talk to him about something. I can’t keep asking him for reassurance he is so sick of it. I have no one to talk to because no one understands. My whole family laughs at me and tells me I’m ridiculous whenever I bring up any concerns. They always tell me to stop worrying about everything I read online but it’s literally impossible. I do not know how to stop thinking every bad thing is going to happen to me. It’s waking me up at night. Does anyone have ANY advice that can hold me over until my therapy appointment in May I can’t keep living life like this.\n\nAlso- I read about the discord server for anxiety, has anyone used that? I’m considering trying it out so maybe I can find a friend who understands i literally have no friends besides my boyfriend. I also have terrible social anxiety so if I don’t respond to comments I’m not trying to be rude, I just get anxious and don’t know what to say 😕",
    "score": 12,
    "url": "",
    "created_utc": 1742773485.0,
    "author": "coffuccino"
  },
  {
    "title": "Just a reminder💚",
    "body": "Just saw this on Facebook and thought I’d spread the message and love💚\n\nMost people don’t realise how much strength it takes to pull yourself out of a dark place. To get up. To function. To face the day when everything feels heavy.\n\nSo if you’ve done that today, or any day even in the smallest way, Be proud of yourself.\n\nBecause that kind of strength is quiet, but powerful.",
    "score": 10,
    "url": "",
    "created_utc": 1743193016.0,
    "author": "Imaginary_Coat_2638"
  },
  {
    "title": "Feel useless and like everyone hates me..",
    "body": "What type of mental illness is when u feel like u have to start over with another job or even friend group/club etc because u feel like everyone hates your existence after u make a mistake at a job etc. like i constantly have this overwhelming vibe that people are tired of me and hate me.. like im useless and the be better off without me. its so exhausting. Especially in work places, i feel like my “worth” is constantly on the line.. like i feel like I have to be 99.9999% perfect 100 percent of the time. I hate feeling like im not the best worker and they could use someone else better. It’s drives me insane. Especially since im working at a law firm rn and eve thing has to be on point and it it’s not the head supervisor gets very bitchy. Hate it here ",
    "score": 12,
    "url": "",
    "created_utc": 1743009982.0,
    "author": "Wonderful_Most_5132"
  },
  {
    "title": "Is anybody on Prozac? How do you feel?",
    "body": "I’m taking Zoloft now, but my psychiatrist brought up the possibility of switching me to Prozac if Zoloft doesn’t work. I want to know if anybody has had good experiences on it. Thanks a lot in advance.",
    "score": 13,
    "url": "",
    "created_utc": 1742867460.0,
    "author": "Sad-Confidence21"
  },
  {
    "title": "Going to the dentist for the first time in over 10 years tomorrow and I'm scared of being judged",
    "body": "Scared and embarrassed of my oral hygiene. Especially embarassed because there is free health care here in Germany and I should have gone to a dentist sooner. They will find out that I never brushed and took care of my teeth, did nothing in all those years without seeing a dentist. I'm only now seeking a dentist because of an abcess/infection of a tooth that broke off YEARS ago, which could kill me now. Not only that, I have 1 more definite cavity, worn yellow teeth, small dark spots, 2 emerging wisdom teeth and so many issues in my mouth. Already imagining them listing all the issues I have makes me feel ashamed...And what if they ask me so many questions of why I didn't go sooner, what if they judge or scold me and stuff.   \nI'm also scared to get my tooth pulled or that I'd need to go to the hospital in case the infection spread too deep into my bones,   \nPlus the social anxiety... I really do not anticipate tomorrow :( \n\n",
    "score": 12,
    "url": "",
    "created_utc": 1742842809.0,
    "author": "Educational-Yard9702"
  },
  {
    "title": "Do you ever feel sick when anxiety hits?",
    "body": "I have discovered that I have anxiety some time ago, but even when I was 13/14 I feel sick in my stomach when I 'm nervous. Now days I feel physically sick when I'm anxious, feeling like my guts are coming out and the nerves of my skin are \"\"\"diferent\"\"\"\". I don't know how to explain, but I wanted to know if anyone feel something like this ( or I 'm the crazy one ._.)",
    "score": 12,
    "url": "",
    "created_utc": 1742698275.0,
    "author": "Vixigoth"
  },
  {
    "title": "Im so tired",
    "body": "Anxiety literally consumes my life and all I worry about is stupid things I'm so tired and sick and I cant get help or be medicated, any advice?",
    "score": 10,
    "url": "",
    "created_utc": 1742691944.0,
    "author": "Basic-Form1112"
  },
  {
    "title": "Someone tried to break into my home",
    "body": "Last night my next door neighbor was high on something and tried kicking in our front door. They were screaming they were going to hurt us and we were possessed by evil spirits. The cops came and took them home. I was told if they come by again to record it and look into a restraining order. I don't know this person or what compelled them to do this. I had nightmares all night and have been trembling off and on ever since. \nI'm paranoid to begin with but now...\nIm just thankful my wife, son, and dogs are all safe.",
    "score": 11,
    "url": "",
    "created_utc": 1742659285.0,
    "author": "CoyoteVirus"
  },
  {
    "title": "Is this considered a panic or anxiety attack?",
    "body": "I sat down to eat dinner and watch a TV show and all of a sudden, I lost my appetite. I noticed I was feeling off and my forehead was flushed with weird sensations. It felt like I was going to go crazy at any moment. I just kept going on my phone, scrolling through Twitter and TikTok. Then I got up and walked around for a bit to see if that would get my mind to cool. My heart rate went up slightly but most of the physical symptoms were around my head. I felt nervous in my head if that makes any sense.\n\nI kept telling myself that it’s impossible for a normal, healthy person to just go crazy out of nowhere. This is how most of my anxiety and/or panic attacks play out. It’s not overwhelming enough to need a Xanax but it’s bothersome enough to interfere with my appetite and make me worry for a few minutes, thinking I might lose it. I gradually calmed down and was completely fine after 30 minutes.\n",
    "score": 9,
    "url": "",
    "created_utc": 1743216829.0,
    "author": "Beginning-Lawyer3965"
  },
  {
    "title": "What's the most surprising thing you have learned about yourself through anxiety?",
    "body": "Dealing with anxiety has taught me a lot about myself-things I did not expect. For those of you who have been through it, what's the most surprising thing you have learned about yourself in the process?\n\nWould love to hear your thoughts! ",
    "score": 11,
    "url": "",
    "created_utc": 1743140299.0,
    "author": "Aggravating-Sir-7007"
  },
  {
    "title": "I again feel worse",
    "body": "I cantttt anymore I'm feeling terrified right now. My stomach is in knots and my mind is filled with negative thoughts. I don’t know what to do my hands are shakin I feel like I’m about to throw up. My hands and feet are cold and I just feel awful about myself like I just feel so terrible.  I can’t breathe properly and my chest feels tight. I just want to cry and let it all out but still it won't help.",
    "score": 10,
    "url": "",
    "created_utc": 1743064167.0,
    "author": "vvsksv"
  },
  {
    "title": "My anxiety was more nutrition deficiency and poor diet than anxiety",
    "body": "I want to share my story (32 F) so others can benefit in case they are in the same situation I was. I had daily panic attacks that turned into agoraphobia in 2019 for a few years. I was fearful of having panic symptoms in enclosed spaces, at shops, restaurants, driving, essentially everywhere and because 2020 hit, it all got worse. Anyway, long story short, in 2022 I found out I was quite low in ferritin iron (24) and started taking 200mg elemental iron twice per day with 1000mg vitamic c each time (get your blood tested first to make sure you are indeed low in vitamins/minerals first before supplementing), magnesium and vitamind D also helped with supplementing. I got my ferritin iron from 24 up to 130 within 4 months of that regiment and my panic attacks started intensely diminishing. Now, 3 years later, I still experience some anxious feelings but it went from fear levels of 110 to like a 10 in how much fear and symptoms of anxiety I feel. Another change I made was from a higher carb diet (white rice, bread, pasta) to eating more protein (eggs, meat, fish, nuts) and fiber (fruits and vegs and legumes like beans) and this also helped eliminate my anxiety a lot. One thing I've researched is that insulin resistance or sugar crashes also mimic anxiety feelings and cortisol/adrenaline surges, so if you can get your blood sugar to a better place, your anxiety symptoms will improve a lot too. I hope this helps others. I recommend speaking to a doctor first before supplementing, although they may tell you ferritin iron in the 20-50 range is good, optimal is still much higher than that, around 130 for six months, especially for menstruating women. Take care everyone and I hope things can improve for you like they did for me.\n\n  \n1. Get nutrients, vitamins, mineral levels checked through a blood test (iron, vitamin D, vitamin B's, etc). Start supplementing if you are low. \n\n2. Eat more protein and fiber and less processed carbohydrates. \n\nThese two steps together made my anxiety go from 110 to 10. ",
    "score": 10,
    "url": "",
    "created_utc": 1743008832.0,
    "author": "Ok_Diet3138"
  },
  {
    "title": "Feeling hopeless",
    "body": "I'm 21 at to the point where I feel like I'm stuck in a hole and I will never be able to get out I've gone to a counselor and had five sessions so far but I feel like it hasn't helped in the last couple months I've been trying to get jobs but I can't seem to hold a job for longer than a month. I got bullied all throughout high school so I never want to be around people. I just feel useless and I want to get better I need money but I feel like I'm too mentally unstable to work not sure what to do. My mom got diagnosed with cancer last year I want to take care of my family but I feel horrible that I can't. ",
    "score": 12,
    "url": "",
    "created_utc": 1742944233.0,
    "author": "Danielk111"
  },
  {
    "title": "What TV show would you recommend to get distracted? Or something else.",
    "body": "(Sorry if similar questions already exists)\nI don’t like it when it’s quiet, but I can’t really concentrate on something. Especially when Anxiety gets worse. Currently it’s Music or reaction videos on YouTube but every 5-10 minutes I have to search for a new video I haven’t seen. Normally I have something running on Netflix or Amazon prime but I can’t find anything suitable. The last thing I watched was Teen Wolf and since then I've always turned something else on but after 10 minutes at the latest I was looking for something new.\n\nI don't like series like Friends or himym and I don't do well with horror or graphic violence. It depends how much, but Game of Thrones, for example, I had to stop after 30 minutes.\n\nWhen I find something I watch it again and again, but at the moment the things I've watched before only bring back memories.\n\nCan you recommend something? What are you doing to distract yourself? What is your comfort TV show? Or YouTube, Music, Documentaries, anything?😅\n\nThanks♥️",
    "score": 11,
    "url": "",
    "created_utc": 1742894948.0,
    "author": "Glittering_Issue237"
  },
  {
    "title": "will i recover from drug induced anxiety disorder",
    "body": "im 15yo i had a bad weed trip the first time i ever used it because at the time i didnt know but after talking with doctors it was the strongest weed u can get it was a pen and it was concentrate and now i just feel anxiety over nothing 24/7 sometimes even dpdr everything feels slowed i feel tired all day exhausted drained lost intrest in all my hobbies failing every class at school and maybe a little depressed and im kinda just lost on what to do and its been 3 months should i go on a SSRI or wait more",
    "score": 9,
    "url": "",
    "created_utc": 1742838772.0,
    "author": "Different-Ad4954"
  },
  {
    "title": "anxiety causing lack of appetite",
    "body": "I dealt with severe anxiety and it caused me to lose my appetite entirely and become very weak. does anybody know any other examples of this happening or is this rare?",
    "score": 7,
    "url": "",
    "created_utc": 1743202689.0,
    "author": "Leather-Swordfish-96"
  },
  {
    "title": "I feel so trapped inside of my body and I'm just so derealized. I feel like I'll never see life the same. Genuinely feels like I'm losing it. Humans existence is just scary to me and feels so foreign.",
    "body": "Struggling so bad. ",
    "score": 10,
    "url": "",
    "created_utc": 1743200899.0,
    "author": "OCDylan_"
  },
  {
    "title": "has anyone else’s experience with anxiety been far worse than with depression?",
    "body": "I don’t mean if one is worse than the other, as I know that there is no actual answer to this and they are both horrible. I just want to know if anyone else shares this sort of experience. \n\nI’ve been thinking about this a lot lately because, as I get older, I’ve never experienced anxiety this intense, constant, and long-lasting before. It’s starting to feel debilitating. Every little thing feels like a catastrophe. There’s so much to be happy and grateful for, but I can’t seem to live in the present without this looming uneasiness.\n\nI’ve always been prone to stress, anxiety, and catastrophizing. I mean, I literally have OCD, so that’s one thing, but it used to come in waves. It was usually one thing at a time, like a cycle. Before, I learned to accept that cycle, handle things as they came, and just hope for the best. But now, my mind latches onto anything it can find, and it’s driving me insane. It’s such a deeply unsettling, nauseating feeling that I don’t even know how to put it into words.\n\nOn the other hand, I remember being depressed for like three years straight years ago. It was horrible, but there was a weird sense of peace.. like I had reached a point where I was so sad that I was almost spitefully calm. Everything sucked, but whatever. At least that meant I could do whatever I wanted, and I had accepted that my life would never be what I wanted it to be, so nothing really mattered. In a way, there was this really toxic kind of comfort in it.\n\nBut there’s no way to do that with anxiety. I can’t reach that same type of acceptance with my anxiety because it literally is built on the foundation that accepting anything is just simply not an option, and it never will be. \n\nWhen I was depressed, at least it made sense. I had real reasons to feel that way, so I could focus on what caused it. Maybe there was no solution, but I knew for a fact that it was all real. But now, my anxiety is making me depressed. And with anxiety, it doesn’t matter if anything is actually wrong..it’s still going to ruin my life anyway. \n\nSigh, I just needed to rant honestly. I just wish there was an easy way out of this shit. ",
    "score": 9,
    "url": "",
    "created_utc": 1743197712.0,
    "author": "vtlday"
  },
  {
    "title": "How do you cope with your anxiety at night?",
    "body": "The past few weeks my anxiety has been pretty bad at night. I’ll lie awake feeling kind of paralyzed from my anxiety. I need to find some new coping mechanisms or distractions or something ",
    "score": 9,
    "url": "",
    "created_utc": 1743131940.0,
    "author": "cowabungahoney"
  },
  {
    "title": "It's it odd how anxiety effects weight?",
    "body": "So I found out a few weeks ago that anxiety has many ripple effects, in this case weight loss. I find that I have major issues eating enough food to maintain my weight, I see the number go down and I get anxious which causes me to lose more weight. I also get anxiety over sugar and salt which causes more stress which leads to weight loss. So I'm in a cycle of not eating enough because of the sugar and salt, causing anxiety which causes more weight loss. Isn't that strange, I can't even find good foods to eat to supplement either. Everything is packed with salt and sugar. Atleast I'm not losing Weight at a dangerous rate but it's frustrating. I'm sure anxiety causes weight gain aswell, I used to eat to cope with it at first and I ended up gaining alot, but when I lost it now I have anxiety over food too",
    "score": 10,
    "url": "",
    "created_utc": 1742989800.0,
    "author": "pxzvzxq"
  },
  {
    "title": "Anxiety from change",
    "body": "\nDoes anyone else get crippling anxiety from changes? \n\nHere’s my story. In 2022 my boyfriend and I were planning a move to a new state so that he could attend school. I lived and have always lived in my little home town and have also never lived with a significant other.. while my boyfriend and I were living together at the time, it was with his parents - so it’s different. About 2 months prior to the move, we visited some family in another state and attended a wine tasting as a going away gift for my boyfriend. That night was the first night I had ever experienced anxiety. When I went to bed, I started to get a stomach ache and had to use the restroom.. now normally, wine and beer doesn’t sit well with my stomach so I wasn’t too shocked that this was happening. But then I started to panic, I felt a burning sensation throughout my whole body, I couldn’t stop twitching, and didn’t feel real. It was the most bizarre feeling. I eventually fell asleep and the next day was better. However, slowly and slowly it started showing itself at certain times. The second time I got it was 2 months later when we went on a camping trip (this was about a week before we were planning to drive a Uhaul to our new place in a new state and move all of our stuff in). During our camping trip I was totally fine, up until I realized that I wasn’t experiencing the anxiety (side bar: I didn’t know it was anxiety yet, I thought maybe it was wine, or sugar, or caffeine). The second I checked in with myself to see how I was feeling, I got the stomach ache and out of body feeling and had to go to bed immediately. \n\nI started to think that this was all happening because I was making a big move and that it’ll all stop when I get settled into our new home in our new state, but it hasn’t gone away. I only ever get the anxiety if I am traveling or if people are visiting. I will get small sensations of it when I do new things, like go to concerts, meet new people, or anything outside of my normal routine.. but that usually stops after I do whatever the event or occasion is and it won’t happen the next time. It however has not gone away for when I travel or have people visit me. \n\nI’m not afraid of flying, I’m afraid of getting anxiety and being stuck on a plane. I am also not afraid of people, I am afraid of getting anxiety and being stuck somewhere that I can’t calm down. \n\nAbout a year ago my boyfriend and I got a cat and I was so anxious when he came home. I wanted to get rid of him for the first week, but I eventually got used to it and now I love him so much. \n\nMy boyfriend proposed to me in November of 2024 and I felt slightly anxious after that and shamefully wanted to go back in time and not deal with the engagement, because I hated the anxiety. That eventually subsided and now I’m so happy.\n\nAfter that I started avoiding wedding planning because I didn’t want to deal with the anxiety that comes with it. I noticed that I’m doing things to avoid getting anxiety, so I decided that I wanted to do a mini elopement. I decided that we would do a small wedding the same weekend that my fiancé was graduating since everyone would be in town already. So I put the plan in action and sent out invites to everyone (he is graduating in May of this year so it’d be 2 months away). To give an overview of where I was at a week ago, I was planning on trying for a baby, planning a wedding, and we had some changes coming up in the next two months with him graduating and us moving back home.. a lot of exciting things! But, the night I sent the invites out.. I was hit with the absolute worst anxiety of my life. I was down for 5 days, feeling absolutely horrible. I couldn’t get out of the fight of flight feeling and was an absolute wreck. It resulted in me canceling the wedding and deciding it was just too much for me to handle. I also had put a hold on trying for baby. \n\nI always thought that the anxiety was due to traveling and social events, but when I got the anxiety just from being at home, I started to think I was going insane and my mind was giving up on me. However now, I’m realizing it’s due to life changes or pretty much doing anything outside of my ordinary routine. \n\nDoes this happen to anyone else? I am feeling better knowing that there may be a root cause to all of this, but I also feel so alone in my thoughts. I’ve started to feel like my life is over.. I feel like I can never have kids because I’m scared of getting anxiety and not being able to change my mind once I have them (depressing and morbid, I know). I feel like I won’t be able to have the wedding I want because I’m scared of the anxiety. I have all of these fears and feel lost. I’m really just looking for people who can relate to my story. Does it ever get better?\n\n\n",
    "score": 9,
    "url": "",
    "created_utc": 1742933047.0,
    "author": "No_Apple3940"
  },
  {
    "title": "Does anyone look at trees or other people and feel they are so lucky they don't have anxiety?",
    "body": "That is what I feel\n",
    "score": 8,
    "url": "",
    "created_utc": 1742745146.0,
    "author": "Supta_Pragya_turya"
  },
  {
    "title": "How many meds did you try before you found one that works for you?",
    "body": "Zoloft used to work for me and eventually triggered huge daily panic attacks. Tried Wellbutrin but it gave me weird cardiac symptoms. I’m on Lexapro now and I feel like it’s making me more depressed, lethargic and gain weight. I figure I’ll ask if I can try Prozac next. If that doesn’t work then I think I’ll give up on meds. I’m so sick of going on and off medication. I’m in therapy as well and that helps but it seems like my panic attacks are becoming more frequent. ",
    "score": 8,
    "url": "",
    "created_utc": 1742743198.0,
    "author": "Few_Selection783"
  },
  {
    "title": "It’s Kinda Messed Up Isn’t It",
    "body": "Sometimes anxiety can be a selfish disorder. Worrying about how youre affecting others and wanting that reassurance that you’re doing okay and that everything will be okay even when you’re in the wrong. Aka apologizing over and over again hoping someone will forgive you.  \n\nBut what’s messed up is that sometimes when anxiety is caused by the reassurance need not being met as a child, it manifests as you seeking that reassurance constantly later. So regardless of if you needed that reassurance and never got it so you had to quickly learn how to get it from people or give it to yourself, if you needed that reassurance later in life, you’re just going to end up having to meet your own need again. And in the case of you having disappointed or hurt someone, the only person to blame is you. \n\nI resent anxiety quite a bit for that. ",
    "score": 9,
    "url": "",
    "created_utc": 1742705906.0,
    "author": "darlingapplepie"
  },
  {
    "title": "Something I need to get off my chest.",
    "body": "I, a male who loves the medical field, have an overgrowth of VERY BAD medical anxiety, and for what reason? I have not a clue, but it's debilitating.\n\nI couldn't sleep last night because I got in a small biking accident. Me vs someone's fence. Had some upper left stomach discomfort with mild burping, google says 1 day to live. Ask Ai, says I'm fine. I don't know who to believe \n\nDOES THIS HAPPEN TO ANYONE ELSE? If so, please tell me how to fix this anxiety.",
    "score": 8,
    "url": "",
    "created_utc": 1742702884.0,
    "author": "Main-Freedom-4751"
  },
  {
    "title": "Anyone else get bad nausea and diarrhea with anxiety?",
    "body": "Anytime something bad happens it hits me like a train. Then I have zero appetite too until the nausea subsides. I hate it.\n\nIt’s been a bad day today. Work stuff with one of my managers and then my poor dog got the zoomies aka runing around the house too fast and accidentally hurt her foot and started yelping for a few seconds then she couldn’t put pressure on it and had to take her to the emergency vet. We’ve been waiting for about 2 hours because they are short staffed and waiting caused me horrible anxiety which now I have anxiety induced diarrhea and I’m nauseous. It doesn’t help either that the cleaning people came in and the smell from the cleaner is making me more sick. I hate it! I wish nausea and of course anxiety wasn’t a thing. ",
    "score": 8,
    "url": "",
    "created_utc": 1743225984.0,
    "author": "VirgoEsti"
  },
  {
    "title": "I’ve become a chronic procrastinator because of anxiety and I have no idea how to get better.",
    "body": "I’ve become a chronic procrastinator because of anxiety and I have no idea how to get better.\n\nIt seems like almost every single tiny task I’ve got to do spikes my anxiety, whether it’s homework, organizing my room, doing projects, etc. I feel pain in my chest area, my breath shortens and my brain goes into a massive stress response.   \n\nI think this all started during the pandemic, but it’s gotten significantly worse over time. I’m a college student now and things are starting to get pretty serious, yet I feel like I’m in the least productive phase of my life. Honestly, apart from going to classes, I do nothing all day. I don’t even party, read books or watch shows.\n\nI’ve tried every possible trick that gets mentioned online, but none of them have worked for me. Seriously, I can’t count the number of times I have tried using Pomodoro or splitting tasks into tiny parts. This doesn’t work because I can’t manipulate myself into thinking I only have to do small part of assignments – it’s fairly obvious I must complete them.\n\nI’ve also tried dopamine detoxes (they don’t work because my anxiety very quickly gets overwhelming and I can’t live without my coping mechanisms). I also tried reward systems, but they don’t work because I’d just rather not do my tasks even though there’s a reward (then, after a while, I just take the reward without doing the work). I’ve also tried hypnosis, visualizations, ‘forgiving myself’, gamifying, temptation bundling, meditation etc.\n\nI don’t even know why I’m posting this on Reddit, I know nothing is going to change anyway. Maybe my problem is thinking anyone on the Internet has a solution to my situation.\n\nI don’t have access to therapy right now. The consultations with my Uni’s psychologists occur on campus, in an empty classroom, and I’m afraid people will see me going there and think less of me.\n\nAlso, please don't say 'it sounds like you have x mental disorder'. That doesn't really help.\n\n ",
    "score": 7,
    "url": "",
    "created_utc": 1743122641.0,
    "author": "mrleoallan"
  },
  {
    "title": "Does your empathy get labeled as insecure?",
    "body": "I understand that online you will find a lot of people of different mind sets, and well I guess I ran into some on this platform that thought correcting my spelling was actually a good deed.\n\nI tried, responding saying its unnecessary, and that out of all the things in the world happening.... there it's not needed. Unless someone absolutely, inquired to strive to be reminded to spell properly.\n\nConclusion? I was called *insecure*.\n\nBecause I wanted to speak for people who do not know how to write, or spell.\n\nOr just want to come online and feel relaxed about writing out responses.\n\nUnless times have changed, and it's a requirement to spell properly.\n\nI know, I am not the world's greatest star student in English.\n\nBut I write out in plain English, and its *read-able.*\n\nI sometimes feel like I am not fit to be online anymore. Perhaps, I am just old for it now. Too many people comfortable, in their own mindset and can't see how disrespectful it can be or feel.\n\nI wouldn't correct anyone's spelling, or grammar in a text message, or online unless they were genuinely curious to evolve that personally. Sorry, for venting! I know its just online stuff, and it will roll off my shoulder. I am just exhausted, over all, and trying to not feel anxious over it.",
    "score": 8,
    "url": "",
    "created_utc": 1743118303.0,
    "author": "[deleted]"
  },
  {
    "title": "Anyone else jolt awake when trying to fall asleep?",
    "body": "\n \n",
    "score": 8,
    "url": "",
    "created_utc": 1743082758.0,
    "author": "k0_0du"
  },
  {
    "title": "Therapy and medication have helped me so much",
    "body": "I started going to therapy in 2023 and finished in December of last year. Started with my psychologist last year and I'm still medicated (planning on living it in two months)\nThe therapy and the medication together have done so much for me, I've never felt so good in my whole life. I didn't know I could rest without waking up 5 times in the middle of the night, I didn't know I could not worry about time for one second, I didn't know I could say \"no\", I didn't know I could live \nI'm really grateful to the people that have helped me be me ",
    "score": 8,
    "url": "",
    "created_utc": 1743078575.0,
    "author": "SecretHugger203"
  },
  {
    "title": "Literally everything makes me anxious",
    "body": "I can't even do my damn hobbies without feeling stressed about them. The only way for me to get away from the anxiety is to do the most boring, mind-numbing things on the planet which just makes me bored and half the time doesn't even work. I feel like I'm rarely even happy :/",
    "score": 8,
    "url": "",
    "created_utc": 1743037342.0,
    "author": "smores_or_pizzasnack"
  },
  {
    "title": "pill swallowing anxiety",
    "body": "hello :) so i'm sick and i just got a medicine from my doctor that is a bigger pill than what i am used to. i have a very bad gag reflex and i get really anxious about taking pills in general. today i tried to take one of the pills but i just couldn't. every time i put it in my mouth my brain would be like \"you can't swallow it! it's too big! you're gonna choke!\" and it got me really worked up and i just couldn't stop crying, even after taking a little break. i have to take these pills for 10 days. does anyone have tips??? thanks in advance 🫂",
    "score": 6,
    "url": "",
    "created_utc": 1742951258.0,
    "author": "Pan_the_Pancake56"
  },
  {
    "title": "I’ve been crying myself to sleep every night for months",
    "body": "Ten months ago, I had a strange viral illness. I had a fever, severe nausea, and painful wrists and ankles for about ten days. My ANA came back borderline at the time, but later turned negative. Ever since, I’ve been spiraling. I constantly read online about autoimmune diseases, especially lupus, and I’m terrified.\nAfter that  I lost my appetite, developed IBS-like symptoms, my blood pressure and heart rate started spiking, and I began getting hives and panic attacks symptoms . I kept going to the ER thinking I was dying. I’ve had countless tests – autoimmune panels, MRI, endoscopy, ultrasound, CT scans – and everything has come back normal. My liver enzymes were slightly elevated at times, so I insisted on a liver biopsy, which thankfully came back negative.\n\nDoctors kept telling me it was anxiety. But I couldn’t stop obsessing. I spent every waking hour reading online about lupus. Eventually, my symptoms worsened again – I developed frequent urination, more hives, shortness of breath, rapid heartbeat, especially at midnight. I had multiple ER visits with heart rates hitting 150 bpm and  shortness of breath\n\nI saw two rheumatologists – all tests came back negative. My echocardiogram, chest CT, and spirometry were normal. A urologist did a cystoscopy and diagnosed me with IC (interstitial cystitis). Still,my symptoms come in monthly flares: I get sick, see doctors, everything is normal, I feel okay for a while, then it starts again.\n\nRecently, I went to the ER for mild nausea. My urine showed trace protein and microscopic blood, but my ultrasound and infection markers were normal. I have no UTI, yet I panicked – convinced lupus is silently attacking my kidneys. I redid my autoimmune labs – all negative again – but urine still shows trace protein and blood. I cry constantly. I can’t function. My C4 is 14 (normal range 10-40 but on the lower end), and I’m scared it’s creeping toward lupus nephritis.\n\nI saw a Reddit post from a girl who had abnormal urine for two years and mild knee swelling, with negative autoimmune tests. Then, two years later, she was diagnosed with lupus and tests turned positive . Her story destroyed me. I have a little daughter and I’m terrified of dying, of leaving her alone. I haven’t felt joy in 10 months. I’ve spent so much money on doctors and tests. Nothing helps.\n\nI started psychiatric meds two weeks ago, but they haven’t helped much yet. Therapy sessions barely work – I feel better for a couple of hours, then crash again.\n\nI don’t have clear autoimmune symptoms. Just constant stress, hives, elevated IgE, and deep fear. What if this is early lupus? What if it’s hurting my kidneys silently? I feel trapped in this never-ending cycle of fear.\nhonestly don’t know if what I’m experiencing is a real illness or just the result of anxiety and overthinking. I keep seeing people on TikTok who were eventually diagnosed with lupus or scleroderma, and they all say that for years, doctors told them it was just in their head or caused by anxiety. That scares me so much. What if I’m in the same situation? I truly don’t know if my symptoms are from a real disease or if they’re just coming from my constant fear and anxiety.\n\n\nPlease… if anyone has been through something similar, how did you cope? How do I stop obsessing over lupus when doctors say everything is fine, but my body keeps flari",
    "score": 9,
    "url": "",
    "created_utc": 1742951004.0,
    "author": "FoxAccomplished9665"
  },
  {
    "title": "I apologize for the over sharing",
    "body": "But I really feel like I might die, I can't eat, I just can't without feeling nausea, is my case so different? I can calm down but the second I try to go back to the task I fall again, there's no peaceful point, I don't even know if the human body and mind can go through this, I lost all hope yesterday, I've tried praying, relax techniques and nothing, I even tried chilling for a while then stay in corpse pose but nothing seems to work",
    "score": 8,
    "url": "",
    "created_utc": 1742837933.0,
    "author": "Visible_Tax_9044"
  },
  {
    "title": "DAE hit themselves, throw things, damage property, and bite themselves with an oncoming anxiety attack? *potential trigger of parents*",
    "body": "Lately my anxiety has been so freaking bad. It feels like an elephant is sitting on my chest at any given moment and I just don’t know what to do. My mom is a *huuuuuuge* trigger for me — she triggers my misophonia a LOT and our relationship is very tumultuous and codependent — and lately after almost every time we have some type of conversation I feel the panic attacks rising, and then I’ll throw something at the wall or ram something into the wall, or I’ll bite the side of my hand until I draw blood, or I’ll hit myself in the head with a phone or try to bite something hard, usually the corner of my phone or a book or a pen or pencil or some other random object in my room. Sometimes it’s the only thing that makes the panic and rising overwhelming feeling dissipate, even if temporarily. But yeah does anyone or has anyone else done this? How do you stop? ",
    "score": 6,
    "url": "",
    "created_utc": 1743126384.0,
    "author": "thelovewitch069420"
  }
]