[
  {
    "title": "Manchester City launch \"historic offer\" for Lamine Yamal (€275 million)",
    "body": "",
    "score": 1644,
    "url": "",
    "created_utc": 1744213413.0,
    "author": "ExotiquePlayboy"
  },
  {
    "title": "I shadowed a Premier League scout to find out how they spot hidden talent",
    "body": "The game is about to kick off, the teams lined up in formation, and we have already hit a snag.\n\nChris Robinson, [Southampton’s](https://inews.co.uk/topic/southampton-fc?ico=in-line_link) head of academy recruitment, has agreed to let me tag along while he scouts an 18-year-old left-back at a non-league game.\n\nRobinson has channelled three decades of experience into a new book – [*The Scouting Game*](https://amzn.eu/d/9dqqVtR) – a veritable bible for aspiring recruiters and parents of young players navigating a complex world. After reading it, I called him to pitch the idea, and he went for it.\n\nBut as we sit in the tiny, sheltered stand at Test Park, in Southampton, I realise the problem. The kid isn’t starting. “That’s scouting life,” Robinson says. “It’s very accurate!”\n\nHe’s come to watch Millbrook vs Hamworthy Recreation to see Bobby Gorman.\n\nAt the start of the season, Southampton prioritised finding a left-back for the under-21s. They have been trailing several and Gorman, who recently turned 18, was recommended by a local scout in December. The scout observed him once more a few weeks ago and told Robinson he was worth a look.\n\nFormer Cheltenham Town manager Robinson reads *The Non-League Paper* every Sunday, hunting for reports of young players, and saw Millbrook were playing at home. He watches around eight games a week and added this to his diary.\n\nWe meet in the car park and, after initially being asked if we’re officials, enter through a narrow wooden hut, pay £6 for tickets and take our seats, with plenty of time for a few lessons in scouting basics.\n\nRobinson likes to get to games early to see the players warm up. You can learn a lot about a footballer by the way they prepare, he says. How seriously they take it, interactions with team-mates, their technique, passing, shooting.\n\nBut scouts have to come prepared, too. Robinson says that he has a wardrobe for all weather conditions in the boot of his Kia – from shorts to thick winter coats.\n\nToday, he’s wearing a long, thick coat. The sun sinks, the floodlights turn on, the temperature plummets.\n\nFirst, and perhaps most importantly, Robinson has to identify Gorman. At this level, it isn’t a case of loading formations on the BBC Sport app or finding headshots on Google. A few websites, social media and match programmes can help. But information is scant.\n\nRobinson finds the Millbrook colours on their Wikipedia page. He has been told Gorman has “fair hair” and is slim. He is wearing the No 3 shirt and has yellow boots. The referee blows the whistle and the Millbrook left-back is dark haired. And not 18.",
    "score": 911,
    "url": "",
    "created_utc": 1744108786.0,
    "author": "theipaper"
  },
  {
    "title": "Totti hits out at Messi: \"Put him 25 years at Roma & tell me how many Ballon d'Ors he would win\"",
    "body": "",
    "score": 568,
    "url": "",
    "created_utc": 1744387054.0,
    "author": "ExotiquePlayboy"
  },
  {
    "title": "'He's a Gooner' - Tottenham fans rage as club appoint former Arsenal chief",
    "body": "",
    "score": 433,
    "url": "",
    "created_utc": 1744384807.0,
    "author": "DWJones28"
  },
  {
    "title": "Scout who 'discovered' Cristiano Ronaldo dies as Man Utd icon pays tribute",
    "body": "",
    "score": 335,
    "url": "",
    "created_utc": 1744122035.0,
    "author": "YouAreTheDishes"
  },
  {
    "title": "Southampton's relegation breaks unwanted Premier League record | UK News",
    "body": "",
    "score": 308,
    "url": "",
    "created_utc": 1743954713.0,
    "author": "Miserable-Pace7398"
  },
  {
    "title": "Met Police PC sacked after text saying Harry Kane should die in a plane crash",
    "body": "",
    "score": 246,
    "url": "",
    "created_utc": 1744110376.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Brentford are putting the rest of the Premier League to shame",
    "body": "",
    "score": 237,
    "url": "",
    "created_utc": 1744371279.0,
    "author": "theipaper"
  },
  {
    "title": "PSG has a chance to beat all Premier League Teams (Man City, Liverpool, Aston Villa, then Arsenal) this season",
    "body": "What’s the odd? ",
    "score": 223,
    "url": "",
    "created_utc": 1744232917.0,
    "author": "Strict-Newt-6625"
  },
  {
    "title": "BREAKING Mohamed Salah is 'closing in' on a new Liverpool contract",
    "body": "",
    "score": 220,
    "url": "",
    "created_utc": 1744216202.0,
    "author": "Liverpool-com"
  },
  {
    "title": "Does Wrexham have an unfair advantage in League One? And is that why they aren't liked?",
    "body": "I'm curious what people think about this. \n\nI've seen quite a bit of hate around the fact that they have had two back to to back promotions and seem to be on for their third this season. Why do you think that is?\n\nDo they have an unfair advantage over everyone their have played against in the last two seasons / League One? Or have they just been a bit more savvy than other, more established clubs higher up in the leagues. ",
    "score": 205,
    "url": "",
    "created_utc": 1744273670.0,
    "author": "Other_Video_4114"
  },
  {
    "title": "England guaranteed fifth Champions League spot",
    "body": "Thoughts on this\n\n[https://www.bbc.com/sport/football/articles/c8je0z4z2vgo](https://www.bbc.com/sport/football/articles/c8je0z4z2vgo)",
    "score": 200,
    "url": "",
    "created_utc": 1744194171.0,
    "author": "TheAppropriateBoop"
  },
  {
    "title": "Bellingham: Madrid 'lucky' to concede only 3 goals",
    "body": "",
    "score": 191,
    "url": "",
    "created_utc": 1744193990.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "First player ever to score 2 free kick goals in a single UCL KO match, Declan Rice had never previously scored from a direct free-kick in his nine-season professional career. He did it twice inside 12 golden second-half minutes against Courtois, too – arguably the best goalkeeper in Europe.",
    "body": "",
    "score": 155,
    "url": "",
    "created_utc": 1744173773.0,
    "author": "electroctopus"
  },
  {
    "title": "Mohamed Salah signs new deal with Liverpool",
    "body": "",
    "score": 129,
    "url": "",
    "created_utc": 1744355429.0,
    "author": "mrjohnnymac18"
  },
  {
    "title": "Yamal on his rise: 'As if I'm playing PES'",
    "body": "He's 17, does he remember Pes. ",
    "score": 130,
    "url": "",
    "created_utc": 1744134367.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "25 years ago today, Ronaldo suffered a freak knee injury that disrupted his career. Two years later, in one of the greatest comebacks in football history, R9 lead Brazil to their fifth World Cup triumph",
    "body": "",
    "score": 130,
    "url": "",
    "created_utc": 1744413319.0,
    "author": "mrjohnnymac18"
  },
  {
    "title": "Atléti fans: We'll sue UEFA over Álvarez pen",
    "body": "",
    "score": 136,
    "url": "",
    "created_utc": 1744469254.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Di Maria and EFL star among 12 players implicated in illegal betting scandal",
    "body": "",
    "score": 128,
    "url": "",
    "created_utc": 1744399333.0,
    "author": "DWJones28"
  },
  {
    "title": "Jack Grealish ‘slapped in face’ by Man Utd fan as police charge man with assault",
    "body": "",
    "score": 116,
    "url": "",
    "created_utc": 1744096932.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Why Martin Odegaard struggled at Real Madrid and how it led him to Arsenal",
    "body": "",
    "score": 82,
    "url": "",
    "created_utc": 1744094093.0,
    "author": "mrjohnnymac18"
  },
  {
    "title": "Ivan Juric leaves Southampton - with two managers already in consideration",
    "body": "",
    "score": 78,
    "url": "",
    "created_utc": 1744023362.0,
    "author": "DWJones28"
  },
  {
    "title": "Swindon players celebrate in rival's face after he scores last-minute own goal",
    "body": "",
    "score": 55,
    "url": "",
    "created_utc": 1744473214.0,
    "author": "DWJones28"
  },
  {
    "title": "Former FC Barcelona presidents to testify on referee corruption case",
    "body": "On March 10, prosecutors accused FC Barcelona, Negreira, two former Barça presidents, Sandro Rosell and Josep Maria Bartomeu, and two former Barça directors, Òscar Grau and Albert Soler, of corruption.  \n\nThe letter submitted to the court accused Barça of having \"reached and maintained a strictly confidential verbal agreement with the accused Negreira, so that, in his capacity as vice president of the CTA and in exchange for money, he would carry out actions tending to favor FCB in the decision-making of the referees in matches that the club played, and thus in the results of competitions.\" ",
    "score": 51,
    "url": "",
    "created_utc": 1744338083.0,
    "author": "United-Statement4884"
  },
  {
    "title": "David Ornstein Confirms Liverpool Have ‘Held Talks’ with £50m Premier League Star",
    "body": "Your thoughts if Bournemouth’s Dean Huijsen gets into Liverpool's squad\n\n[https://anfieldindex.com/80890/david-ornstein-reds-in-race-with-chelsea-and-arsenal-for-50m-premier-league-defender.html](https://anfieldindex.com/80890/david-ornstein-reds-in-race-with-chelsea-and-arsenal-for-50m-premier-league-defender.html)",
    "score": 51,
    "url": "",
    "created_utc": 1744430856.0,
    "author": "TheAppropriateBoop"
  },
  {
    "title": "Source: Osimhen eyeing move to PL or Juventus",
    "body": "",
    "score": 51,
    "url": "",
    "created_utc": 1744125116.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Dorking Wanderers release statement after young player, 15, drowns in lake",
    "body": "",
    "score": 45,
    "url": "",
    "created_utc": 1743964880.0,
    "author": "DWJones28"
  },
  {
    "title": "Football club wins appeal of fine for fans chanting 'UEFA Mafia' with satirical intent",
    "body": "",
    "score": 48,
    "url": "",
    "created_utc": 1743975206.0,
    "author": "Majano57"
  },
  {
    "title": "South America proposes expanded 64-team 2030 World Cup",
    "body": "",
    "score": 39,
    "url": "",
    "created_utc": 1744357296.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Eddie Howe: Newcastle boss in hospital after falling ill",
    "body": "",
    "score": 38,
    "url": "",
    "created_utc": 1744473950.0,
    "author": "DWJones28"
  },
  {
    "title": "Rice's stunning free kick double double helps Arsenal rout Madrid",
    "body": "",
    "score": 35,
    "url": "",
    "created_utc": 1744146550.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "'I was worried' - Raphinha reveals why he apologised to team-mate Pau Cubarsi after Champions League goal for Barcelona against Dortmund",
    "body": "",
    "score": 33,
    "url": "",
    "created_utc": 1744471247.0,
    "author": "mrjohnnymac18"
  },
  {
    "title": "Messi's mid-match orders revealed by Suarez as he sparks Miami comeback",
    "body": "",
    "score": 30,
    "url": "",
    "created_utc": 1744272935.0,
    "author": "DWJones28"
  },
  {
    "title": "Villa urge calm from PSG fans over Martínez feud",
    "body": "",
    "score": 29,
    "url": "",
    "created_utc": 1744184467.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Redditch United Third Kit 2025/2026",
    "body": "This is my proposed design for the club's third kit for next season. I hope you like it.",
    "score": 30,
    "url": "",
    "created_utc": 1744473156.0,
    "author": "Massive-March-7622"
  },
  {
    "title": "How could the imbalance of football financially be fixed?",
    "body": "Today in European football the competitions and wealth are concentrated on a small amount of Elite Clubs (Real, Barcelona, Bayern, PSG, And the big six in England) \n\nIt’s 99.9% impossible for any club outside of the top 5 leagues to win a champions league and even the Europa league can be challenging since most clubs just get raided every year of the best players they have outside of the Elite \n\nWill this divide become even bigger for years to come between the top 5 leagues and the rest or is there a way to stop this gap from further widening \n\nThe biggest example I can remember of this financial imbalance was during 2019 when Ajax reached the champions league semi final and in the same summer 2 key players left and the following summer most of the team was dismantled by the Elite Clubs \n\n",
    "score": 26,
    "url": "",
    "created_utc": 1744462077.0,
    "author": "CosmeticInk5"
  },
  {
    "title": "Gündoğan: City lacked 'desire' of previous years",
    "body": "",
    "score": 19,
    "url": "",
    "created_utc": 1744406057.0,
    "author": "Sparrow-Radiance"
  },
  {
    "title": "Biggest Comebacks in Champions League History",
    "body": "",
    "score": 21,
    "url": "",
    "created_utc": 1744234962.0,
    "author": "AbilityDull4713"
  },
  {
    "title": "LaLiga appeal Barça's court victory for Olmo",
    "body": "",
    "score": 20,
    "url": "",
    "created_utc": 1744055084.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Cristiano Ronaldo and Director Matthew Vaughn Start New Movie Studio UR•Marv",
    "body": "",
    "score": 19,
    "url": "",
    "created_utc": 1744353702.0,
    "author": "Pep_Baldiola"
  },
  {
    "title": "Singapore’s Lion City Sailors stun Australia’s Sydney FC 2-0 in first leg of AFC Champions League Two semis",
    "body": "",
    "score": 13,
    "url": "",
    "created_utc": 1744209439.0,
    "author": "limhy0809"
  },
  {
    "title": "12 Players Out Of Contract: Who Should Everton Keep In The Squad For Next Season",
    "body": "Everton face a max exodus this transfer window, who should they keep.",
    "score": 13,
    "url": "",
    "created_utc": 1744383326.0,
    "author": "3012k"
  },
  {
    "title": "My submission to the Redditch FC Kit Competition",
    "body": "",
    "score": 12,
    "url": "",
    "created_utc": 1744217234.0,
    "author": "Commercial-Ticket489"
  },
  {
    "title": "Redditch United Jersey Entry 25/26 Third Kit",
    "body": "Redditch United Jersey Entry 25/26 Third Kit",
    "score": 13,
    "url": "",
    "created_utc": 1744186770.0,
    "author": "Zestyy95"
  },
  {
    "title": "What area of an outfielder’s overall game do you value most when determining how “good” they are?",
    "body": "Assuming said player is “decent” in every other area but is just particularly good in 1 area\n\nI ask because I’ve seen different people place different weight on different aspects of a player’s overall game during my time being a football fan. Personally, I believe technique/muscle memory is the most valuable to have over every other part of the game for most players. The only time this changes imo is for high-level professionals when their technique is so good to the point where the margins between players’ ability becomes smaller and smaller as you go higher\n\nHowever, I’ve seen &amp; heard some people place weight in other areas of the game a bit more. Example: When I was 13 years old in 8th grade, one of the coaches chose to start this baseball player at CB for the school team rather than any of the 2 other CBs who were much more technical &amp; had better game-IQ. His reasoning? The starting CB was rapid with a good vertical. That’s it. He had no prior experience playing, he was just rapid &amp; capable of jumping high.\n\nThat’s just one of many examples. I’ve met people that said their game-IQ matters most. What about you? What’s your take?\n\n(I put “outfielder” in the title since any normal football fan knows GK is the hardest position, so they need almost everything)",
    "score": 12,
    "url": "",
    "created_utc": 1744027722.0,
    "author": "GroundbreakingGoal15"
  },
  {
    "title": "Football Shirt Giveaway Response",
    "body": "I recently received my Redditch United football shirt in the post c/o r/football giveaway. Thank you so much, it looks mint, my new favourite second team, have them starred on flash scores now! Cheers pals! ",
    "score": 11,
    "url": "",
    "created_utc": 1743982760.0,
    "author": "joey_wes"
  },
  {
    "title": "Amorim: Slower pace helps Man Utd in Europe",
    "body": "",
    "score": 12,
    "url": "",
    "created_utc": 1744239792.0,
    "author": "Slight-Ant-4158"
  },
  {
    "title": "This map shows clubs in the top three divisions of French football",
    "body": "There’s a large gap in the south-west of France, primarily due to rugby being more popular in that region. Are there any other leagues with noticeable regional differences, for reasons other than population size?",
    "score": 11,
    "url": "",
    "created_utc": 1744058333.0,
    "author": "Blandinio"
  },
  {
    "title": "Chelsea: Boss Enzo Maresca delighted with academy duo after Chelsea's 3-0 win over Legia Warsaw",
    "body": "",
    "score": 10,
    "url": "",
    "created_utc": 1744325531.0,
    "author": "Miserable-Pace7398"
  },
  {
    "title": "FIFA President in Cincinnati, donates $1 million",
    "body": "Greetings from Cincinnati, the Queen City.. FIFA President Gianni Infantino was in town today. FIFA is donating $1 million to Cincinnati and to the other host cities of the upcoming FIFA Club World Cup, Cincinnati hosts 4 games of that tournament. I already have tickets for all 4 games.\n\n[https://www.wvxu.org/sports/2025-04-11/fifa-president-soccer-fans-shouldnt-worry-traveling-u-s](https://www.wvxu.org/sports/2025-04-11/fifa-president-soccer-fans-shouldnt-worry-traveling-u-s)\n\nYou know there is a big problem when the FIFA President has to address possible concerns about foreign football fans visiting the US for the Club World Cup. (International tourism to the US has decreased by about 20% since a certain person retook the White House.)\n\nThoughts?",
    "score": 8,
    "url": "",
    "created_utc": 1744400266.0,
    "author": "euro60"
  },
  {
    "title": "Details of the new series of Welcome to Wrexham revealed: premieres 15 May",
    "body": "",
    "score": 5,
    "url": "",
    "created_utc": 1744532366.0,
    "author": "mrjohnnymac18"
  },
  {
    "title": "Are Southampton the worst Premier League team in history? Our writers have their say",
    "body": "",
    "score": 6,
    "url": "",
    "created_utc": 1744060295.0,
    "author": "Sparrow-Radiance"
  },
  {
    "title": "Comparing fans votes for player of the season to on-field performance ratings",
    "body": "The just-for-fun player of the season polls (https://pickonefromtwo.com/groups/pots ) are showing some interesting results, especially when compared to leading on pitch performance ratings for the season:\n\nAston Villa - Tielemans has a comfortable lead, consistent with his average performance rating on the likes of FotMob.  Rogers in second place is also consistent but then we see Konsa and Martinez outperforming their FotMob ratings, while Digne can feel a little hard done by that his performances on the pitch don't appear to be translating into player of the season votes: https://pickonefromtwo.com/groups/pots/categories/villa\n\nNewcastle - 5 man of the match awards, a player of the month award and thus it's no surprise Isak leads.  Behind Isak, Tonali in second place compares very favourably to his performance rating which shows him as the 8th highest performer, while Anthony Gordon reports the second highest performance score but only comes in 9th in the fans vote for player of the season.  Add your vote here: https://pickonefromtwo.com/groups/pots/categories/nufc\n\nForest - Milenkovic leads the fans vote but only scores 9th on the on-field performance ratings.  Meanwhile Hudson-Odoi currently leads on the on-field rating but scores only 10th in the fans voting.  Similarly Eliott Anderson scores 3rd on field but places only 8th with fans.  Mind you, with a huge 9 players averaging over 7 out of 10 for on-field performances, there are a lot of outstanding options to choose from for Forest fans!  Add your vote:  https://pickonefromtwo.com/groups/pots/categories/forest\n\nBrighton - Joao Pedro, Mitoma, and Minteh make up three of the top four onfield performers (together with Baleba) so it's not suprise that they make up 3 of the fans top 5 as well.  The others, Danny Welbeck (3rd with fans, 7th on-field) and the surprise current leader of the fans vote... Jan Paul van Hecke - currently 8th on the on-field rating but top of the fans voting.  Add your vote: https://pickonefromtwo.com/groups/pots/categories/brighton\n\nEverton - Everton fans know their stuff.  Pickford is number one on the pitch and with fans player of the season vote.  Ndiaye scores 2nd on pitch and 3rd with fans, just behind Gueye, who is 4th on pitch.  Once Tarkowski and Branthwaite are included, the top 5 on pitch ratings are the top 5 in fans player of the season vote.  Add yours here: https://pickonefromtwo.com/groups/pots/categories/everton\n\nWest Ham - 3 of the hammers fans top 4 player of the season vote recipients are also the three best players on pitch (Wan Bissaka, Bowen, and Soucek).  The exception is Kilman, who is second with fans but only 5th on-field.  Notably, Wan Bissaka has won every matchup he has appeared in for a 100% vote record.  Add your vote here: https://pickonefromtwo.com/groups/pots/categories/whu\n\nBrentford - Another club with an outstanding group of performers this season and the top 6 on-field performers are also the top 6 with fans votes, however while Mbuemo leads Damsgaard on pitch, it's Damsgaard who currently tops the fans votes for player of the season.  Fans also rate Collins higher than his on pitch performances would score him, but there's very little to pick between the top 6.  Add your vote at: \nhttps://pickonefromtwo.com/groups/pots/categories/brentford\n\nAnd just for fun, some non-other 14 clubs:\n\nArsenal - Gabriel leads the fans vote for player of the season, but scores only 6th for on-field performances.  Similarly Raya, who scores second with fans, is only 5th on-field.  The on-field strongest performer is Saka, who is only 5th with fans, while the second highest performing on-field Partey is only 9th with fans.  Some very strange results from Arsenal fans, it must be the ball... ;-) Add your vote: https://pickonefromtwo.com/groups/pots/categories/arsenal\n\nLiverpool - would it shock you if I said Salah wasn't the fans player of the season...? No, because you'd know I was lying.  He's the clear leader, in on-pitch performances and fans votes.  In second place on the pitch it's Trent, who scores only 8th in the fans votes, perhaps coloured by the ongoing rumours of a move to Madrid impacting fans views.  Second favourite with fans is Mac Allister, who scores 5th on-field - behind Gravenberch who fans score 8th, and Diaz who doesn't make the fans top 10 despite a 4th top on-field rating.  Vote here: https://pickonefromtwo.com/groups/pots/categories/liverpool\n\nManchester United - according to the Man U fans who flood my mentions with complaints about this season, none of them deserve a mention.  If you're a suffering Man U fan and a masochist, here's your poll: https://pickonefromtwo.com/groups/pots/categories/man-utd",
    "score": 6,
    "url": "",
    "created_utc": 1744489358.0,
    "author": "Pickonefromtwo"
  },
  {
    "title": "My proposal for Redditch United Third Kit",
    "body": "Based around their older kits, third kit features abstract orange-red/black geometric stripes with two-colour collar and cuffs. Redditch United's crest is in a orange-red/black colorway, while VX3's logo is black. The stripes continue on the back, with a white block to accommodate the numbers (not seen here but it is on the exploded view, which is too big to put here).",
    "score": 4,
    "url": "",
    "created_utc": 1744393304.0,
    "author": "ApexTheTraitor"
  },
  {
    "title": "Future health of the Top Leagues.",
    "body": "Do you think these leagues will be healthy in future? \n\nLa Liga under Tebas will not be competitive outside of Barca and Real. Most of the teams are so narrowed down with their spending. \n\nLigue 1 is struggling with TV deals. Wonder what next season will be like. Iconic clubs like Boardeux gone down the drain. I also heard that football in france is in decline??? And rubgy is on the rise? \n\nThe premiere league is like a big bubble... Some clubs spent so much money and are highly in debt. Also the things that go on with Man city's cases...... Chelseas mass spending etc.     (no hate for them) prems implementation of FPP and maybe future Regulator is also a big questionmark. \n\n",
    "score": 4,
    "url": "",
    "created_utc": 1744478294.0,
    "author": "The_mAnimal87"
  },
  {
    "title": "Peterborough United 1-2 Birmingham City: League One leaders seal promotion",
    "body": "",
    "score": 4,
    "url": "",
    "created_utc": 1744145025.0,
    "author": "DWJones28"
  },
  {
    "title": "Match Thread: Fulham FC vs Liverpool FC Live Score | Premier League | Apr 6, 2025",
    "body": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/football/comments/1jssii4)",
    "score": 4,
    "url": "",
    "created_utc": 1743940847.0,
    "author": "scoreboard-app"
  },
  {
    "title": "Dean Lewington (son of Ray) to retire aged 40, after 21 years at MK Dons",
    "body": "I know MK Dons are universally hated but this is very impressive. Ironically, his first season was with Wimbledon too and for older fans, he played alongside the likes of Jobi McAnuf, Reo Coker and Patrick Agyemang!",
    "score": 10,
    "url": "",
    "created_utc": 1744535423.0,
    "author": "Flat-Thought-9815"
  },
  {
    "title": "My ‘wonderkid’ list for the next five-ish years",
    "body": "Defenders: \n\nFellipe Jack - Como\n\nJeremy Jaquet - Rennes\n\n\nMidfielders: \n\nMateusz Szczepaniak - Legia Warsaw\n\n\nAttackers:\n\nChizaram Ezenwata - Chelsea Academy\n\nMikkel Bro - Bodo/Glimt\n\nFer Lopez - Celta Vigo\n\nSuggest more pls in replies",
    "score": 4,
    "url": "",
    "created_utc": 1744528400.0,
    "author": "SexyAustralian"
  },
  {
    "title": "Semi-automated offside explained: Technology starts in Premier League this weekend",
    "body": "",
    "score": 4,
    "url": "",
    "created_utc": 1744372604.0,
    "author": "DWJones28"
  },
  {
    "title": "/r/Football Weekly Discussion Thread",
    "body": "**Welcome to the Weekly Discussion Thread!** \n\nWhether you're here to chat about the latest match results, transfer rumors, or anything football-related, this is the place to be. Feel free to share your thoughts, predictions, and any interesting news that caught your eye this week.",
    "score": 3,
    "url": "",
    "created_utc": 1744059690.0,
    "author": "AutoModerator"
  },
  {
    "title": "u/CIRIL10 – Third Kit Design Submission",
    "body": "Hi everyone!  \nI'm excited to share my design for Redditch United FC's third kit.\n\n🔶 **Concept:**  \nA celebration of Reddit's community spirit and the club's bold identity.\n\n🔸 **Design highlights:**\n\n* **Orange-red to black gradient** as the base, reflecting energy and strength.\n* **Upvote &amp; downvote pattern** subtly integrated into the lower half of the shirt as a tribute to Reddit.\n* **Pixelated sleeve texture**, hinting at Reddit's digital nature.\n* **Clean white detailing** for contrast and clarity.\n\nThanks for the opportunity — I had a blast designing this! Would love to hear what the community thinks.",
    "score": 2,
    "url": "",
    "created_utc": 1744392526.0,
    "author": "ciril10"
  },
  {
    "title": "Premier League: 10 talking points from the weekend’s action | Premier League",
    "body": "",
    "score": 1,
    "url": "",
    "created_utc": 1744052069.0,
    "author": "Artistic_Strength_18"
  },
  {
    "title": "Premier League lacks technicality as compared to other leagues: Hoax or a Fact?",
    "body": "Hello everyone, I have started watching football recently (please ignore the name appearing on my profile) and I have heard many viewers say that EPL has a lot of competition and unpredictability but does not possess the same level of technicality as other leagues. Guys, I want to have a genuine discussion about it. Is it really a fact or just a lie? I am willing to continue my research on it if you can give me a start. Personally, in my experience, I found PL games to be a bit quick-paced and physical and in other leagues, I found that the game is smoother and has attractive passes. Please share your opinions.",
    "score": 0,
    "url": "",
    "created_utc": 1744198979.0,
    "author": "Real_Madrid25"
  },
  {
    "title": "VAR decisions: are we overanalyzing every call?",
    "body": "So, every match now feels like a 5-minute highlight reel of VAR reviews. Don't get me wrong, it's cool that we're getting the calls right, but sometimes I miss the days when we just yelled at the TV and moved on. Anyone else feel like the magic is getting sucked out of the game with all these stoppages?​",
    "score": 0,
    "url": "",
    "created_utc": 1744020839.0,
    "author": "RadiantCrystalWhisp"
  },
  {
    "title": "Redditch United Third Kit Entry 2025/2026",
    "body": "",
    "score": 0,
    "url": "",
    "created_utc": 1744488557.0,
    "author": "dimspace"
  },
  {
    "title": "Question - What rule changes or clarifications would make the game more fan-friendly?",
    "body": "I've got two ideas.  I'd be keen to hear other thoughts on these, or hear anyone else's ideas.  Both of my ideas have to do with making life a little harder for defensive players and giving subtle advantages to attacking players, to bring about more goals and goal scoring opportunities.\n\nIdea 1- defensive player has to play the ball, not the man.  It often happens where a defensive player will \"shepherd\" a ball out of bounds by obstructing the attacking player from keeping the ball in play.  The legality of this makes no sense!  Defensive players can't shield a ball unless they take possession of it!\n\nIdea 2 - Offsides, very close calls always favor the attacking player.  In an era of VAR this can be defined very easily, unlike before VAR.  Why not give attacking players an extra 8-10 inches or even a foot advantage and \"head start?\"",
    "score": 0,
    "url": "",
    "created_utc": 1744473601.0,
    "author": "Inevitable_Medium667"
  },
  {
    "title": "Barça quietly building one of the greatest UCL campaigns ever",
    "body": "",
    "score": 0,
    "url": "",
    "created_utc": 1744269499.0,
    "author": "tylerthe-theatre"
  },
  {
    "title": "Should the offside rule be changed?",
    "body": "I think the offside rule is fine overall but could use some tweaking. Marginal offsides with VAR can feel too harsh. Giving attackers a bit more leeway might lead to more goals without ruining the game. Removing it entirely would make things chaotic, though.",
    "score": 0,
    "url": "",
    "created_utc": 1744186189.0,
    "author": "Strict-Signature9475"
  },
  {
    "title": "The neymar disrespect is getting out of hand",
    "body": "1.\nThe Neymar disrespect is OUT OF CONTROL.\nhe’s one of the most disrespected world-class players ever—\nAnd why the numbers, trophies, and performances prove he’s a generational baller.\n\n2.\nPeople act like Neymar’s career is a flop just because he didn’t win a Ballon d’Or.\nBut the truth?\nHe’s had a better career than 99% of players in history.\nLet’s start with the numbers:\n\n3.\n\t•\t449 goals\n\t•\t256 assists\n\t•\t705 G/A in 638 games\nThat’s more G/A than games.\nInsane efficiency.\nEven with all the injuries, Neymar’s output has been world class across 3 continents.\n\n4.\nHe’s Brazil’s all-time leading goalscorer with 79 goals—more than Pelé.\nHe’s also 3rd in all-time Brazil assists behind Pelé and Ronaldinho.\nAnd still counting.\n\n5.\nChampions League Neymar:\n\t•\t41 goals\n\t•\t28 assists\n\t•\t69 G/A in 81 games\n\nThat’s a goal contribution every 75 minutes.\nAnd he led the UCL in assists 3 different seasons.\n\n6.\nNeymar is 1 of just 3 players in football HISTORY with:\n\t•\t100+ goals for 2 clubs (Barça &amp; PSG)\n\t•\t20+ UCL goals for 2 clubs\nThe others? Messi &amp; Ronaldo.\n\n7.\nTrophies?\nHe’s got 26:\n\t•\tUCL\n\t•\tCopa Libertadores\n\t•\tLa Liga x2\n\t•\tLigue 1 x5\n\t•\tCopa del Rey x3\n\t•\tFrench Cups x3\n\t•\tOlympic Gold\n\t•\tConfederations Cup\nElite versatility—he’s conquered every continent he’s played on.\n\n8.\nNeymar in finals:\n\t•\t17 goals + assists in 20 major finals.\nThe man shows up in big games.\n\n9.\n2014-2017 Neymar at Barça is one of the best peaks in football:\n\t•\t105 goals\n\t•\t76 assists\n\t•\t181 G/A in 186 games\nPart of the deadliest trio ever: MSN (Messi-Suárez-Neymar) with 364 goals in 3 seasons.\n\n10.\n2017 vs PSG (6–1):\n\t•\tNeymar scored 2, assisted 1, drew the penalty, and hit a 9.6/10 match rating.\nThat’s one of the best UCL performances ever.\nAnd still doesn’t get the flowers.\n\n11.\nPeople hate Neymar because:\n\t•\tHe left Barça\n\t•\tHe has flair\n\t•\tHe doesn’t play the “media game”\n\t•\tAnd yes, because he dives sometimes—like most attackers do.\n\nBut NONE of that changes the facts:\nHe’s a once-in-a-generation talent.\n\n12.\nFootball will miss Neymar when he’s gone.\nThe flair. The joy. The sauce. The creativity.\nWhen he’s on it, he plays like he’s from another planet.\n\nGive the man his respect. Before it’s too late",
    "score": 0,
    "url": "",
    "created_utc": 1744162941.0,
    "author": "Electronic_Oven_1443"
  }
]