[
  {
    "title": "Why I Couldn't Meditate for Years",
    "body": "My husband is a secular Buddhist and has always been a regular meditator, since long before I knew him. He saw the issues I was dealing with - anxiety, depression, and strongly recommended to me over and over that I start meditating.\n\nAt first I wrote it off as woo-woo bs (not a very respectful attitude to my husband there!), but then I read the science and became convinced that yes, in fact, it was a real thing that could help, so I agreed to try it, all the while deep down with the certainty that even if it helped others, it couldn't possibly help me.\n\nI sat for 10-20 minutes a day, focusing on my breathing and noticing but not engaging with my thoughts. The first couple days were actually pretty nice! That second day of meditation, I felt enormous bliss, and to date, that's the only time I've ever experienced that while meditating!\n\nBut then something peculiar began to happen: I started to become angry while meditating. At first it was mild, just irritation or annoyance. But it grew each day, until I'd exit my meditation sessions in a full-on rage, my pulse pounding, my face hot, my mood shattered. I told my husband, \"I just can't do this anymore, it's making me too angry. I have to stop.\"\n\nHe was baffled -- he'd never heard of meditation making anyone angry before, but agreed that it clearly was not helping me and thanked me for at least giving it a try.\n\nYears passed. One day, not too long ago, I decided to really work on the issue of my self-loathing, and, assisted by a psychedelic substance, I descended into the depths of my own mind, and in that exploration discovered that it was full of voices shouting hateful things at me non-stop. Voices I'd learned, voices I'd internalized, voices that I'd thought were my own. And then I saw that they weren't my voices at all, that they weren't *me*. No, there I was beyond them, a pure and bright light of existence, continually hounded and bullied by all this cruelty. And it broke my heart, because for the first time in *decades*, I saw someone worthy of love.\n\nI didn't start meditating again right away (though it occurred to me that I should try), but when I did, all that anger was gone. Depression is rage turned inward. When I was meditating, I had been putting myself into isolation with the person I hated more than anything in the world. And I had been putting myself into isolation with the person who was being more cruel to me than anyone else ever could be.\n\nI don't know, now, if continued meditation could have led me to those insights on its own, if I'd possessed the fortitude to stick with it. But for those of you out there who might be struggling with the same thing, I want you to know that *you can heal*. I fully believed that my self-hatred was something that would always be a part of me. That I would live with it until the day I died. But it's gone, and I'm so much lighter. There are times when the voices come back, when they start being cruel to me again. But they're so much easier to dismiss now, because I know that they're false.\n\nNo matter how deep your scars go, know this: *you can heal.*",
    "score": 422,
    "url": "",
    "created_utc": 1744303112.0,
    "author": "Ottagon"
  },
  {
    "title": "Is there a subreddit for \"science-based\" meditation, i.e., without the New Age content?",
    "body": "I don't want to knock anyone else's beliefs or experiences. You do you.\n\n\nBut I just joined this sub recently and most of the posts seem to be people who want an explanation for why they saw aliens while meditating and that's just not what I want to learn about. I'm more interested in meditation techniques, wellness, mental health, etc.\n\nJust looking for sub recs, thanks!\n\nEdit: thanks for all the responses. People seem to be really focusing on the \"science-based\" in the post title. I don't care that much about peer-reviewed research here. I'm just into meditation for the personal / mental benefits and not so much the spirituality.",
    "score": 384,
    "url": "",
    "created_utc": 1743950915.0,
    "author": "420goonsquad420"
  },
  {
    "title": "Meditation makes me so happy I don't feel like doing other things!",
    "body": "I started meditation half a year ago. 10-20 minutes every morning. It has thoroughly changed my life. But I have become so relxed! I am currently unemployed and have to finish some work from the past. But I wake up in the morning, I meditate and feel life in my veins and the sun is shining and I feel so much full of joy and trust that things will be alright that some days I don't do the things I have to do to finish my past work and get a new job. I just want to love life and others and enjoy it! Had anyone else experienced this? Is that OK? Should I keep trusting that when the time comes, I'll get more active again? Or should I push myself harder to get things done? Or perhaps a combination of both?",
    "score": 180,
    "url": "",
    "created_utc": 1744101068.0,
    "author": "Low_Intention7780"
  },
  {
    "title": "Meditation should really be used as medication",
    "body": "I’m someone who has struggled with my mental health. I’m going for regular check-ups with a psychiatrist. I talk about how I have my yoga/meditation routine of 3 hours everyday. My doctor recognises that this is something that keeps me balanced and encourages me to keep doing it. \n\nThese practices I have learned make all the difference for me. It doesn’t matter how I feel, when I do my routine I will be fine. \n\nSo why do they not teach some form of simply meditative exercises as medication for mental health issues? ",
    "score": 174,
    "url": "",
    "created_utc": 1744203756.0,
    "author": "Euphoric-Welder5889"
  },
  {
    "title": "After three weeks in, my skepticism is shattered",
    "body": "I know, I know, no time at all. Three weeks is certainly not enough time to see big changes.\n\nExcept my husband claims he already notices big shifts in how I approach stresses and emotional situations. And then there's two really big things.\n\n1) Last week, I was falsely accused of a crime and dragged off to the county jail. I spent the night in jail with a lot of big emotions. Fear over what might happen to me. Anxiety over whether I could possibly clear all this up and get back to my life. Remorse over the dumb (but not criminal) mistake that led to the situation. Anger at the person who had done this to me out of spite. Weariness as the night crawled on and I was still provided no bed, shivering from the cold in the cell as I hadn't had a jacket when I was arrested. And then the sheer tedium of hour after hour passing with nothing happening. So, since I had nothing, I meditated. I'm not sure how I would have made it through that night without it. All the adrenaline and weariness and emotion was allowed to fade into the background, to rush past me like a river. Instead of having panic attacks, I found moments of peace and reflection.\n\n2) Last weekend, I was sitting around feeling fine and then my brain (as it dearly loves to do) oh so helpfully summoned a cringe moment -- something from my past that I feel a physical pain in my gut in remembering. And then I thought, \"Man, nobody else remembers this moment but you. You're the only one keeping it alive, and you're only doing it to hurt yourself. You should just forget it.\" And then, somehow, *I forgot it.* It just fell out of my head and I didn't remember what it was. I *still* don't! I reckon that I could, if I really tried, scrape the memory out of my brain if I wanted to, but *why would I try?* Folks, I had no idea it was even possible to just *decide* to forget something when it's hurting you. But... here we are.\n\nI have long been a meditation skeptic. I believe in the science behind it, I believe that it helps others, but I'd always felt that I would somehow be an exception, that even if others benefit, I would never be able to.\n\nAfter this last week, though, my skepticism is shaken. All of this could be just placebo effect, of course. It could be just all in my head (I know, I know). But a little bit, I kind of feel like I have super-powers all of a sudden.",
    "score": 154,
    "url": "",
    "created_utc": 1744044185.0,
    "author": "Ottagon"
  },
  {
    "title": "This Will make you Grounded and Calm.",
    "body": "I'm not sure if anybody else has heard about this, but it **works**.\n\nI discovered this process accidentally. Here's the story:  \nOne day, I was getting influenced by this girl I was about to date. I dated her, and I felt super anxious. The next day, while getting ready for our second date, I suddenly thought—**why the fuck am I allowing myself to change for a girl  ?** So I just threw away all the pressure and anticipation. I detached from her completely and let go of all expectations.\n\nBasically, I stopped giving a fuck—by literally throwing away all my interest in her.  \n\\*\\*And boom—\\*\\*that worked.  \nI was myself. Calm. and charming.\n\nAfter that day, I thought—*what if I start applying this to all of my stresses too ? ?*  \nSo I began throwing away all of life’s stresses from my mind. I would visualize the stress building up in my head (visualise people who gave me stress, money stress , relationships stress  etc) and then blow em away—kind of like shooting it off into the dark using the muscles behind my eyes.\n\n**And it started working.**  \nIt made me calm. Way less anxious. More empathetic. More centered.  \nBut then I stopped doing it—because I thought I was becoming *too* calm.\n\nLater, I tried all kinds of meditations—focused and unfocused—like ZEN, TM, mantra meditation, mindfulness, etc.  \nThey gave me some relief, but nothing worked as quickly or as deeply as the technique I discovered on my own.\n\n**Has anyone else tried something like this?**  \nOr ever experienced anything similar?\n\n  \nNOTE: please make sure to tilt UP your eye ball (not head) a little bit,  while doing this process.",
    "score": 149,
    "url": "",
    "created_utc": 1744177714.0,
    "author": "Top_Ring_2294"
  },
  {
    "title": "Simple tricks you know to free the mind in an instant",
    "body": "Been getting trouble to relax cause of so many things happening at once lately. If you can help, I appreciate it. ",
    "score": 141,
    "url": "",
    "created_utc": 1744392408.0,
    "author": "wrd43"
  },
  {
    "title": "First time experiencing timelessness during meditation — lost 2 hours without realizing",
    "body": "My husband and I recently attended a meditation event called Ecstasy of Enlightenment. We started the session at 1 PM with Shambhavi Mahamudra Kriya (about 21 minutes), followed by a talk from Sadhguru, and then a guided meditation.\n\nI figured the meditation must’ve lasted around 30 minutes, maybe an hour at most. It felt incredibly peaceful — like my body disappeared and my mind entered a still, calm state. It was honestly the most serene I’ve ever felt.\n\nWhen we were told to open our eyes and take a break for lunch, I checked the time... and it was 5 PM. I was completely stunned. I thought it was maybe 3 PM. Somehow, two hours just vanished.\n\nI asked my husband and he said the same — his body felt like it disappeared too, though his mind stayed alert. He also couldn’t believe how much time had passed.\n\nThis was my first experience of such deep timelessness in meditation. I’ve read about it before, but actually living it was something else entirely.\n\nHas anyone here experienced this kind of time distortion during practice? Would love to hear your thoughts or similar stories.\n\nHow can I experience this again ? Is it possible only in the presence of a Guru ?",
    "score": 119,
    "url": "",
    "created_utc": 1744301549.0,
    "author": "EverythingIzzNothing"
  },
  {
    "title": "What was your most Woo-Woo experience",
    "body": "As the title says, what's your most woo-woo experience from your meditation practice so far? \n\nI know many people in here have their reasons for not wanting to consider this side of stuff and that's fully understandable, for me though I find this side of stuff ridiculously fascinating, as do many others. \n\nPersonally I've had many interesting experiences during meditation, activating my Crown Chakra in a Kundalini rising (accidentally), physically pushed/pulled from what feels like external forces, given information and advice, OBE (again accidental). \n\nSo, now I'm interested in what others are experiencing along the more spiritual side of things.\n\nWhat is your most profound Woo-Woo experience during meditation?",
    "score": 90,
    "url": "",
    "created_utc": 1743970094.0,
    "author": "redditcensoredmeyup"
  },
  {
    "title": "Meditation makes me feel stoned",
    "body": "Does anyone else experience that meditation makes you feel kind of high? \n\nI especially feel high after doing a practice I learned called “Shambhavi Mahamudra Kriya”. Some research was done on this practice stating that it stimulates the cannabinoid receptors in the brain. But even if I just meditate on my breath or do yoga it sometimes feels as if I smoked something. \n\nAm I alone in feeling like this? ",
    "score": 86,
    "url": "",
    "created_utc": 1744369094.0,
    "author": "Euphoric-Welder5889"
  },
  {
    "title": "How I Learned to Let Bad Thoughts Die",
    "body": "There’s a mindfulness technique I’ve been practicing that’s rooted in a simple but powerful idea:\n\n**Reacting to a negative thought is like watering a plant.**\n\nEvery plant carries seeds, and when you water it, it grows—and eventually those seeds turn into more plants.\n\nIn the same way, when you react to a negative thought, you give it energy. That reaction leads to more negative thoughts, and those give rise to even more.\n\nSo what's the solution?\n\n**Stop watering the plants you don’t want growing.**\n\nLet the negative thoughts pass without feeding them with attention. Over time, they lose their power.\n\nI’ve been practicing this for the past 6 months, and life feels noticeably lighter. There's more space, more peace.\n\nIf you’re feeling stuck in your head or weighed down by thoughts, I’d be happy to share more or just talk it through.",
    "score": 86,
    "url": "",
    "created_utc": 1744523917.0,
    "author": "Organic_Bite1569"
  },
  {
    "title": "Suffering will withdraw you from experience if you let it. Acceptance is the only way.",
    "body": "One of the reasons I started meditating was because I was severely depressed and felt numb most of the time. I ate because it was time to eat, not because I was hungry; I slept because it was time to sleep, not because I was sleepy; and I went to work because it was time to work, not because I wanted to. Life felt so meaningless that, honestly, I thought it was better to feel pain than to feel nothing at all. I wanted to sleep all day just so I didn’t have to experience such a bland life. Around this time, I discovered meditation, and it’s been 11 years—I’ve meditated every single day since.\n\nAs I turned my attention more toward my inner self, I learned that one of the reasons I was so numb (I later learned this condition is called anhedonia) was because the pain I had experienced in life had slowly led me to cut myself off from my emotions. You become what you practice, and over time, I had conditioned myself to distract from or ignore the pain—and I had gotten really good at it. So good that I could take a punch in the face and not flinch one bit.\n\nBut if you can’t feel the pain, you can’t feel the joy either. The very delicate soul in me that I had extinguished is the very soul that makes life enjoyable. With time, I’ve learned to accept both the ups and downs of life. I try to embrace pain as much as I embrace joy. These days, almost all of the meditation I do involves observing and accepting my inner emotions and feelings more than anything else. And I find that I’m slowly getting in touch with experience again—and life is changing from black and white to full of color.",
    "score": 68,
    "url": "",
    "created_utc": 1744012376.0,
    "author": "parsimonious-panda"
  },
  {
    "title": "Finally I could observe my thinking",
    "body": "For the first time ever, today , finally managed to think and observe. Until now the awareness when spotted any thoughts it dissolve them right away so for a lot of times I didn’t even knew exactly what I was thinking about because right after the thoughts popped in the awareness dissolved them.\n\nToday while meditating I was able to just let the thought play out and also be aware of it . Something interesting happened. The thoughts somehow lost their colours so to speak , they weren’t so interesting in not absorbing like before.\n\nThey were coming and going like a train station and I could notice that is someone always there.\nToday I comprehended this not only intellectually but felt it . It was a soubtle feeling that I hope I’ll take it with me from now on.\n\nJust wanted to share this with you and also invite you to give any insight and keep an open Chanel of communication 🙏",
    "score": 60,
    "url": "",
    "created_utc": 1744172902.0,
    "author": "Altruistic_guy777"
  },
  {
    "title": "Why do people meditate?",
    "body": "I’ve been meditating every morning for half a year now. Eye mask on, noise-canceling on, no distractions whatsoever. Focus on body, then when examined everything focus on breath, 10–20 minutes.\n\nI didn’t expect instant enlightenment or anything, but honestly… I don’t feel any real difference.\n\nPeople say it helps with focus, stress, emotional regulation, sleep, whatever. I’ve stuck with it, hoping I’d eventually feel something shift, but nope, not a single change in my life, I can't feel any difference.\n\nSame thoughts, same performance, same me. It just feels like sitting there being annoyed with myself (contemplating and accepting it nevertheless) doing this ridiculously long operation doing nothing for no gain.\n\nI want to find some motivation or quit it if none found, so I'm genuinely curious: \n\nWhy do you meditate? What do you get out of it that makes it worth sticking with? And if you used to meditate and quit—why? Is this a “works for some, not for others” kind of thing?",
    "score": 55,
    "url": "",
    "created_utc": 1743938797.0,
    "author": "EDCEGACE"
  },
  {
    "title": "Who are some Scandal free meditation masters?",
    "body": "I am into meditation but have always been wary of the guru... so many who teach great wisdom are revealed to have done terrible things. Who are some wonderful teachers who have appear free of misdeeds with money, sexual harrassment, etc who you trust? Thank you!",
    "score": 51,
    "url": "",
    "created_utc": 1744389113.0,
    "author": "Free_Answered"
  },
  {
    "title": "I went to the mountains without my phone for a week! (As a chronic phone user)",
    "body": "After being in a rot for weeks and using my phone as much as humanly possible (which reached an average of 10 hours a day) i got the opportunity to live in a hotel in the mountains for a week, and i immediately got the idea to leave my phone at home for the entire time.\n\nMy sister was also with me so i could afford not having a smartphone with me, but i did take a dumbphone so i could call.\n\nthe first few days were definitely the hardest, my attention was constantly switching from one thing to another, doing one thing for longer than 10 minutes felt hard, i would meditate for a few minutes, then read for 10, then get sick of everything and just lay down looking at the ceiling until I inevitably went back to reading or doing something else. \n\nAll that happened in winter so going for long hikes wasn't an option, my sister would go skiing everyday while i stayed inside the hotel most of the days.\n\nBefore the trip i expected that i would have a ton of energy and enthusiasm to do all the healthy things that i didn't do for so long, but to my surprise I barely had any energy and was moody most of the time. \n\nOn the last days though i noticed some changes. I could now do any given activity for longer without feeling sick of it, i became more social and open to the people around me which led to conversations with the guests of the hotel and people on the street. \n\nOn the deeper side of things, i felt bad for my family and friends that i had neglected because of my addiction, not having millions of potential people to talk to on your phone really makes you turn back to the people who are actually in your life. \n\n**in conclusion**\nThis experience really taught me just how important it is to be alone with your thoughts, without having them constantly being manipulated and manufactured by whatever i am consuming, it taught me to not take the people around me for granted, to show love and kindness instead of hoping that they somehow know it without me showing it. And most importantly it showed me just how attached i became to technology, that even living without it for just one week was a \"challenge\"\n\n\nSorry if this is all hard to read and fillled with linguistics mistakes, English is not my native language. Thanks for reading!\n\nI know there is not a lot that has to do with meditation here but I thought with mental clarity being the goal of the story it could be useful to someone hopefully. \n\n\n",
    "score": 47,
    "url": "",
    "created_utc": 1744312101.0,
    "author": "Such-Aerie-5317"
  },
  {
    "title": "Have you read the book Man's Search For Meaning by Viktor E. Frankl?",
    "body": "\n\n\n\nWhat did you think of it?\n\n\n\nDid you learn anything from it?\n\n\n\nDid you feel inspired?\n\n\n\nWhich part of the text did you like the most?",
    "score": 41,
    "url": "",
    "created_utc": 1744220006.0,
    "author": "SAIZOHANZO"
  },
  {
    "title": "Healing myself through affirmations",
    "body": "Off late when I meditate, I have been asking certain body parts to heal. I have been sending them light energy and it’s actually working. I also express gratitude to those body parts for being part of my body. \n\nIs there anything else I can visualise or say? I am so surprised by the outcome. What type of meditation is this called (new to meditation)? ",
    "score": 42,
    "url": "",
    "created_utc": 1744354897.0,
    "author": "Ancient-Wisdom-101"
  },
  {
    "title": "Has anyone learned to change their inner state at will using just their mind",
    "body": "How do you do it, what results have you achieved, and what still doesn’t work for you",
    "score": 42,
    "url": "",
    "created_utc": 1744042051.0,
    "author": "Klutzy_Sky_7056"
  },
  {
    "title": "I find I have to constantly remind myself that I am the one who has to do the work.",
    "body": "My brain is always wanting to tell me. Oh those people need to be more present, mindful, awake, Buddhist. lol. The ones causing me distress are the ones who need to be present 😂 😂. It’s ridiculous how transparently wrong this fallacy is and yet it’s so engrained and so automatic that I find I have to still keep reminding myself over and over, yeah no I am the one who has to do “the work”. \n\nThis isn’t an argument to excuse other people being cruel or bullies, or abusive etc. I don’t believe in a world where we allow that. It’s just an argument that for myself I have to always remind myself the power to change things is only ever within myself and nowhere else. ",
    "score": 40,
    "url": "",
    "created_utc": 1744269132.0,
    "author": "eulersidentity1"
  },
  {
    "title": "The incredible experiences that happened during my 10-day Vipassana retreat",
    "body": "I came back not too long ago from my first Vipassana retreat and wanted to write some feedback on my experience. I think it is a very interesting read especially for beginners.\n\nTldr: I have experienced incredible things in such a small period of time. I was also extremely miserable about half the time or more. The retreat was extremely hard and painful, but extremely beneficial as well. I am forever grateful to the people who took care of me.\n\nPlease note that this is my own experience and yours will probably be very different.\n\n**Day 1**\n\nFeeling like shit. Missing my husband, my boyfriend, and the rest of my life. Crying a lot. Feeling incredibly lonely.\nNothing eventful to report.\n\nMood: Lonely and depressed.\n\n**Day 2**\n\nFeeling like shit still. Cried a lot again.\n\nI start to get light hallucinations when I close my eyes. These hallucinations will be there until the last day. I don't pay much attention to it, it's not different from taking a small dose of psychedelics or spending time in a sensory deprivation tank.\n\nMy focus is getting stronger and stronger. I can feel changes in my mental abilities. For example, I am able to listen to hundreds of different songs in my head. While I usually can play songs in my head, I am never able to do it with these levels of accuracy and clarity. It is almost exactly like listening to the real thing.\n\nI decide to listen to Smash Mouth's “All star” for the next three days, mostly for the meme.\n\nMood: Lonely and depressed.\n\n**Day 3**\n\nMy focus keeps getting stronger. My imagination is much more clear and powerful than usual.\n\nAt some point I am hit by an explosion of bliss. Everything is great, everything is good, the colors are literally more colourful. Frankly feels exactly like an LSD trip.\n\nMood: Blissful.\n\n**Day 4**\n\nBliss from yesterday subsided, but I don't feel horrible like on day 1 and 2.\n\nThis is Vipassana day. We are led to the Vipassana purification ritual.\n\n“It's only a body scan” I think to myself, disappointed that it's not a super-secret Sayan technique that will change my life.\n\nAs the body scan starts, I am immediately hit by maybe the worst pains I've felt in all my life. It's coming from EVERYWHERE. I wouldn't be surprised if my back hurt, but why do my hands hurt as well? My legs? My chest? How is that even possible?\n\nThe ritual lasts 2 hours. I cry a lot. When it's finally done I go to my room and cry some more. I do not cry because of the pain, I cry because I feel like a huge burden has been lifted from me.\n\nMy brain fixates on a loop on that scene in the first Lord of the Rings movie when Bilbo finally drops the ring and leaves, and you can see it was extremely hard to do so but then he feels immediately better. This is exactly what it felt like.\n\nMood: sad but relieved and grateful.\n\n**Day 5, 6, 7**\n\nMore Vipassana-body-scan.\nThe body scans are still painful, but exponentially less at each session. The crying also calms down.\n\nI think about my relationship with my boyfriend, which has been making me suffer for a while. I try to understand why. I think about everything that has made me suffer, I try to understand why.\n\nI confront my demons. My sankharas. I realise deep truths about myself. I now understand what my biggest fear is (if you're curious, it's Loneliness). I uproot all of those sankharas as much as I can.\n\nI work hard on equanimity.\n\nI am confronted with the Buddhist truths of “Life is suffering” and “Everything is impermanent” in my shower as the hot water suddenly runs out.\n\nMood: quite terrible.\n\n**Day 8**\n\nAt the end of Day 8, I am tired. Exhausted. I haven't slept correctly in a very long time, in no small part because I've been so damn hungry.\n\nThe food we are served in the morning is not nearly enough to sustain my large frame (I am a 93 kg hobbyist bodybuilder). My face looks emaciated (I lost a ton of weight during the retreat) and I've been just so hungry, which would not be so much of an issue if only it didn't mess up with my sleep so much.\n\nI've been sitting on the pillow for so damn long now, working extremely hard on Equanimity. I am exhausted, starved, and frankly done with this. You know what? Fuck Equanimity, it's not so important.\n\nAt the very exact moment when I decide that Equanimity is, in fact, not so important, I am hit by an incredibly powerfully strong feeling.\n\nI suddenly feel Perfect Equanimity.\n\nI think about my issues with my boyfriend. I don't care.\nI think about my issues at work. I don't care.\nI think about my unavoidable death. I don't care.\nI think about my body decaying as I grow old. I don't care.\n\nI don't care about anything in the slightest.\n\nI imagine someone proposing to me a line of cocaine. For the first time in my life, I have absolutely zero desire for the most addictive drug I've ever taken. I am Blissful. I am content. I am in the deepest inner peace I've ever known.\n\nI understand that I had been chasing Equanimity, craving it. This sankhara was like a dam blocking my progress. When the dam broke, the waters suddenly engulfed everything.\n\nI had read somewhere “Enlightenment is understanding the cosmic joke”. I never understood what it meant until today. I understand the cosmic joke.\n\nI know this won't last. It will probably be gone in a few hours. I don't care.\n\nI go to bed with a huge smile on my face.\n\nMood: incredibly blissful and equanimous.\n\n**Day 9**\n\nStill feeling blessed from the previous day, but not nearly as much. Still a difficult day.\n\nMood: not great. Happy the last day is tomorrow.\n\n**Day 10**\n\nAs soon as we are allowed to use phones, I call my husband and my boyfriend.\n\nI realized I craved talking to them. I am also anxious that everything went wrong while I was gone. I give in to the craving and call them.\n\nI realise after talking to them that even though I satisfied the craving, my relief is only temporary. This will be an important lesson.\n\nMood: excited to go home.\n\n**After the retreat**\n\nReturning to daily life has been stressful. I had a lot of things to manage as I got back, plus 10 days of absence to catch up on. I felt burnt out by the retreat and did not meditate for a week, then I started again.\n\nMy relationship with my boyfriend has been extremely good since I got back. I realised the person that was making me miserable in this relationship was myself. So I stopped doing that. The relationship has been great ever since.\n\nMy husband enjoys how cheerful I've been since I came back.\n\nI haven't been the same since the retreat. Day-8 experience didn't last, but it is clear to me that I've kept some of it with me.\n\nLife has been significantly happier, suffering has dramatically decreased. I feel a decent amount of equanimity most of the time.\n\nA lot of love for the organisers of the Vippassana retreat &amp; for all living beings 🙏",
    "score": 36,
    "url": "",
    "created_utc": 1744040104.0,
    "author": "autistic_cool_kid"
  },
  {
    "title": "Using tinnitus to my advantage",
    "body": "To preface: I am a novice meditator and am still working on consistency and finding what works for me. I've also had moderate tinnitus for years and have always viewed it at a curse. In part due to the ringing, I also struggle with focusing on my breath.\n\nThe other night, instead of trying to focus on my breath, I decided to bring awareness to the ringing itself. I found it much easier to maintain focus on the ringing sound and after a few minutes, noticed that it isn't inherently a bad sound like I've always believed.\n\nTinnitus can still be a pain, but I'm going to try using it to my advantage in meditation and wish everyone else dealing with something similar all the best!",
    "score": 36,
    "url": "",
    "created_utc": 1744384034.0,
    "author": "96as96"
  },
  {
    "title": "How meditation has helped me as a unintentional day trader",
    "body": "**Disclaimer:** Just because you meditate doesn't mean you will be a successful trader. Below is merely a personal anecdote. The statistics are real that most people fail irrespective of intelligence. What I am saying is that it is likely that mindfulness may be a key trait of a successful trader, insofar as it may be a key component to be successful in any complex endeavor.\n\nI've been unemployed for the past year and have not been able to find a job. Out of desperation, I turned to day trading to pay the bills. Ordinarily, the words \"desperation\" and \"day trading\" are a lethal combination and a fast way to lose all your money, because desperation makes you do desperately stupid things. I feel like I was able to navigate it better than had I been able to before I started meditating.\n\nThe deeper I go into trading, the more similarities I see between successful traders and meditation practitioners.  There are more, but here are some things I remember off the top of my head:\n\n\"The big secret is that there is no secret.\"\n\n\"Everything you want is on the other side of fear.\"\n\n\"You must surrender to the market.\"\n\nInterestingly, I also found a book called Trading Mindfully. It's actually a thing.\n\nThis past Friday, I was deeply thinking about, *\"Everything you want is on the other side of fear.\"* This spoke to me on a deep level. The below was my thought process yesterday as I was trading.\n\nWhen you are fearful, you are elsewhere. Not here focusing on the trade. You are not here. It is impossible for you to be in fear and also be here. Because right here, right now, you have a roof over your head, healthy, with loved ones and you are fine. Everything is ok. Then why do you feel fear? Because you are not here. If you are not here, then you cannot make the rationale decision based on information right in front of your eyes, right now, right here. So be here. So be here.\n\nDo I think that the person who originally said those words was necessarily a meditator? Maybe, but also maybe not. I think it was a realization that the person had while trading, which is the same realization that meditators have (that you must be here) and if the trader was indeed a meditator, then that person would also have connected the dots.\n\nThen again, maybe I posted something obvious LOL. But in this space (both meditation and trading), I don't know what's obvious and not obvious.",
    "score": 34,
    "url": "",
    "created_utc": 1743955923.0,
    "author": "celeryisslavery"
  },
  {
    "title": "Every morning I(20F) wake up scared and sad and I don’t know why",
    "body": "Hi so il keep this short cause there isn’t much to say. \n\nI haven’t always been like this but in the last few months every morning I wake up and I there is a pit in my stomach and a weight on my chest and it feels hard to breath without crying. I just wake up with this intense feeling of fear and dread. \n\nI feel this way every morning from the second I am awake to a few hours proceeding, sometimes the whole day depending on how bad it is.  I don’t know why or how to get rid of it. ",
    "score": 31,
    "url": "",
    "created_utc": 1744117107.0,
    "author": "pizzaparty_789"
  },
  {
    "title": "I don't hate meditation. I just hate how most people guide them.",
    "body": "Hi, I just recently got into guided meditation. I always hated meditating, but I realized I just hate how most people guide it. I don't know, it often feels so forced and uninviting? I have a lot of resistance against someone telling me what to do, so, that pops up a lot. So, maybe, if someone reads this and they think, they hate it too, try out many different people. I hate people being matter of fact, I love them speaking kinda ethereal (unexpected). I don't like them going too slow. Just really try many different ones. ",
    "score": 29,
    "url": "",
    "created_utc": 1744492850.0,
    "author": "Different-Pie-160"
  },
  {
    "title": "Body scanning is a very great tool to ease anxiety.",
    "body": "For the ones who are very anxious like me, body scanning temporarily shifts attention from worries and thoughts to other parts of the body. \n\nWith heavy social media use, with too much fight and flight mode, our minds have habitually become unnecessarily very alert. Our mental formations and physical formations turned unwholesome. There is too much stiffness in the muscles and especially the brain. \n\nThis body scanning - aka the rotation of consciousness dissolves the perceptions we have formed. It separates the concepts of mind and body.  It teaches the brain that it is ok to relax and to slow down.",
    "score": 26,
    "url": "",
    "created_utc": 1744027961.0,
    "author": "nk127"
  },
  {
    "title": "I discovered a place within myself where I always feel safe and loving",
    "body": "During New Year’s Eve I broke up with my girlfriend. It felt like a Dementor sucked all the life out of me and left me for dead. \n\nDepleted, griefing and full of anxiety I learnt that my pelvic floor was blocked. According to the chakras this is the place where your feeling of safety and grounded is. \n\nIn order to feel just a little bit better I started do 15 minutes of connected breathing through my nose twice a day, while focusing on this area. Often following up with a Joe Dispenza meditation. \n\nDuring a long car ride with a very annoying person, I placed my awareness on my pelvic floor. And by surprise I noticed that the whole ride didn’t take any energy from me. Normally these kind of conversations cost me a lot of energy. Now I stayed so close to myself I remained calm. \n\nMore and more often I can rest my awareness in my pelvic floor even while doing something else. It feels like I discovered a new place in my body where I feel safe, grounded and at peace. \n\nEven when I don’t know what to do or say, resting my awareness gives me new insights. I feel there’s energy there and most of the time I feel it rise to the crown of my head giving me absolute chills and smiles. \n\nI feel like I’m making progress. \n\nPs. If you want me to explain more about what I do exactly send me a DM and I’ll make a video for you. ",
    "score": 22,
    "url": "",
    "created_utc": 1744373512.0,
    "author": "sjoooors"
  },
  {
    "title": "How much can I meditate in a single day?",
    "body": "Hi everyone,\n\nThis is my first post on here. I bought Shinzen Young's: \"The science of Enlightenment\" a few days ago and as I've been reading through it, I've been inspired to start meditating. I've downloaded an app and I've completed the two starter sessions and was wondering how many I should limit myself as I'm quite excited to start my journey.\n\nPeace.",
    "score": 18,
    "url": "",
    "created_utc": 1744143257.0,
    "author": "BritishSocDem"
  },
  {
    "title": "My Body Dropped Away Today",
    "body": "I've been meditating quite regularly for about two decades now. I was sitting in the sun today in a chair, with the sun behind my eyelids, and I tried imagining my legs bending backwards and my toes in my eyes, like I was a little ball. I also imagined my arms swinging around wildly, and I began to lose the feeling of my body. And then it happened, my body dropped. My mind was active and alert, but I couldn't feel my body. I don't want to toot my own horn but I might have entered the first jhana.\n\nKeep meditating folks. It will pay off, way more than chasing after this or that.\n\nCheers!",
    "score": 20,
    "url": "",
    "created_utc": 1743974335.0,
    "author": "WonderingGuy999"
  },
  {
    "title": "My deepest meditations are that on death, is there anything else similar?",
    "body": "I feel the most connected to the truth of reality, the most at peace, and the most aware when I am meditating on the fact of physical death. \n\nIs there any other very powerful meditation that are similar? (Obviously being aware that everyone is different). ",
    "score": 19,
    "url": "",
    "created_utc": 1744493394.0,
    "author": "WhiteHeart90"
  },
  {
    "title": "Do you guys do pranayama? (yoga breathwork) I think it's great",
    "body": "I do nadi shodhana pranayama in 1-4-2 ratio. 4 seconds inbreath with one nostril, 16 hold breath, 8 outbreath with the other nostril. I did it now for 40 minutes and lifted my mood, In the end i felt mild euphoria. I also find it beneficial before meditation. \n\nWhat are your experiences?\n\n(if you wanna try and don't know it, know your limits and listen to your body, maybe stat with less intense practice)",
    "score": 19,
    "url": "",
    "created_utc": 1744281817.0,
    "author": "janhonza"
  },
  {
    "title": "What does it mean when I see eyes during a meditation?",
    "body": "I wanna know be these eyes be having me shook like a creature or someone was gonna trap me or something. Shit scares me. ",
    "score": 16,
    "url": "",
    "created_utc": 1744484665.0,
    "author": "Certain-Soft308"
  },
  {
    "title": "Just did my first meditation ever.",
    "body": "Just did my first Samatha meditation ever,and WOW it works like magic. For background I have severe OCD,just minutes prior to meditation my mind was extremely cluttered with so many negative thoughts,constantly ruminating about the past and future,and negative emotions. I did a 15 minute session and all the thoughts are out of my head,I am living in the present now and feel at peace. How is it scientifically possible for focusing on your breath to do all that?",
    "score": 15,
    "url": "",
    "created_utc": 1744505867.0,
    "author": "Familiar-Mammoth-753"
  },
  {
    "title": "Seeking Meditation App Recommendations for Long-Term Depression and Anxiety",
    "body": "Hey fellow Redditors,\n\nI'm reaching out in hopes of finding a meditation app that can help me manage my long-term depression and anxiety. I've tried meditation multiple times in the past, but unfortunately, it hasn't stuck or provided the relief I was hoping for.\n\nIf you've found success with a meditation app, please share your experience! I'd love to hear from you. \n\nThanks in advance for your suggestions!\n\n*TL;DR:* Seeking meditation app recommendations for long-term depression and anxiety.\n",
    "score": 14,
    "url": "",
    "created_utc": 1744471152.0,
    "author": "Maleficent-Room-5281"
  },
  {
    "title": "How do I correct poor thoughts/beliefs?",
    "body": "I know meditation is supposed to help with these things but how?\n\nI know deep down that something may not be true, but overtime I will go back into the cycle of believing it again, telling myself it’s not true doesn’t really feel powerful enough to stick.\n\nLike “I am worthless” or “I’m ugly” “I will never be successful” \n\nJust some examples of poor thoughts people may struggle with. Will I have these forever or with meditation can I make most of my thoughts positive ones and actually BELIEVE those ideas about myself and the world. ",
    "score": 16,
    "url": "",
    "created_utc": 1744239197.0,
    "author": "Ill_Introduction7334"
  },
  {
    "title": "I want to get into meditation, but whenever I try, I feel the presence of this extremely intense \"ghost\" and end up in tears",
    "body": "Hi all! I am hoping for some advice. \n\nI am a beginner who wants to get into meditation. I have had a recurring problem with meditation ever since I first tried it. I always end up SOBBING my eyes out. Even when I really focus on positivity and not crying. Even at times in my life where I'm feeling pretty good about things. I don't understand why it happens, and it prevents me from getting further into my meditation.\n\nAlso, about the \"ghost,\" a year ago or so was when I saw her the first time. I had a very intense experience while at this hippie yoga thing trying to meditate in a group. The gal instructing the group brought out some of those beautiful singing bowls and guided us on a meditation. Since we were in a group, I was hoping my crying problem wouldn't arise. But during the meditation, as I started getting into it, I felt this incredible, VIOLENT sadness. I'm not saying this was supernatural, I'm sure it's some trauma thing, but I felt the presence of a girl who was BEGGING in agony for someone to stop hurting her. And I could hear the most unbearable wailing and crying of agony in my mind. I had to stop relaxing and open my eyes and just chill for the rest of the meditation because it was so awful. I can't really explain how intense it was, but it was actually a horrifying experience. I was shaken up the rest of the day and couldn't figure out where the hell it even came from. When I got home that day, I tried to meditate and \"summon\" the girl again, cause I thought maybe I needed to face her or something. But she wouldn't come. I did speak with a therapist after this happened, and found it very insightful.\n\nI had tried to meditate again about 6 months ago, I did not encounter the girl, but I did unfortunately have to stop trying to meditate because I was having uncontrollable sobbing. \n\nJust today, I tried a guided meditation once again. I got comfy and relaxed, and I read your guys' FAQ and saw that sometimes weird things come up that are your brain trying to distract you. I listened to a guided meditation for a bit, and the tears started. I tried to push through. But then, I started feeling the wailing ghost girl again. I just cannot describe the way her sadness feels like getting hit by a train. It feels like a peek into the deepest depths of human suffering. She is frightening, and her wails fill me with intense dread. The only thing that's ever made me feel even close to how the ghost girl makes me feel are movies like SAW. I kept trying to push through, but things got so intense I had to rip my earbuds out to escape it. I felt such a violent sadness I thought I was going to start kicking and throwing things if I tried to continue. \n\nAlso, the girl was saying something that related to a personal trauma of mine. But it's a trauma I have spoken to a therapist about many times and thought I moved on from. Do I have a repressed memory or something?\n\nTl;dr: when I try to meditate, I always cry. When I push past the tears, I hear a girl wailing and crying and it is incredibly intense and frightening. It prevents me from meditating.\n\nAnyways, I just had a couple questions, but would love any and all advice you could throw my way.\n1. How common is the scary-ass ghost thing? Have you had one? What did you do? \n2. How can I get through my crying problem &amp; give some relief to the ghost girl so I can finally meditate? Should I give up?\n3. She's me, right? Like possession definitely isn't real, right? This is some trauma thing and ghosts aren't real? I'm sure it sounds dumb but I'm just spooked as hell by this. ",
    "score": 13,
    "url": "",
    "created_utc": 1744185650.0,
    "author": "Honkhonk81"
  },
  {
    "title": "Combining meditation with affirmations helped me soften my inner critic",
    "body": "I used to meditate just for stress relief — and while it helped, my mind would still drift into negative self-talk right after.\n\nOne day I tried something different: I ended my meditation with a few quiet affirmations like:\n\n“It’s safe to be kind to myself.”\n\n“I’m doing my best, and that’s enough.”\n\n“I deserve peace.”\n\nI didn’t say them out loud — just let them float in gently at the end of the session, like planting little seeds.\n\nOver time, this became a soft, nourishing practice. The stillness of meditation made the affirmations feel more real, more integrated — not just words, but something I could actually feel in my body.\n\nHas anyone else combined affirmations with meditation? I’d love to hear how others approach that gentle overlap between stillness and intention.\n\n\n\n",
    "score": 15,
    "url": "",
    "created_utc": 1744028375.0,
    "author": "PutridPhilosopher690"
  },
  {
    "title": "Returning to my practice after self neglect",
    "body": "Let's just say it's been a rough 2 or 3 years. Today I promised myself i would finally meditate today, after an almost uninterrupted break from meditation throughout that time, I nearly didn't meet my promise.\n\nI have felt profound things during meditation in the past, but i did not know the levels of deep personal discomfort i could feel, I did not know meditation would ever make me grimace from the borderline painful experience of repressed emotional and physical signals bubbling up once given permission.\n\nI can only describe it as feeling a sensation of a sort of twisting sludge inside my body, the physical feeling was palpable. \nIt did fade with patience and breathwork, I don't need to be told 'what is coming is going' but it was still an almost shocking experience. \n\nThanks for reading.",
    "score": 14,
    "url": "",
    "created_utc": 1743970665.0,
    "author": "Ishima"
  },
  {
    "title": "General public perceptions of meditation",
    "body": "So I've been meditating for some time now on a steady basis. It's a good habit. \n\nHowever I don't reveal my habit to most people, because . \n\nWhen I talk to people about it (mostly 20s),, almost all of them respond in a very awkward surprised attitude. It give me the impression that meditation is very mythical thing to them. \n\nMost also are very against the idea of sitting there, wasting time. It feels to them very out of this world, impractical.' Why are you sitting there doing...nothing?'\n\nI wonder does anybody have similar experiences when you try to explain talk to people about meditation. \n\n\n",
    "score": 13,
    "url": "",
    "created_utc": 1744265325.0,
    "author": "RhubyDifferent3576"
  },
  {
    "title": "So i try to meditate for about 20 min and i noticed something",
    "body": "All the pictures, that slowly begin to unravel into my subconcsous mind. The voices, fears and doubts. I felt like an observer, i didn't feel how i drifted off. I was awake, yet i was not. And then my alarm went off. I looked around and felt, like i was somewhere else and just returned to my room. Then i asked myself who is(insert my name) and for a second i freaked myself out. Like a sudden crack into my undertanding appeared for a moment. Hard to focus, when my back hurts like hell though, even when i sit on my chair. ",
    "score": 13,
    "url": "",
    "created_utc": 1744049163.0,
    "author": "potato_knight99"
  },
  {
    "title": "How to be one with the universe?",
    "body": "Don't try to convince me otherwise. I want to leave this body and life. And I don't want to do it by harming my body. I DON'T want to starve. I want to do it through a spiritual practice. I'm thinking of 2 things \n\n1. They say you become one with the universe when you use up all your Karma accumulated through lifetimes, and\n\n2. People in the olden days left their body at their own will\n\nHow can I do one of these and be one with the universe? What practices would help me leave my body as quickly as possible?",
    "score": 12,
    "url": "",
    "created_utc": 1744197485.0,
    "author": "FergieBruce"
  },
  {
    "title": "Meditation shoud be natural",
    "body": "I’ve tried many different techniques in the past—most of them didn’t work. And here’s why.\n\nI was trying to *get rid of thoughts*.  \nBy focusing on my breath or inner body sensations.\n\nAnd yes, it helped *suppress* thoughts for a while...  \nBut relaxation? It wasn’t there.  \nIt felt forced.\n\nEven with self-inquiry, I could go hours without thinking—  \nBut deep down, it didn’t feel like *this is it*.\n\n**What actually helped?**\n\nLetting the thoughts be.  \nNot trying to stop them.  \nNot resisting them.  \nWhen thoughts came, I didn’t care.\n\nEventually...  \nThat *non-resistance* led to real, effortless relaxation.\n\n**So here’s the takeaway:**\n\nStop trying to force your thoughts to go away.  \nLet them be.  \nLet everything be.\n\nThat’s where the peace is.",
    "score": 10,
    "url": "",
    "created_utc": 1744272404.0,
    "author": "Remote-Ad-5185"
  },
  {
    "title": "Is meditation supposed to feel like an intense exercise of not thinking or can I just sit and let my mind wander?",
    "body": "Basically that's my question because people say you're supposed to focus on breath and not let your mind wander. But it's more relaxing when I do just sit and let my mind do what it wants but someone said that's not meditation.",
    "score": 9,
    "url": "",
    "created_utc": 1744380956.0,
    "author": "mo_v"
  },
  {
    "title": "freaking out about not being in constant awareness",
    "body": "I am far from being in a constant state of awareness but I know how it feels to be fully conscious, and I consider that this is the only state in which I am truly living, present. So I am completely terrified of my current state of lack of presence and I feel that I am wasting my days and consequently my life, which passes me by without me even noticing",
    "score": 8,
    "url": "",
    "created_utc": 1744506767.0,
    "author": "ImportanceChemical61"
  },
  {
    "title": "What should a first-timer do to meditate?",
    "body": "I have been reading some posts from this community and I'm really interested to learn more about it and even start meditating myself.\n\nCan someone give me more basic knowledge about it and how to start it?\n\nWhen I thought about it, I had questions like \"When to meditate?\", \"What should be your surroundings?\", \"What do I have to do when I sit to meditate?\", \"What to visualize when I close my eyes?\"\n\nI'm very new to this topic and will be really happy to be part of the meditation community!! Apologies, if I said something wrong?",
    "score": 9,
    "url": "",
    "created_utc": 1744298872.0,
    "author": "FlanxKO"
  },
  {
    "title": "Too much awareness of breath",
    "body": "I started to do the being conscious of breath thing like a year ago but I'm realizing now that I became consumed by it kinda. Like the amount of breaths a day I'm aware of is staggering. I'm not sure I know how to go back really... \n\nHas anyone else had this problem? If you did how did you fix it? \n\nI'm thinking even If I knew how to go back I shouldn't discard the awareness of breath and just go completely to the other side, but when I confront making that skill of being able to notice breath but also knowing to let it go, my brain draws a blank.",
    "score": 9,
    "url": "",
    "created_utc": 1744107233.0,
    "author": "Ok-Risk-3368"
  },
  {
    "title": "What do y'all think about somatic breathing ?",
    "body": "What do y'all think about somatic breathing?",
    "score": 8,
    "url": "",
    "created_utc": 1743958290.0,
    "author": "Low_Manufacturer3649"
  },
  {
    "title": "What do you think about forcing a session length?",
    "body": "Basically I aim for 20min but sometimes after 5min I don't feel like continuing and I just stop. Do you think it's better to force myself to stay for the whole period? ",
    "score": 9,
    "url": "",
    "created_utc": 1744424667.0,
    "author": "rationalsqrt2"
  },
  {
    "title": "How to be more Interested",
    "body": "Something I’ve done throughout my life randomly and haven’t given much thought to, until recently, is picturing how much work goes into everything around you. \n\nPersonally, mindfulness is a little easier when I try and act interested, and if you start to really think about the things around you, both man-made and natural, you can start to consider how incredible they are.\n\nThink of a coffee cup you often use. The amount of work that went into it may seem small in a sense, but if you were to keep breaking it down there’s a mind blowing amount of effort into something even that simple. \n\nThere are the people who find the natural materials for the cup, then there are the people who ship those materials to warehouses. Those materials then get handed to workers who do one part of making the cup. The cup is finished by someone else, packed by another person, shipped by another, and stocked by someone entirely different. The people who made the website that sell the cup are apart of it too. \n\nNow think about the fact that every single one of the hundreds and maybe thousands of people involved in the process of making everything around you, have their own full lives with their own struggles and loves and emotions and faith and opinions. It’d be hard not to be interested in the world if you think of it like that.",
    "score": 8,
    "url": "",
    "created_utc": 1744378058.0,
    "author": "-ASHSTUDIO-"
  },
  {
    "title": "Struggling with motivation to continue meditating, any advice ?",
    "body": "I love meditation, it makes me feel great in the moment but in my daily life I don’t prioritize it and usually I just meditate once a week. I have bad anxiety which i’m slowly improving with gratitude practices and praying. But I would like to also continue mindfulness / thought observing meditation. Does anyone have any advice or success stories they could share with me to encourage me?",
    "score": 8,
    "url": "",
    "created_utc": 1744375877.0,
    "author": "rjrama"
  },
  {
    "title": "Does meditation help in connecting with emotions and developing self-insight?",
    "body": "Hi. Has anyone experienced any progress with this? I'm an autistic woman, and I tend to attract predators and toxic relationships — or rather, I realize I have trouble noticing red flags. I've also come to see that I don't really feel connected to my emotions. Has anyone found that meditation helped with this? Thanks in advance! ",
    "score": 7,
    "url": "",
    "created_utc": 1744309342.0,
    "author": "Vivid-dream-176"
  },
  {
    "title": "Movies to get me excited about mediation?",
    "body": "I once managed to do it a whole month, and honestly, my life did change for the better.\n\nfor some reason i stopped, since then im having a hard time returning to the habit of mediation. im looking for a movie or a tv series that would get me excited about it",
    "score": 7,
    "url": "",
    "created_utc": 1744299268.0,
    "author": "MasterMake"
  },
  {
    "title": "My mind followed the rhythm of my breathing and I was thoughtless",
    "body": "I wouldn't say quiet because my mind kind of echoed my breathing but I was completely thoughtless. Time sped by and I was in the zone for a good while. While I haven't been able to replicate it, consistently for a little more than a good hour of sitting, I'm focused on my breathing for about 98-99% of the time without letting go. My mind wanders in short bursts but it's kind of like in the background. I think what happened that one time is that the background noise just started following my breathing and echoed it. Since I haven't been able to repleciate it, I see it as a stepping stone to stilling the mind. Next time, the background noise will not follow my breathing but simply just cease. I know you can achieve this too.",
    "score": 7,
    "url": "",
    "created_utc": 1744295000.0,
    "author": "Desperate_Fan_304"
  },
  {
    "title": "My first experience with what I felt as, true presence.",
    "body": "I’ve been practicing spirituality and following this path since about Junior year of college. I’m now 24, and I have experienced my first spiritual “awakening” or feeling of total aliveness within my whole body.\n\nI first stumbled across spirituality when I was looking up ways to help my relationship with my significant other. I was plagued with what I now see as depression and ways to escape my mind. I was smoking weed everyday, ordering fast food to my dorm every night (literally), and staying up to the late night hours playing video games. I was lying to her about what was wrong and it impacted our relationship. \n\nDuring this search to help my relationship, I stumbled across Eckhart Tolle and his Essential Teachings podcasts. Since the first episode that I listened to, it spoke to me. I could immediately sense the truth in what he spoke and it drew me in further to these practices and teachings. I was never religious, and I also thought spirituality was silly, weird, and foreign. I had no real inner purpose to my life. Just chasing the short gratifications whenever I could.\n\nJust like everyone’s spiritual journey, mine was and still is on and off and I obviously would live in my mind when not focused on these teachings. But when I listened to his words, I felt at peace.\n\nI would try to meditate here and there, walk through a forest, really observe the trees and beauty of what stillness they had- and imagined it within myself. At that time, I thought the feeling I had in my body was presence and aliveness. Maybe it was, but a very small amount. \n\nI would go into my life and my challenges, and what I’ve had to overcome- but that would turn this post into a book. I’m really here to just talk about my experience.\n—\nI got “The power of now” a few weeks ago when I was trying to obtain knowledge of how to overcome my anxiety and relationship I had with my mother. I was going to therapy at the time and he was familiar with Eckhart Tolle and once he related to me, instead of listening to podcasts on and off, I decided to get the book.\n\nI didn’t start REALLY reading it until a couple days ago. My morning routine is going to a coffee shop, getting a cup of coffee, pulling out my book, and reading it and underlining and taking notes on things that stood out to me.\n\nIt wasn’t until I got to a chapter which was explaining a meditative practice on how to feel the aliveness in your body and how to feel your “inner body”.\n\nI started going to this spot by a creek near my apartment that is completely- for the most part- isolated. I started going out there to skip rocks and be alone with my thoughts. It is very peaceful.\n\nThere is this small stone that sits right on the edge of the water that aligns with these jagged rocks in the middle of the creek that are stacked, creating a rapid with crashing water that added to the immense peacefulness. I would hear birds and would sometimes run into others just talking near this creek surrounded by trees and nature.\n\nWhen I first saw that stone I said to myself, “what a place to meditate”. At that point in my life, I wasn’t meditating and only tried it a couple times in college.\n\nWell yesterday, after reading about the inner body in the power of now, I went out there to try this meditative practice he talks about step by step. I sat on the stone.\n\nI closed my eyes and watched and observed the thoughts that would cross my mind. Usually they would be “what if someone comes down here and sees me sitting here”, “that would be so weird”, “what if someone comes down here and stabs me in the back”. I was unable to make my mind still. I continued to sit there and observe these thoughts without judgement. Eventually, I felt the small aliveness in my body (still following the steps he mentioned). I kept focusing on that feeling and feeling every part in my body. Every vibration, every sound around me, and imagined myself as a ball of light with light slowly seeping out and shining aside that creek. I came to a point where there were no thoughts after about what felt like an hour sitting there. There were not even thoughts of “I don’t have any thoughts”. My mind was incredibly still. I sat like that for more time, and SOME thoughts would quickly zip across my mind, and I watched them fade in my own mind. There was nothing. I sat there longer while feeling this incredible aliveness in my body, and following his instructions, slowly opened my eyes and looked at the trees, the water, and the nature all around me. \n\nI was immediately met with an intense vibration AROUND ME and WITHIN me. I was incredibly fearful and wanted to stand up immediately. Everything around me looked foreign and I was to say plainly, scared shitless. I didn’t think this at the time cause it was just fear, but the closest thing I can relate to is a panic attack where your whole body is vibrating and you feel nauseous. There was no nausea, but that’s what it felt like and probably what my mind related it to.\n\nI tried to keep this feeling after the initial fear, and it only lasted a couple seconds. I looked around and admired nature. And the stillness and beauty of everything. It slowly subsided but I still felt this vibration within my whole body. While I was sitting there, still with this feeling, I saw a wasp land near me and buzz around. I have extreme phobia to bees and wasps and again, I wanted to stand up and move away, but I didn’t. This was a conscious decision. Instead of being succumbing to the fear, I sat there and looked at this creature without trying to label it. It was drinking water and flying around and eventually it left. Shortly after that I got up once comfortable, grabbed my book and phone, and walked back up the steps that led to this area, and back to my car about a quarter mile away. Still feeling this vibrational and peaceful sensation. Eventually I got back to my car and sat in my car with my thoughts. I took the book, and journaled about this feeling and looked up reasons on why I felt that intense amount of fear when I opened my eyes. Although I got some answers, I’m not going to act like that I have the answers or achieved something spectacular.\n-\nI’m not going to be “chasing this feeling” that I experienced. But it almost doesn’t feel real.\n\nI just wanted to share my experience and I’m not looking for recognition or anything like that.  Afterwards I wanted to share with a few friends that aligned with my path of spirituality, but I didn’t want to give into the egoic mind of wanting to share and receive some type of recognition or have them want me to talk about it more. This is my own personal journey and I understand that now more than ever. After some thought, instead of sharing to my close friends, I’m deciding to share it here.\n\nIf you have any questions or if there is any feedback on this post I would love to try to connect to others who have a had similar experiences. If you made it to the end thanks for reading. ",
    "score": 8,
    "url": "",
    "created_utc": 1744212318.0,
    "author": "zhops123"
  },
  {
    "title": "Can someone ELI5 for me the difference between samatha and vipassana?",
    "body": "In a practical sense I'm not sure I understand the difference, especially in terms of benefits.  Thanks.",
    "score": 6,
    "url": "",
    "created_utc": 1744383682.0,
    "author": "RegattaJoe"
  },
  {
    "title": "I never feel like I am fully present in the moment",
    "body": "Now for background knowledge I do have diagnosed adhd and undiagnosed ocd (I only mention this because I do match with a lot of the symtoms with ocd but adhd and ocd symptoms can overlap, just put this here to give some context)\n\nRecently as I have gotten into spirituality, and a teensy tiny bit of meditation during the day. Ive started to noticed that I never feel truely in the moment, like I will be trying to do some simple breathing exercizes in the shower and meditation to try and bring myself to a better current moment and it feels like Im not fully present in the moment. I never knew what it was like to be present in the moment because I always had constant thoughts bouncing around in my head.\n\nI havent gotten to really hammer in the habit of meditation fully but ive gotten into it when I can during the day in order to gain some clarity. My main person who I follow for meditation is rick rubin, who embraces meditation and has a peaceful and calm demeanor. I want to be like him eventually. \n\nHopefully I can gather some help from you all and gain some insight into this journey back into meditation",
    "score": 7,
    "url": "",
    "created_utc": 1744271071.0,
    "author": "STARBRD"
  },
  {
    "title": "Eyes will not stop vibrating",
    "body": "\n\nAbout 3 weeks ago I had a life altering experience. I was deep in meditation and I felt every chakra explode with energy. Vibrations from my chest and up were out of control. It literally felt like an elephant was on my chest, then release, then sit. All the while my throat chakra felt like it was being poked with a branding iron. My whole head vibrated and I felt like pure energy was pouring out of my head and with my eyes closed I saw a blinding white light shoot up my spine with two gold lights wrapping around it. My body/spine was thrown into an upright position with my head tilted back with what felt like a ball of energy trying to rip out of my throat. I felt the pure consciousness of the universe and whoever I was died (ego death). This was followed by feeling like I was god and I could access any and all information from the history of humanity, it was pure bliss...until it wasn't. Then came on the mild psychosis (thinking that life is purely a game and the point of my life was to get everyone I know and love to understand that life is a game) took a couple hours of talking and relaxing to come back to earth and reality. Overall the experience was amazing, I'm relatively new to meditation/energy/spirituality, but from my research I came to the conclusion that I had a spontaneous kundalini awakening(partial). Fast forward to today, any time my eyes are closed my eyelids Begin to vibrate, doesn't matter if I'm in meditation or not. I can feel the energy at my eyes and have been practicing moving it up to between my brows and into my 3rd eye and once had success because I saw a flash of light when I did it. Ever since the event whenever I meditate my heart, throat and head vibrate and pulsate about 5 min into my meditation, but feel little to nothing in my lower 3 chakras. Nobody I know is into meditation/energy/spirituality so I don't have anyone to bounce these experiences off of. If anyone would have some tips/recommendation/personal experiences they would like to share I would love to hear them! I also have video of my eyes continuously twitching but at the end of my typing this I realized I can't upload videos. ",
    "score": 8,
    "url": "",
    "created_utc": 1744221689.0,
    "author": "L25065"
  },
  {
    "title": "Defiant part of mind yells mantra back at me.",
    "body": "I am just starting to seriously try meditation. I have not been able to get through more than step 5 or 6 on the one giant mind app.  When I try to bring my mind back to the mantra something in my mind, yells the mantra back at me in a defiant way kind of intimidating, aggressive and kind of scary. It’s weird. Sometimes it says “no” when I say to myself focus and think mantra.  Has anyone experienced this? If so, what is the deal and how do you handle it and get past it?",
    "score": 5,
    "url": "",
    "created_utc": 1744203946.0,
    "author": "xultar"
  },
  {
    "title": "Tips for a beginner?",
    "body": "I've been meditating for 2 days now, around 20 minutes in total. It's a very strange feeling—after each session, I feel somehow different, calmer, just better. I'm curious about your ways of meditating, and whether it's normal that during meditation, when I drift off, I imagine something like a lake and thoughts as little boats—or should I just return to the breath? Also, any tips?",
    "score": 7,
    "url": "",
    "created_utc": 1744134928.0,
    "author": "Worried_Tooth_8129"
  },
  {
    "title": "Your mind is the command center.",
    "body": "Every choice, every emotion, every direction flows from it.\n\nProtect it. Quiet it. Return to that inner stillness—where clarity lives and your true self feels at home.",
    "score": 7,
    "url": "",
    "created_utc": 1743991970.0,
    "author": "PivotPathway"
  },
  {
    "title": "Mike Tyson",
    "body": "“God punishes you by giving you everything you want…to see if you can handle it.” -Mike Tyson\n\nThis quote came across my mind during my nightly session. A lot can be interpreted from it. To me it speaks about humility, integrity, ego and greed. Can you keep yourself in check when things are going your way or do you fall victim to traps.\n\nWhat are your thoughts?\n\n",
    "score": 7,
    "url": "",
    "created_utc": 1743984114.0,
    "author": "pumpsandjumps"
  },
  {
    "title": "How long should you meditate to actually see the results?",
    "body": "I'm doing it but I'm almost always failing. I don't see any results from it and I feel like I'm not even doing it right. First of all it's so hard for me to sit because my back almost always hurts. It's so hard to concentrate when my back is hurting and I feel tense. ",
    "score": 6,
    "url": "",
    "created_utc": 1744487709.0,
    "author": "Plastic_Common4838"
  },
  {
    "title": "Is it ok to use scents, essential oils, candles during meditation? Which ones do you use?",
    "body": "I’ve been following conversations about increasing the depth of your daily meditation practice. Some say that using candles or essential oils enhances the experience. Never used any of it before...  \n  \nHow much do these things really influence our meditation? What are your experiences?",
    "score": 7,
    "url": "",
    "created_utc": 1744196539.0,
    "author": "pixel_pioneeer"
  },
  {
    "title": "What if the overarching thought is \"I am trying to observe my thoughts\"?",
    "body": "I am thinking \"Okay I am trying to observe my thoughts\", but that is the thought, then I am seemingly waiting for another thought to come into mind, but that other thought is a distraction not a thought? I have drifted from the original thought of trying to oobserve, but unable to observe because my thinking is something like \"observe now, dont think about anything else...\" \n\nI find it very difficult to get to the observing point in meditation, I believe I have only touched on it once or twice. I have adhd and Autism, so maybe its harder for me in a way. My thoughts are always layered, multifaceted, \"seemingly important\" emotionally, all somewhat connect in a way, they merge into each other, and feels like a constant relatively coherent stream of a story my brain is creating within my brain. \n\nIt's much easier to catch thoughts that break this cohesive pattern, and have no ties to what is already being thought, if that makes sense, I worry this post makes very little sense. \n\nMy brain creates so much extra suffering and wastes so much energy, if I can somehow let go, whatever that means, and accept whatever that means as well, and just observe I will have made some progress I think.\n\nany insights or guidance would be greatly appreciated.",
    "score": 5,
    "url": "",
    "created_utc": 1744190932.0,
    "author": "qourkening"
  },
  {
    "title": "Should I turn off all my voices in my head and just feel the feelings.",
    "body": "I have recently finished the book \"mediation and mindfulness\" of Andy Puddicombe, and during my lastest session, I encounter an weird experience. I broke up with my ex several months ago, and now she have new boy friend, a very successful guy. I was really shameful when she tell me how they met the first time,...worst memory of my life. Now, I hearing her voice again while mediating \n\nI have not fully understand the idea \"observe your thoughts without engaging in\". I can feel easily the heaviness in my chest and scan my body well. But when the voices appear, it is so hard to both listen to it and do not think about it, you literally can not \"hear\" without paying any attention. It is like an inner conversation, when the other talks to you, you have to spend a part of your attention span to decode messages and understand what they talk, therefore, I feel it is nearly impossible to just \"observe\". \n\nWhat should I do if I hear these voices again? Feel the feelings or listen to it",
    "score": 5,
    "url": "",
    "created_utc": 1744529266.0,
    "author": "Odd_World_7326"
  },
  {
    "title": "Have you succeeded in observing yourself without changing anything?",
    "body": "I've been trying to observe myself when I'm in the dumps of any kind, for a quick second, hoping to not change anything but it happens every time. I don't quite understand what I would be getting out of it if I were to manage to do it, but I've had moments of clarity where I realized that that's a thing I should strive for. If I were to put a metaphor down, it would be if there was a sea with it's waves and ripples, I want to perfectly descend on the water and not go in, but more importantly not make any ripple. I've been trying to do it for a split second because any longer feels impossible but still I fail. Sorry if the metaphor makes no sense, that's the best I could do. \n\nDoes this make sense to anyone, and if it does do you have any advice, maybe knowledge of why this is beneficial, and how long did it take you to learn it?",
    "score": 3,
    "url": "",
    "created_utc": 1744452767.0,
    "author": "Ok-Risk-3368"
  },
  {
    "title": "beginner",
    "body": "hii i started meditating yesterday . i’m trying to do 10 minutes every day . already did a session tomorrow . i want to feel very vivid effects . i know i’m not going to unless i’m very experienced, but does anyone have any tips that will help me get better quicker. i want to feel more at peace and less doubts . i already feel a difference ",
    "score": 6,
    "url": "",
    "created_utc": 1744449777.0,
    "author": "Savings-Lifeguard906"
  },
  {
    "title": "What to Expect as I Continue Meditating?",
    "body": "I've been meditating for the past couple months now - slowly got used to meditating 20 mins 3x a week.\n\nAs time went on, after the rush of thoughts pass from when I start meditating and things slow down, it'll be like part of my mind is trying to teach me something.\n\nI got insights like: Realize you exist and realize you can change.  Recently, my mind has been telling me to let go of control over things - like trying to clench my hand around life.  I have to loosen up and allow myself to be a puzzle piece in it.\n\nAll of this is sort of surreal to me.\n\nWanted to hear from people who meditated for longer what I can expect as I continuing practicing.",
    "score": 4,
    "url": "",
    "created_utc": 1744398737.0,
    "author": "firstcigar"
  },
  {
    "title": "Difficulty in not identifying with thoughts and feelings, they feel like me",
    "body": "Yeah i just don't know what to do. If i feel anxious because of something my body gets tense and my thoughts race and I feel like these things.",
    "score": 5,
    "url": "",
    "created_utc": 1744385626.0,
    "author": "Junior_Blackberry779"
  },
  {
    "title": "Your Favorite Gratitude Practice / Exercise / Game",
    "body": "I know that the best one to do is just sit there and feel grateful for the things you appreciate in life, one by one. And that works for me really well. Even when I am not initially in the mood for it, as I keep doing it, I just want to keep doing more and the high is just inexplicable. But I just wanted to spice it up. I know feeling works better than writing it down but I want to use this cute notebook I bought 😬 tbh I don't like writting that much. Do you know any fun gratitude exercises or games where I can also make use of a notebook. Thanks!",
    "score": 5,
    "url": "",
    "created_utc": 1744265925.0,
    "author": "tmhsspirit"
  },
  {
    "title": "Written meditation resources",
    "body": "Hello all  \nI work at a community centre where we offer daily meditations from a meditation room.  \nWe are in the process of setting the space up so that anybody can drop in at any time and use the space.   \nWe have an ipod with a bunch of guided meditations and music etc, and I'm also compiling a folder of written meditation guides.  \nNow that I've started, I'm finding it hard to find content to actually put in the folder.\n\nDoes anybody have any good material they can point me in the direction of?\n\nThanks",
    "score": 5,
    "url": "",
    "created_utc": 1744169511.0,
    "author": "DharmaDanNZ"
  },
  {
    "title": "Hoping to get some insight on my journey of healing through mindfulness",
    "body": "Would just like to thank you in advance for taking your time to read this and providing any advice. the internet can be a wonderful place despite its flaws.\n\nI've been dealing with heartbreak, mostly guilt and sadness about situations I no longer have control over. as a sensitive person, it has been debilitating for quite some time now. And I tend to have a bad habit of not confronting my emotions till I'm overwhelmed with baggage.\n\nIve been learning about meditation throughout the years, lots of it inspired by readings from Eckhart Tolle whom I am grateful for.\n\nI try to be mindful and present,  by observing my thoughts and let it pass, telling myself I am not my thoughts. and try to let go of things I no longer have control over. when I do, it tends to alleviate my pain a bit, like I can breath again.\n\nhowever I find that I almost get a \"rebound\" effect after. where those negative feelings come back even stronger the moment I'm not being mindful. as If I was surpessing those emotions during my mindfulness exercises. \n\n  \nI guess my question is: is this normal? am I perhaps approaching mindfulness/meditation the wrong way?\n\nis it maybe necessary to feel the pain fully to properly process negative emotions, and move on from past chapters of life?  or do I just keep observing them for relief, and ride it out the suppressed pain when It comes back.\n\n\n\nI would really love to gain some insight on my best course of action for my path of healing, and make peace with my suffering.",
    "score": 6,
    "url": "",
    "created_utc": 1744049711.0,
    "author": "sleepytreedroids"
  },
  {
    "title": "I am at a crossroads in my life and want to go on a solo meditation retreat.. Please advise!",
    "body": "Hi all. I am a 30 y/o male from India. I have no *real* prior meditation experience except a few minutes of \"guidance\" that my music guru (I learn the tabla) shared (to sit in the lotus pose, with a specific *mudra* or static hand gesture, and utter certain syllables during inhalation and exhalation of breath).\n\nI am at a crossroads in my life.. with respect to career, I want to quit and go out and do my own thing. I am also deeply (and depressingly) contemplating my own mortality (which is an \"always on\" thought at the back of my mind). I think my mind is not healthy.. and it is not at rest. Other issues are constantly shifting focus (or lack thereof), being quite irritable, being extremely lethargic, and resorting to gluttony to feel good. My sleep is also very disturbed and irregular.\n\nAs you may imagine, given the condition of my mind, my body is not in great shape either (or vice versa).\n\nSomehow, I've been feeling (internally) that I should retreat to some solitary arrangement wherein I spend time with myself and my thoughts. Where I can practice meditation for as many hours as possible. Where I can practice exercise (something like *surya namaskar* or sun salutations, a cyclic set of poses that help improve flexibility and mobility). Where I can practice healthy eating. And finally, where I can practice sleeping well.\n\nI plan to set out on this adventure of self exploration day after tomorrow. I've booked a flight to a place called Rishikesh, which is in one of the mountainous regions of India.. where I hope to get well, holistically. I've currently earmarked 5 days but can extend to 10 days if you recommend that.\n\nGiven my situation, what I'm trying to achieve, and my lack of experience with anything.. I request and seek your help and guidance about anything you would like to help or guide me with 🙏 Please help me.\n\nP.S. I am reading material linked to from the community bookmarks.. and am currently trying to identify a sustainable meditation framework and methodology. I am also trying to digest and utilize all of the wonderful material that [u/TheHeartOfTuxes](https://www.reddit.com/user/TheHeartOfTuxes/) has written on solo retreats. \n\nP.S.S. Apologies for any typos or bad grammar.",
    "score": 5,
    "url": "",
    "created_utc": 1744045835.0,
    "author": "0x23212f"
  },
  {
    "title": "Need to understand meditation types",
    "body": "I have been practicing mindfulness for over few years. Now i have been introduced to heartfulness. I have also heard about so many other types of meditation. I just want to understand what is the whole and sole impact of practicing the meditation (any form). And also what is sadhana?? Can anybody please explain!!",
    "score": 5,
    "url": "",
    "created_utc": 1744031005.0,
    "author": "ColdConfection2044"
  },
  {
    "title": "Meditation in a dorm?",
    "body": "I'm a college freshman living in a dorm with paper thin walls where people are running around screaming 24/7. I want to meditate but I simply can't focus when there's a startling noise every couple of seconds. Should I deal with the noise or use headphones to play music. Also just as a general question, is mediation just as simple as focusing on breathing for a period? Or should there be more as I feel like I haven't been making any deicoveries just breathing ",
    "score": 5,
    "url": "",
    "created_utc": 1744003859.0,
    "author": "thatsthedrugnumber"
  },
  {
    "title": "Meditation and confidence?",
    "body": "Isolation and meditation have unintentionally made me more socially active and arguably more charismatic. Is it conterproductive to search for ways to improve in these regards? Have you guys experienced such side effects I guess you could call it.",
    "score": 6,
    "url": "",
    "created_utc": 1743991982.0,
    "author": "Ashamed-Archer-9745"
  },
  {
    "title": "Meditation seems to lower my temperature, does this happen with anyone else?",
    "body": "Meditation seems to lower my temperature, does this happen with anyone else?",
    "score": 4,
    "url": "",
    "created_utc": 1743977078.0,
    "author": "Certain-Soft308"
  },
  {
    "title": "I be seeing eyes during meditation",
    "body": "I be seeing eyes constantly moving during meditation but I do be feeling very relaxed and calm. I also did the wim hof breathing technique during a 20 minute meditation.",
    "score": 5,
    "url": "",
    "created_utc": 1743974848.0,
    "author": "Certain-Soft308"
  },
  {
    "title": "I Overcame my Anxiety  - A Hybrid Mindfulness Meditation",
    "body": "# \"Finding Peace Without Awakening \"\n\n**Context:**\n\nLast year, I suffered from severe anxiety(actually i always had sever social anxiety , only that i never named it before) , right up until the day before yesterday. I’ve spent countless hours researching this topic, searching for solutions, reading articles, threads, web pages, watching videos, meditating, and more.\n\nI know this isn’t awakening. There’s been no sudden \"SNAP\" yet. I’m still just a normal guy. I don’t carry any special wisdom. But I’ve realised that to live a peaceful life, you don’t need to be enlightened or awakened. haha ...\n\n**Let's start....**  \n*\"Let your words rise from your* ***center***\\*.\\* \"\n\n**Keynote:**\n\n1. It’s perfectly okay to talk/speak more slowly than usual. There is no rush to reply/talk fast just bcoz everybody else is.\n2. If your brain feel clouded, or if anxiety weighs you down—don’t worry. Fear and anxiety are natural. Their presence doesn’t mean something’s wrong—it just means you’re human. Your emotions are your friends not enemies. Believe me. \n\n**But why do i feel uncomfortable ?**\n\nBcoz you dont Take enough time. You do not Contemplate deeply.\n\nPlease Take your time. Contemplate deeply to find not just the right words, but also the right tone. Let it take as long as it needs—there’s no rush.\n\nBecause what truly matters is ***NOT***:\n\n* Your pace — You don’t have to speak fast just because the world does.\n* Being funny — There’s no obligation to entertain.\n* Being free of anger — Anger is an emotion. It will come, whether you like it or not.\n* Being free of anxiety — Like anger, anxiety is natural. It will come. Accept it.\n\nWhat truly matters is that whatever you choose to say—or not say—should come from a place of sincere contemplation and your truest self.\n\nFor example: \n\n**If someone is bullying you:**\n\n* You will feel **angry**.\n* You will feel **anxious**.\n\nThat’s completely natural. Humans have bullied each other for ages. In such moments, don’t react impulsively without thinking. Anyone would feel fear, anger, and anxiety in such a situation.\n\nInstead, shift your attention inward. Contemplate.  \nWhat do you *really* want to say—or do you even need to say anything at all?  \nTake your time to find out. Don’t hurry. \n\n**Talk in slow motion if you need to.** \n\nContemplate -Contemplate-Contemplate, Until u feel that the anxiety and fear is not affecting your decision making.Only respond once your contemplation feels complete, and you're at peace with your words—whether they’re words of love, defense, anger, or silence. Even anger feels right when it comes from your center.\n\nWhen others speak quickly, in groups or with intensity, and you struggle to find words—it’s okay.  \nDon’t let that make you anxious.\n\nWhat’s actually happening is that their speed and noise are disturbing your inner space. They’re not letting your brain think clearly. They become *noise*—mental interference. It just means that they and the noise they create is disturbing brain, preventing it to think properly .  And you must not let that happen. Support your brain. He needs you.\n\nHence in such situations  slow down even more. Focus. Think. And speak **only** when you're sure of what you want to say and how you want to say it, because anxiety affects and alters tone.\n\n**Remember**: anger and fear will come and they will be there —bcoz they’re just natural emotions. Let them pass through you. Keep your attention on understanding what’s being said, and allow your response to emerge in its own time.\n\nDeliver it slowly. as i said ,Because anxiety can **distort** your tone.\n\nSo take your time. Speak slower if you need to. Let the emotional wave settle, and then express yourself—smoothly and sincerely.\n\n**Moving slow is not weakness.**  \n**It is wisdom.**  \n**It is strength.**  \n**Being a turtle is fine.**\n\nTBH, after realising this, I’ve started speaking more slowly and clearly than I used to. There’s still anxiety, fear, and anger, but they don’t bother me after I complete my contemplation. Almost No Intrusive thoughts.  \nYes, I feel peaceful now and i guess i can focus on more important things.\n\n**I hope it works out for you too... If not, please comment. I will try to answer you all.**",
    "score": 5,
    "url": "",
    "created_utc": 1744516871.0,
    "author": "Top_Ring_2294"
  },
  {
    "title": "Can meditation relax the idea or thoughts of women in my head/brain?",
    "body": "Can meditation relax the idea or thoughts of women in my head/brain? I just want to calm these thoughts down because apparently I can't get rid of them since they are in my biology.",
    "score": 6,
    "url": "",
    "created_utc": 1744514204.0,
    "author": "Certain-Soft308"
  },
  {
    "title": "I’m 16 and I can’t stop thinking about thinking and getting stuck on loop with this thought",
    "body": "I remember a time in the summer I suddenly had this thought or became aware that I could think about my own thoughts all the time and it kinda scared me and stuck with me for a couple days until I stopped thinking about it. Just about a week ago now I have been constantly thinking about this thought throughout the day, I remember the night it started again I was watching a movie and literally was trying to fight it and stop thinking about throughout the whole movie. Ever since then it’s been in my head consistently throughout my day. When I try to fight it it gets worse, and when I tell myself to forget about it that does the opposite. The only way it leaves my brain is if I am completely focusing on something else, and then I usually think about it again in a matter of a minute. I do want to say Ive been using weed carts pretty heavily since January probably going through a cart every week or 2, I started using them for sleep and anxiety but it turned into an addiction after January and for the last 2 weeks I’ve been weening off weed pretty significantly as I think this thought made its way into my head when I stopped using weed and was having high anxiety and negative thoughts. I still don’t understand this fully, and would like to hear anyone else’s experiences with the same type of thing. Please feel free to share anything you found to help with this thought cycle. Or anything I can do to help the process because I’m scared it will never go away",
    "score": 4,
    "url": "",
    "created_utc": 1744467369.0,
    "author": "Outrageous_Formal432"
  },
  {
    "title": "Home EEG Device to measure brainwaves and neuropathy",
    "body": "Can someone recommend a home device that can help me measure the effectiveness and even show if I am achieving increased neuropathy in areas of my brain while I  meditate ?\n\nThank you in advance",
    "score": 3,
    "url": "",
    "created_utc": 1744371554.0,
    "author": "johnnyrayZ06"
  },
  {
    "title": "Struggling to find benefits of meditation",
    "body": "I have recently started to take meditation more seriously.  Roughly two and a half weeks. I just haven't really seen the benefits. I dont necessarily feel more calm and mindful, if you will. Sometimes I even feel more agitated after a meditation. \n\nI am constantly questioning whether I am doing something right. Whether I am sitting correctly, whether I am breathing right, constantly lost in \"meta\" thinking. Feels like I am doing worse vs better.  \n\nAny thoughts on this?",
    "score": 5,
    "url": "",
    "created_utc": 1744244072.0,
    "author": "Working-Hat-8041"
  },
  {
    "title": "Mindfulness and meditation are not the same.",
    "body": "Mindfulness and meditation are not the same. Meditation is the practice of slowing down the pace of thoughts. Meditation is to still the mind, to kill the mind. When we are in the state of meditation, when we are successful in taming the monkey mind and making it a monk, then we reach the state of awareness, of consciousness known as mindfulness. In mindfulness, there is no mind. The mind is empty, free of toxic thoughts. Then thoughts gently enter our consciousness, and we become mindful of each thought, as in this state of mindfulness, the intellect, which has the power to discriminate every thought and choose peace, love and bliss, is activated. Therefore, from the state of meditation, we evolve and grow into the state of mindfulness or consciousness. ",
    "score": 5,
    "url": "",
    "created_utc": 1744212001.0,
    "author": "atmaninravi"
  },
  {
    "title": "Concrete examples of meditation?",
    "body": "The main type of meditation I have done is \"focusing on the breath\" for periods of roughly 40mins. Recently, I have gotten around to reading Adyashanti's Way of Liberation, which expresses a different type of meditation which is basically letting go of all focus and simply letting it be.\n\nIn the past when a thought would arise, I would turn it off (destroy it) almost instantly and resume my focus on the breath. But in this new style, I am supposed to simply let the thoughts exist, without interruption or control, although Adyashanti does mention not to get lost in thought and rather simply observe (let them be) thoughts.\n\nSo I am not 100% sure what this looks like, and would love to see some concrete examples. For instance, one of the first thoughts I have in meditation is noticing my tinnitus (ringing in my ears) and various discomforts that arise in my body from sitting cross legged. So my thoughts are as follows:\n\n*That ringing sure is loud in this silence. And apparently gets louder as I notice it. Oh, that's a thought I'm having. {notices breath}. Breathing is steady. Oh there's my fridge turning on. {brriiiiinnnnnng ringing from tinnitus}. Leg already a little numb. Better move a bit. I'm observing these thoughts. And I'm observing observing them. Always just thoughts. food later.*\n\nAnd so on and so forth. There are quite a lot of silence stretches amongst those thoughts (say it took 2 minutes for the above). And sometimes I do get lost in thought, like what will I make for dinner, but when I do finally notice that I have become lost-in-thought I yank out of the state and try to \"not\" do it (??) by trying to merely observe that the thoughts had formed and taken my attention away.\n\nSo is there more to it than that? It seems more like instead of focusing on one thing (breath) my focus just jumps around depending on what bodily sensations I notice and random thoughts that are produced. Would love examples. Thanks\n\n\\---------------------------------------------------------------------------------------------------\n\nedit: On the difference of thoughts within and outside the meditative practice:\n\nlet's say I'm thinking about making dinner outside of meditation, and comparing to the same thoughts occurring within my meditative practice - what would be the difference? To me, it seems like I'm actively engaging with my thoughts, directing them and feeding them with my emotional inquiry (hunger), when I'm thinking about it outside meditation. But in the meditation, the thought would occur and I would not add to it; I'd notice the thought form and not engage with it for further thought. So the thought *what will I eat tonight* is formed, but not the decision making thoughts of *well I think chicken would be nice*. If the decision/inquiry of chicken being good would also occur, I suspect I would be lost in thought at this point. Is this correct?",
    "score": 4,
    "url": "",
    "created_utc": 1744121643.0,
    "author": "Sweetpeawl"
  },
  {
    "title": "I can’t focus",
    "body": "I am a newbie , i have been doing meditation for 15 days maybe, Whenever i try to sit in meditation , I can’t focus even after few seconds my mind starts to chatter, even if i try to focus on a particular thing like i did tratak meditation for a few days then also my mind would start chattering about the point where i used to focus? \nHow to get better and sit for a long time ?",
    "score": 4,
    "url": "",
    "created_utc": 1744079410.0,
    "author": "Status_Ad74"
  },
  {
    "title": "bad feelings after bad meditations?",
    "body": "Hello\n\nSo, I've learnt that there is no bad meditation, except the one that you did not do at all. Yet, there are naturally meditations that go very well, where I am able to focus basically non-stop for the best part of an hour and I end it with a very happy feeling, relaxed, calm, focused. And then there are those sittings where after 10 minutes I begin to realize this is not going anywhere. I fight with drowsiness and mind wandering, I loose focus, I start dreaming and what was supposed to be a 60minutes sitting, ends after 30 minutes with me getting up and being in a bad mood. I have managed to sit through this and stay with the meditation but then I spend the rest of the sitting equally ineffective. When this happens it usually puts me in a bad mood for the next few hours. \n\nHow do you deal with this?",
    "score": 5,
    "url": "",
    "created_utc": 1744014008.0,
    "author": "Ralph_hh"
  },
  {
    "title": "Sleeping, eating, exercise and meditation.",
    "body": "I've been reading various posts here for a while and I just want to reach out for a bit of consolidation of how these work together. It seems most people who talk about it won't meditate after eating or exercise. I don't know what the value of meditation before sleep really is. How do you structure your day so that these elements aren't fighting each other? What have you found to be the optimal order and buffer times between these activities?\n\nAs a side note, I'm trying mediation to help with keeping my mind a bit more organized and to keep a reign on negative automatic thoughts (or at least their effects on me).",
    "score": 4,
    "url": "",
    "created_utc": 1743993723.0,
    "author": "estcst"
  },
  {
    "title": "Question about “dangers” of meditation",
    "body": "Hi everyone. \n\nSo, I have been meditating certain periods on and off the past couple of years (around 10 minutes a day). I would say it helped me somewhat in more difficult times, but recently I have the urge and motivation to learn and practice the become a more advanced practitioner. The past couple of week I have been building time into my schedule to make it a habit, I’ve did some research and bought a book about meditation (The Mind Illuminated).\n\nI also read some things about the dangers of meditation (if not doing it the right way), and that it could induce anxiety, depressions or even psychosis (??). How concerned should I be about the negative sides of meditation and what should I do to prevent those things? \n\nThank you :) \n\n",
    "score": 5,
    "url": "",
    "created_utc": 1743963667.0,
    "author": "dribdirb"
  },
  {
    "title": "Does meditation help produce those chemicals in your brain?",
    "body": "Like endorphins, dopamine, or serotonin?",
    "score": 4,
    "url": "",
    "created_utc": 1743958225.0,
    "author": "Low_Manufacturer3649"
  },
  {
    "title": "My mind is not a lake, it is a river. There is no stillness, it is always in flow.",
    "body": "An epiphany I had this morning ",
    "score": 4,
    "url": "",
    "created_utc": 1743942248.0,
    "author": "Ok_Detail146"
  },
  {
    "title": "Felt inspired to write and share this poem after a meditation experience yesterday",
    "body": "\nBorne of light\n\ninto a world\n\nshrouded in darkness.\n\nFear suffocates\n\nshould we dare to contemplate\n\nwhat seems a meaningless existence.\n\nWe tell stories\n\nof plans, of heaven, of hell\n\nto quell the terror of \n\n“I do not matter”.\n\n\nWe drink our pain.\n\nWe run.\n\nWe hide.\n\nThe threat too great in:\n\n“Who am I?”\n\nWith open eyes\n\nwe go on blind.\n\nYet if we brave\n\nthe quiet mind,\n\nlet stillness come,\n\nwe close our eyes—\n\nAwake to truth\n\nlong known inside:\n\nI am love.\n\nI am light.",
    "score": 3,
    "url": "",
    "created_utc": 1744499147.0,
    "author": "bananziepants"
  },
  {
    "title": "For never content and constant desiring minds!",
    "body": "I finally understood what is meant by the sages, when they say \"we follow our minds, like the deer who runs towards a mirage of water whenit is thirsty\".\n\nIn my case for instance, my mind always desires the same thing over and over again. Mostly it desires life to be different than what it currently is. More freedom, more money, less bills, more time for things I want to do etc.. it's like a reoccurring pop up thought. Thinking if I had this or that, of if I could do this or that, I would be more content than I am now. So what happens when we get suckered into these wishful thoughts?? The mind is going to try to find a way to make it happen? Find another job, move, start saving or investing etc. So there we are running after what we think would make us more happy. However, in my case as well I noticed that even when I get what I desired, after some time something else will not be right and discontenment reappears. And so it goes on and on and on. Always looking for something, some place or someone that will give us final contentment. \n\nBut now I realized that THIS is my life. Right now, right here, exactly as it is!! MY LIFE is NOW! With the mundane job, the low income, the high rent etc. It is to be accepted as it is. To follow the minds mirages and trying to constantly achieve what we desire. To constantly think the grass is greener if......., that is what keeps us unhappy and unfulfilled. \n\nRemember, when you were a kid. Days were as they were. Sometimes boring and sometimes not. We accepted them as they were. Why? Cause we didn't know better. We didn't compare our lifes and constantly tried to fix stuff! \n\nBe like that and break the cycle! If not, one they you will be old, and all you did was chase mirages!! THIS is YOUR LIFE, right now, right as it is! ",
    "score": 3,
    "url": "",
    "created_utc": 1744492653.0,
    "author": "Annchez16"
  },
  {
    "title": "Subtle sinus/face pressure after 6 months of Shamatha practice — prana-related?",
    "body": "Hi everyone,\n\nOver the past 6 months, I gradually increased my Shamatha meditation to about 2 to 2.5 hours per day, split between morning and evening. Recently, I’ve **reduced it to just 15 minutes** because I started feeling a **strange pressure in my face/sinus area**.\n\nIt’s not congestion or physical pain—more like an **energetic swelling or pulling**. The sensation can feel strong, but when I touch the area, there’s **nothing physically wrong**. It’s **much stronger in the evening**, especially when I’m tired. I fall asleep easily and wake up without the sensation—but it returns the moment I **pay attention** to it.\n\nI wonder if this is related to **pranic imbalance** from deepening practice. I don’t do pranayama or visualizations—just **4 applications of mindfulness**.\n\nHas anyone experienced something similar?   \nAny input, experiences, or advice would be really appreciated. Happy to answer questions if more detail helps.\n\nThanks so much 🙏",
    "score": 3,
    "url": "",
    "created_utc": 1744466324.0,
    "author": "Old_Alternative_8288"
  },
  {
    "title": "No BS meditation help",
    "body": "Hello Guys,\n\nI am 33 M and I have studied all there is to understand meditation and why I need it. However I have read so much that it has become super complicated. I don't know where to begin! \n\nI need a no BS SIMPLE guide to begin meditation, please help! ",
    "score": 3,
    "url": "",
    "created_utc": 1744463143.0,
    "author": "Dangerous_Yak7138"
  },
  {
    "title": "New feeling of empty mind",
    "body": "I wanted to understand more about a \"weird\" event I had last week. I have not been meditating for some time, but I generally am in a balanced mood and I \"introspect\" a lot. My brain won't stop working though (ADHD and everything). I don't take any ADHD medication.\n\nNormally, I need to get very tired mentally to be able to go to sleep. If I do, I can fall asleep in 10 minutes or so, but that means I have to go to bed at 3 or 4 am (luckily, I work from home, so I can get up later than if I had a job).\n\nWell, some nights ago, I experienced for the first time a feeling of an empty mind. No thoughts, no worries, nothing. For a second, I noticed that I wasn't thinking about anything. It felt new and exhilarating in some way. The feeling lasted for maybe 3-4 seconds.\n\nI don't know if it was a pre-sleep brain pattern or something? I just know that it felt \"Wow, I have no thoughts\", which I know sounds odd, but for someone who even overthinks their overthinking felt liberating.\n\n",
    "score": 3,
    "url": "",
    "created_utc": 1744404714.0,
    "author": "ADF21a"
  },
  {
    "title": "I need help",
    "body": "Hi, I’ve had the 3 year from hell and I’ve now started to take control of my life and I’m getting better and better each day but I feel the need to have some meditation to really help my recovery and feel the way I want too, can someone please just tell me the very first step (or second after joining this subreddit) I am riddled with depression and anxiety but was not always this way and would love to return to the hard working, risk taking person I was before. TIA ",
    "score": 3,
    "url": "",
    "created_utc": 1744402493.0,
    "author": "RepublicTypical"
  },
  {
    "title": "Grief and meditation",
    "body": "I lost my wife very suddenly 9 weeks ago today, and for the last 4-5 weeks have been meditating every morning for 20 minutes or so as a way to ground myself with my feelings and help process the grief. I’ve been experimenting with different teachers and guided meditation through podcasts and apps, and have found Tara Brach and Raphael Reiter to be helpful, but have only found a few episodes that deal with grief specifically. \n\nIs there a teacher who specializes in this? Or, is there a practice that might be focused on grief and loss? \n\nSecondly, I find myself crying and sobbing while meditating. I’ve been doing this all the time of course when not meditating, but I don’t know how to meet this strong emotion and physical response while focusing on the present. If I lean into it my focus is gone completely and I fall apart, if I push past it, it doesn’t feel like the appropriate response. Sometimes I’ve let it happen and just felt the emotion and tears; let my focus go to the feeling of warm tears falling and drying in my face, but during a guided meditation I’m interrupted by the direction of the teacher. \n\nThanks, any advice is appreciated. ",
    "score": 3,
    "url": "",
    "created_utc": 1744390709.0,
    "author": "doyouknowwatiamsayin"
  },
  {
    "title": "What is this feeling?",
    "body": "I’ve been meditating for a while now and very recently (today) a few times during my session I felt like I’m on the verge of slipping into a much deeper state. Like hitting a transition phase. Right when I'd feel it, my stomach would get that \"drop\" feeling and then that transition phase goes away. Best way I can describe it is like being aware you're falling asleep and coming back (of course while fully aware, not sleepy) It’s not blissful, just a weird shift, like I’m about to cross into another level of consciousness. Like I was about to enter an intense deeper state. ",
    "score": 3,
    "url": "",
    "created_utc": 1744388825.0,
    "author": "AmazingCable1068"
  },
  {
    "title": "An unusually nice sensation",
    "body": "In my last few sits, I’ve felt something like an air bubble or like what it feels when we crack our knuckles, but near my throat region, on the inside. It’s such a strangely feel-good sensation, and I just wanted to share this here.\n\nI can kind of feel a very subtle movement in energy going up my chest, and then a very small little crack or a bubble bursting sound and feeling around my neck/throat, and that’s it. Maybe twice too in a session. But yes. This has been happening a few times and it feels really good, I don’t know why.\n\nAnybody here with a similar experience? Or perhaps an explanation?\n\n",
    "score": 3,
    "url": "",
    "created_utc": 1744371493.0,
    "author": "ShroomSoupy"
  }
]