[
  {
    "title": "USA Women's Half Marathon-Nashville (2025) Review",
    "body": "Hello all. I just ran the USA Women's Half Marathon in Nashville on April 5, 2025 and wanted to leave an honest review since the leadership is deleting comments on their social media posts. It seems like this organization is known for their poor logistics and courses but I'm going to lay out what happened this past weekend and why it's not ok for it to cost almost $200. It's also a USATF Certified course- that distinction needs to be rescinded.\n\n1. **Poor/no communication:** Some people received updates via text, some via email, some not at all. I personally received emails that were about the hotel accommodations and very few about the race updates.\n2. **Updates that were not shared via email, only on social media (if at all): Advertised VS. Actual**\n   * Course time limit: 6 hours VS. 3.5 hours\n   * Premiums: Lululemon Shirt and Kendra Scott necklace VS. unknown/generic brand shirt and necklace (in place of the Lululemon shirt, racers received a tee shirt and a long sleeve). The women's shirt was a boat neck that quite a few people seemed to dislike.\n   * Leadership changes\n   * Start time: 7am VS. 6:30am\n3. **The Expo:** this was a very underwhelming and disappointing expo. There were only a couple vendors and one tent that had merch. If this was such a big race as advertised, why would you not have more vendors or tables with nutrition that runners could purchase?\n4. **Start Line was unorganized and lack luster:** Upon arrival, cones and barriers were still not set up. There was no MC or music, just a start line inflatable. There were no announcements or lead-up, just the national anthem a few minutes before start and then we started the race. Ordinarily, this wouldn't be a big deal, but it was advertised as this big event to celebrate women. You'd think that they would have mentioned at least the mission statement of the organization or called attention to the \"women's\" aspect of the race. The volunteers guiding people were a little cranky, too. It seemed thrown together and last minute.\n5. **Poor safety for runners:** Upon arrival, barriers were lying on the ground and crews came out after the race started to set up cones. This posed a safety threat to runners. Cars were confused about where the runners should be and the course had limited volunteers to help guide. There also need to be more cones. Volunteers were stopping runners to let cars go which should NEVER happen during a race unless there is an emergency.\n6. **The course:** This was the worst half marathon course I have personally ever run. The section on the trail was fine, but the rest was in parking lots. The parking lots at the end didn't even have cones set out and we were just expected to \"run the perimeter\"- how is that going to get close to a 13.1 mile distance? That being said, the course was under 13.1 miles. This is a national marathon and USATF-certified, did no one bike the course to make sure it was the correct distance? At one point, runners were expected to share a 4-foot wide sidewalk, going in two directions, that had trees encroaching on it. There weren't even any crowds.\n7. **The course (again):** I wanted to break this out because it has to do with the directions and lack of signage. There were so many turn-arounds in the course and at one point, you have to turn left at a location where the is a sign pointing to go right. Only because a volunteer eventually made it out to the cross over point, did runners know to go left but there was an instance of two runners who cut the course (on accident), only ran 12 miles, and made podium. That's unfair and not to USATF regulations. Plus, who crosses runners over each other so many times?\n8. **The finish line:** The finish line was lack luster. I won't comment on this too much since it was pouring rain.\n\nI'm sure there are other things that I'm missing, but I wanted to highlight things to make clear that this race is a scam. I have run over a dozen half marathons and have not had such a bad experience for so much money. If this race had cost $50, I would not have minded as much but it's a scam. It's advertised as luxury and pampering and none of that happened. My local half marathons are more \"Luxurious\" than this one. There was not much transparency in the changes and who knows what happened with the leadership but there were a lot of missteps.\n\nThis should have been a celebration of women running together and uplifting one another.\n\nIf you ran this half and had a good time, I'm so happy for you! But please believe me when I say there are so many other good half marathons you can run that cost less, are more fun, and are on better courses. Please do not run any other USA Women's Half Marathons- save your money!\n\nEdited for spelling errors.",
    "score": 253,
    "url": "",
    "created_utc": 1744121288.0,
    "author": "No-Nefariousness8508",
    "permalink": "/r/running/comments/1juefxv/usa_womens_half_marathonnashville_2025_review/"
  },
  {
    "title": "Effort comparison: Couch to 1st Marathon vs 1st Marathon to Ironman",
    "body": "I know this might be a bit of an odd comparison, but I’m curious how others would describe the difference in effort between these two paths:\n\n* Going from *couch to your first marathon*, vs\n* Going from *having completed your first marathon* to completing your *first full Ironman*.\n\nI imagine they’re tough in different ways, but I’d love to hear personal takes on which felt more challenging — physically, mentally, logistically, etc.\n\nBonus points if you've done both!",
    "score": 150,
    "url": "",
    "created_utc": 1744140162.0,
    "author": "Full-Lime3640",
    "permalink": "/r/running/comments/1jum3uw/effort_comparison_couch_to_1st_marathon_vs_1st/"
  },
  {
    "title": "First marathon sub 5 complete - Brighton Marathon (34F)",
    "body": "Hi all - I finished my first marathon in 4:50, within my goal of 5 hours, which was awesome! I thought some other first timers who are aiming for around 5 hours would be interested in my training and my experience.\n\n### Race Information\n* **Name:** Brighton Marathon\n* **Date:** 6th April 2025\n* **Distance:** 42.4km\n* **Location:** Brighton, UK\n* **Website:** https://www.londonmarathonevents.co.uk/brighton-marathon-weekend\n* **Strava:** https://www.strava.com/activities/14098582527\n* **Time:** 4:50:41\n* **Age:** 34\n* **Gender:** Woman\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Start &amp; Finish | *Yes* |\n| B | Sub 5 hours | *Yes* |\n| C | Sub 7min/km (4:55) | *Yes* |\n\n### Splits\n| Kilometre | Time |\n|------|------|\n| 1 | 7:05\n| 2 | 6:26\n| 3 | 6:46\n| 4 | 6:39\n| 5 | 6:33\n| 6 | 6:27\n| 7 | 6:29\n| 8 | 6:30\n| 9 | 6:39\n| 10 | 6:34\n| 11 | 6:55\n| 12 | 6:35\n| 13 | 6:38\n| 14 | 6:56\n| 15 | 6:48\n| 16 | 6:51\n| 17 | 6:48\n| 18 | 7:02\n| 19 | 6:26\n| 20 | 6:47\n| 21 | 6:44\n| 22 | 6:33\n| 23 | 6:44\n| 24 | 6:31\n| 25 | 6:46\n| 26 | 6:51\n| 27 | 6:46\n| 28 | 6:50\n| 29 | 6:49\n| 30 | 6:53\n| 31 | 7:03\n| 32 | 7:05\n| 33 | 7:03\n| 34 | 7:10\n| 35 | 7:06\n| 36 | 7:30\n| 37 | 7:21\n| 38 | 7:07\n| 39 | 7:24\n| 40 | 7:43\n| 41 | 7:20\n| 42 | 7:01\n\n### Training\nI started a 16 week sub-5 marathon training plan from Runner's World back in November, taking a 3 week 'break' for a trip to NZ over Christmas (just continuing to run as often as I could while travelling), then repeating a couple of weeks when I got back to then catch back up with the schedule. It worked really well for me, but at one point I was unsure if I was doing enough and asked for advice on Reddit, which was a mistake. I was told I was not doing enough volume at all. Turns out that was wrong!\n\nI was doing 3 runs a week: one easy, one intervals/tempo and one long run. And then optionally a 4th run, normally a parkrun, if I was having a good week. I know the wisdome is that 4 runs should be minimum for marathon training, but this was what I was able to fit in and what I felt comfortable committing to. I maxed out at 30.5km for my long run, four weeks before the race, which took me 3 hours 40 mins. Where I live is very hilly, so I knew that my training runs were always going to be much harder than the race, which was good.\n\nI probably should have done one more long run with 3 weeks to go, but I had a niggle in my knee and was also on my feet a lot rehearsing for a show. So I decided against it in order to avoid injury. I was nervous all during taper that I'd messed things up by not doing that long run. But I had to convince myself that missing one run wasn't going to make or break the months of training before tha.\n\nOn top of the running, I did one strength training session at home per week, focusing on legs, core and ankles. Occasionally I did a yoga session too. And most weeks I went to Zumba. I was meant to swim each week as well, but basically didn't.\n\n### Pre-race\nLots of pasta and bread in the 2 days before! My husband was also racing, so we stayed in a tiny old cute hotel within 10mins walk of the park where the marathon started, and had a nice Italian meal the night before. We were able to have a relaxed morning with our start times of 9:45 and 10:28 respectively - even doing our last loo stops in the hotel! I got pretty nervous when I walked into the park and saw how huge the event was and how many people there were. But I breathed and calmed myself down before my wave was called.\n\n### Race\nI was aiming to stay between 6:45 and 7:00 min/km in order to hit my goal time. There were kms in the first half where I went faster than this, but I was using my body to tell me what was feeling good, and often these were downhill kms. So I don't think I went too fast at the start. I also knew that since this was my first marathon I was definitely going to slow down near the end whatever happened, so banking at least some time made me feel better. Essentially for the first half I was just making sure that each km felt like the same level of easy effort.\n\nI had support from my family all through the first third in the centre of town which was so nice. And then we headed out of town along the coast to the East, and, although it was uphill, it was beautiful and I was still feeling good. Turning around at 18km and seeing the cliffs and then running downhill back into Brighton was amazing. The middle section down by the sea from 24 to 28km was pretty tedious as there was minimal support. The day was also very very sunny, and there was no shade or relief from the direct heat.\n\nIt was almost comical that exactly at 30km my knee started hurting, and I definitely slowed down. But the slowdown wasn't too bad - I wouldn't say I hit 'the wall'. I stayed in the 7 mins\\km rather than ever going up to 8. After 35km things got worse and I really had to dig deep and force myself to believe I could do it, pushing through the exhaustion. But once I got to 40km it seemed doable, and I just went for it. I was SO HAPPY to come in well under 5 hours, which had been my main goal for the whole of training! And I didn't walk or stop at all either. Coming across the line I just cried - I never thought that in my life this is something that I would achieve.\n\n### Nutrition\nI took a 30g carb gel or chew every 35 minutes (Precision Fuel) and had an electrolyte/carb mix in a water bladder to drink whenever I wanted. I carried 1.5l but only drank just over 500ml, so carried an extra kg all the way round for no reason! I was also drinking every electrolyte drink they gave out round the course and mostly using the provided water to cool myself down. I didn't need the loo at all on the course and my stomach handles gels and chews just fine.\n\n### Post-race\nImmeditely after the race I staggered to get my medal, cried a bit more, found my bag and then sat down near a meeting point hoping that my family would find me. My husband had finished in an amazing 2:57 (a PB for him) and so we both crashed. We had to get a minibus back to our park and ride, but eventually drove our way to a pub, where I tried to drink half a pint, and successfully ate most of a fish and chips. My husband was not so lucky and was feeling pretty ropey - he threw up a couple of times on the course and his stomach wouldn't handle any food even a few hours after. He eventually felt better at about 9pm and ate his pub lunch leftovers.\n\nToday I am working from home on the sofa, in my dressing gown, with my medal on. As little movement as possible is happening.\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
    "score": 144,
    "url": "",
    "created_utc": 1744046804.0,
    "author": "schmauften",
    "permalink": "/r/running/comments/1jtqx6v/first_marathon_sub_5_complete_brighton_marathon/"
  },
  {
    "title": "Zone 2 Training: Benefits Beyond Running?",
    "body": "For those of you who’ve been doing Zone 2 training consistently, have you noticed any improvements beyond your running performance?\n\nI’m especially curious about things like energy levels, sleep quality, recovery, mental clarity, resilience, or anything else that’s changed for the better. And how long it took for you to notice. \n\nWould love to hear your personal experiences!",
    "score": 95,
    "url": "",
    "created_utc": 1744282057.0,
    "author": "flo00000",
    "permalink": "/r/running/comments/1jvux5c/zone_2_training_benefits_beyond_running/"
  },
  {
    "title": "Cheap Marathon, Huge Value",
    "body": "### Race information\n* **What?** 2025 Cheap Marathon\n* **When?** April 5, 2025\n* **How far?** 26.2 miles\n* **Where?** Derry, NH\n* **Website:** [https://www.millenniumrunning.com/cheapmarathon/](https://www.millenniumrunning.com/cheapmarathon/)\n* **Strava activity:** [https://www.strava.com/activities/14088815423](https://www.strava.com/activities/14088815423)\n* **Finish time:** 3:22:35\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Redeem Tokyo (3h 39m 25s) | *Yes* |\n| B | Set/Match PR (3h 25m 00s) | *Yes* |\n\n\n### Splits\n| Mile | Time |\n|------|------|\n| 1 | 7m 24s |\n| 2 | 7m 33s |\n| 3 | 7m 26s |\n| 4 | 7m 20s |\n| 5 | 7m 33s |\n| 6 | 7m 20s |\n| 7 | 7m 20s |\n| 8 | 7m 34s |\n| 9 | 7m 28s |\n| 10 | 7m 33s |\n| 11 | 7m 32s |\n| 12 | 7m 25s |\n| 13 | 7m 32s |\n| 14 | 7m 42s |\n| 15 | 7m 48s |\n| 16 | 7m 46s |\n| 17 | 7m 34s |\n| 18 | 7m 42s |\n| 19 | 7m 42s |\n| 20 | 7m 54s |\n| 21 | 8m 00s |\n| 22 | 8m 06s |\n| 23 | 8m 27s |\n| 24 | 8m 18s |\n| 25 | 8m 25s |\n| 26 | 8m 05s |\n| 27 | 2m 06s |\n\n### Training\nI registered for this in ’24, and had my “standard” training before then. Over twelve weeks or so, I tried to make my longest run in a week go farther than the one two weeks before. Then I would “hold” for four weeks alternating at 18mi and 14mi before tapering from 22mi to 10mi in the last four weeks before. Other runs would be mostly casual, attempting to go distances and times without looking too much on milage. I averaged about 40mi/wk. Unfortunately, *last* year they postponed for two weeks for a freak blizzard, *then* I suffered a fall in the gym earning a rib contusion. I deferred to this year. For this year, after registering, I learned I got into Tokyo, which ended up sorta becoming my long-run in the taper down as mentioned. (Note: I did not perform well in Tokyo, a developing cold and dehydration from poor nutrition on vacation may have been the culprit for a my time.) I clocked 3h39m in Tokyo this March, hit a 1h32m at the NYC Half two weeks later, then suffered food poisoning a week after that.\n\n### Pre-race\nAbout two days before, organizers published a livestream explaining the race and unique start procedure. The bib number and my precise start time – 7:46:08AM – was also revealed, more on this later. Millennium Running in Bedford, NH, played host to the packet pickup. Everything was quite smooth, no additional tools nor ID’s needed for pickup. To quote the organizer, “if we have people stealing bib numbers for this race, we got larger problems in society.” It was easy to pick up the bib and I bought some swag, at a reasonable US$20. Nutrition-wise, it’s a carbohydrate heavy two days before the race, with lighter portions the day before to prevent bloat. Bagels, coffee, whey, yogurt, bananas, chicken parm, jelly beans (tons)…\n\nFor some reason, last night’s chicken parm decided to have a little revenge. I added Pepto to my pre-race nutrition (two bagels, one banana, 3Tbsp peanut butter; 4 Gu for the course, 4 electrolyte tabs, 20fl oz H2O).\n\nThey do have bag check at this race, though since you’re parking relatively close to the starting area anyway, you don’t need to check much if anything. I arrived to the area at 6:40AM or so, and found street parking easy (for *that* time of day).\n\n### Race\nThe start procedure is \"time trial inspired.\" Everyone is seeded based on what time they input as a predicted finish time during registration. (Launching separated pairs of runners with near-enough pace expectations prevents dodging, weaving, and crowding on the course’s narrow bike path.)  The last two digits of your bib are your \"cone number,” the first two digits are your group. The first pair of the first group (e.g. bibs #101 and #102) start at the same time, seven seconds later the next pair (#103, #104) go, and so forth, hence the specific start – be in your group ten minutes before and get to your cone when they call your group up! Seconds before you're up, your name shows up first as “on deck,” then on the LED board with huge letters and countdown timer. 3..2..1.. go, drag race style.\n\nThis made it really easy for me to get into the race groove, as I had someone next to me already with a  relatively identical pace. It also meant there was a little bit of a gap to the people ahead, and virtually no clumping on a narrow rail-trail course.  I was jiving along, running at about 7:30/mi (4:40/km).\n\nThe course was a paved out and back rail trail, with four police-protected road crossings. Marathoners traverse it twice. While the trail was indeed narrow, it was still easy to get around. Mind the rare small cracks and divots in the pavement, which could trip you up. Scenery was woods-like, as one could expect for New England, which even in the budding of springtime with brown trees and patches of ice on rocks was still a spectacle to behold. There is a hairpin turn around mile 6.1 into the lap, there was no congestion for me, yet I fear I tripped the person next to me? No one fell? The path undulated slightly, with sensations of going “uphill both ways/.” Certainly not “pancake flat” – [Jim Thorpe Area Running Festival Marathon](https://www.reddit.com/r/running/comments/135h5ym/jim_thorpe_area_running_festival_marathon_2023/) holds that record!\n\nWater stops were about 3-ish miles apart, and the cold weather (30’s F with wind chill) and gray skies did not dehydrate me as I was sapped in Tokyo. Still having the extra water with me did help. (Unlike Tokyo, runner-carried hydration is allowed alongside nutrition, just make sure to throw away your trash in the appropriate bins on course.) They supplied both water and Gatorade at all stops, with Gu chews also available at about miles 3/9/15/21. By this point, I took my own Gu gels at miles 3, and 8. At mile 12, I was feeling good, my hamstrings were getting a good burn. The only sizable hill occurred on the northbound side of that turnaround. \n\nFull marathoners exited right from the trail at mile 12.5 to complete a street loop and go south through the course again. Half-marathoners were launching at this time, now 14-seconds apart. (The pace of those runners was timed to approximate the pace of the marathoners starting their second loop. Again, masterclass in coordination.) My third Gu went down easy at mile 13.5. Around mile 15/16 I felt some cramping wanting to start, and had two electrolyte tabs. My fourth Gu – chocolate coconut! – came around mile 18 or so. My pace started to slip since the start of lap 2, and only dropped 20s/mi (12s/km) by the end. The gradual hills bit me. \n\nAt the end of loop 2, marathoners turned right to finish the course. That hill somehow did not feel as steep as on loop one, and I dumped what I had in the final 200m.\n\n### Post-race\nThe announcers were energetic and appropriately funny, for example referring to a runner’s home state of Ohio as “national champion Buckeye’s home.” After crossing the line, you get your ribbon – no medals here, but it’s still highly unique. They offer bananas, yogurt packs, pretzels, and so forth. Aid is immediately available (as it was on course), as were post-race photo ops in front of “I BQ’d” signs and a PR bell to ring. I finished with a personal best, shaving 2m 25s off my previous mark. \n\nFrom there, I lingered around for a half hour to do some shopping at the vendors there before headed back home. I realized that I felt *really* good. My hydration may have been on point, my nutrition was likely spot on. No cramping, no headache, no nausea. Credit may go to a high high protein diet for the two weeks before and focusing on simple carbs. The lesson learned from Tokyo is to force and monitor water intake the week prior to a race.\n\n### TL;DNR?\nGreat organized race with time trial start, be sure to watch the livestream/replay the days beforehand to get an understanding of start procedure. Expect cool weather, great support, and an exceeds-expectations on value for dollar. Plus, there are a few of local diners and coffeeshops at which to buy yourself treats afterwards.\n\n\n*Edit: Clarified grammar in some parts.*",
    "score": 67,
    "url": "",
    "created_utc": 1744025445.0,
    "author": "shmajent",
    "permalink": "/r/running/comments/1jtj04g/cheap_marathon_huge_value/"
  },
  {
    "title": "Setting Realistic 5k Goals",
    "body": "I'd like to set a 5k goal for the year, shooting to hit the pace in October, but I'm not sure how to figure out what would be a reasonable target. I'm not very connected to the running community, and I'm not even sure what information someone would need to help me figure out a goal.\n\nI'm 40. I usually only run about 6 months out of the year, running 3 or 4 times a week. I'd like a goal that assumes good consistency but that wouldn't have to become my whole life's focus for the year.\n\nI'm starting off this year in a little better shape than usual. In other years, I'd be struggling to stay under 30 minutes in early April, but yesterday's 5k was 27:33.\n\nThese are my best paces from the last few years:  \n2020: 27:15  \n2021: 27:03  \n2022: 28:15 (I was really into swimming that year)  \n2023: 25:34  \n2024: 24:50\n\nLast year was the first time I had a specific target, and I feel like it helped with motivation. Is this enough information to help figure out a goal?",
    "score": 67,
    "url": "",
    "created_utc": 1743968981.0,
    "author": "TomOW",
    "permalink": "/r/running/comments/1jt2ri7/setting_realistic_5k_goals/"
  },
  {
    "title": "More than a PB; success at Berlin Half Marathon",
    "body": "### Race Information\n* **Name:** Berlin Half Marathon\n* **Date:** April 6, 2025\n* **Strava:** https://www.strava.com/activities/14094966727\n* **Time:** 1:26:35\n\n### Goals\n| Goal | Description | Completed? |\n|------|-------------|------------|\n| A | Negative splits | *Yes* |\n| B | PB | *Yes* |\n\n### Splits (manual by markers)\n| Kilometer | Time |\n|------|------|\n| 1 | 4:04\n| 2 | 4:10\n| 3 | 4:13\n| 4 | 4:12\n| 5 | 4:11\n| 6 | 4:00\n| 7 | 3:58\n| 8 | 4:03\n| 9 | 4:01\n| 10 | 4:05\n| 11 | 4:05\n| 12 | 4:05\n| 13 | 4:05\n| 14 | 4:06\n| 15 | 4:10\n| 16 | 4:10\n| 17 | 4:10\n| 18 | 4:12\n| 19 | 4:08\n| 20 | 3:55\n| 21,1 | 4:25 (3:58)\n\n### Backstory/Training\nTwo years ago my brother’s widow suggested we should run Berlin Half Marathon together. It’s almost quaint, [reading that race report again](https://www.reddit.com/r/running/comments/12dmtve/berlin_half_marathon_the_best_two_hour_therapy/), but the short version is: I had no idea what I was doing, ran a 1:55 without any proper training or a gps watch, but it was quite emotional to run that race and afterwards I got seriously bit by the running bug. This year, like last, my sister in law T brought along her kids and some more family members to run and cheer for us in Berlin. \n\nThroughout last year I had some really lofty goals and I failed miserably at all of them; even though they were PBs I was a bit disappointed with two half marathons at 1:34:XX and Stockholm Marathon at 3:34. All three of those races were quite hot (over 20°C at the start), and I simply wasn’t prepared to run in those conditions, but it still felt a bit shitty to fail in the same way all three races; keep perfect goal pace (4:15 and 4:40, respectively) for the the first half of the races then bonk completely in the second halves. \n\nSo my goal at Berlin this year was simply to run a negative split. Not bonk. People who know I care about running asked me what time I was aiming for, but I didn’t want to say a number. My Garmin race predictor has lied to me before, so I just said I wanted to run a negative split. I’m in the middle of a Pfitz 18/55 marathon plan for Stockholm Marathon in late may, and I’ve felt really good on my long runs, but still; the goal here was just to execute the race well, and do the second half slightly faster than the first half. I just wanted to run a race properly, for once.\n\n### Pre-race\nI combined the trip to Berlin with a visit to some friends who live in Prague. My wife and one year old daughter got to spend four fantastic days walking up and down the hilly cobblestones of Prague: not an ideal lead up to a street race, but what the hell… I don’t know how many more trips like this I’ll be able to do. We took the train to Berlin on Saturday morning, a bit ironic as the Prague HM was that same day. \n\nOn race day I was surprisingly calm. My daughter slept through the night and I got a solid 8 hours. Weather report had really been on my side here; unlike the 23°C of 2024, the the forecast for our race was 4-8°C partly cloudy. I wasn’t sure what to wear and my family seemed shocked when I was getting dressed in my singlet; but in the end I was happy that’s what I chose. It’s also the only pink thing I have to run in, for my brother.\n\nIn the starting corrals I saw people dressed for what looked like arctic expeditions; scarves, long sleeves, long running tights…. Maybe us Swedes are more used to cold running but I always run in shorts if it’s above 0°. My current fitness should probably have me in corral A, but my PBs had me placed in corral B, which I’m actually quite happy about; I got to the corral early and made sure I was at the front of my group. For the first time since I started running, I wasn’t nervous at all at the starting line. This was going to be FUN.\n\n### Race\nBeing at the front of corral B was perfect because it kept me from going out too fast. It seemed like people around me were maybe rushing a bit, some were breathing quite heavily early on but I was super comfortable at around a 4:10 pace. Now… I know I said I didn’t have a time goal, but since I was treating the whole thing as training for the full marathon coming up, I had set up my watch for a 1:27 pace. The idea was to do the first 10k at around 4:10 and the second half around 4:05. This was conservative in relation to my Garmin race predictor (but like I said, it’s always been optimistic for me before). \n\nAfter leaving Tiergarten, the first 5k or so were pretty crowded and on relatively narrow streets. I ticked a couple of Ks above my target pace but kept my cool. I thought to myself, and even said out loud: ”this is fine…. I have 15k left to make up those few seconds, and it will make it even easier to make my negative splits. I had decided before the race to feel out my need for drinks, and at the first station there was a huge rush to grab a cup: I saw it from far ahead and decided it wasn’t worth it to go into that mess and skipped it. I wasn’t thirsty and it wasn’t hot, I would be fine without. \n\nAt around 6K the course deviated a bit from previous years, and we just had a long, amazing stretch of slightly downhill, very wide Kurfurstendamm for about 3 kms before we hit Kaiser Wilhelm Church where I knew my family was set up to cheer for us. This part of the race was such a high point for me. I wasn’t even close to getting tired, my legs were feeling great and I was *holding back* at around 4:00 pace. I got a little energy boost after my family all cheered for me around 9k and then had a bit of a shock when I clocked the 10k split faster than my 10k PB (41:20 from another disappointing race last year). I had a half a cup of water here for the hell of it. I don’t think it was needed but it was there and there was no rush of people around me so I don’t think I lost more than a handful of seconds doing it.\n\nAfter that I got a little bit worried that it was going to happen again, that the first half had felt so amazing and the inevitable bonk was coming. But instead of panicking I just calmed down, took stock of how I felt and came to the conclusion that it was still going according to plan, if slightly fast. Around Potsdamer Platz it got quite windy and some gusts felt like they came head on, but I knew from previous years that it would get better in Mitte, and kept my cool. For the last bit of the race, the course was quite different than last year, when we had done a bunch of zig zag for a bit through central Berlin; this year we had a 4 km out and back on a wide street… some runners I talked to hated this part but I kind of loved it. Yeah, it got quite windy there again and it was a bit confusing because it felt like it just kept going, but I also get really inspired seeing really fast runners (almost elite) in the same race as I’m running. If I had been in corral A I probably would’ve met the front pack here. \n\nAfter that section and a little twist around Alexanderplatz, we got to Unter Den Linden and the finish line was in sight, but with 2 km left to go. I didn’t want to look at my watch, so I just reminded myself of what the last 2 km on my way home on a regular tempo day feels like, how silly short it is, and decided to kick it. It wasn’t a sprint, it wasn’t even *that* much faster than the rest of the race, but it just felt **so good** to have a little speed left in the tank. I did the last 2,1k at about 3:55 pace and those last 100 meters after Brandenburger Tor were just pure joy. I don’t know if I cried but I certainly laughed as I crossed the finish line well under my Garmin pace, and with a slightly negative split. \n\n\n### Post-race and reflections\nI don’t know what to say here. After four really disappointing races last year I finally managed to perform, execute, whatever you want to call it, the way that I had set out to. I know this comes with experience, and I certainly have more now than I did last year. But I also have to remember this feeling going into my A race in seven weeks. \n\nI think that what I’m most proud of in this race was just the way that I kept my cool in the little wrinkles that came my way. I saw some of my splits be a little slow, and decided that was fine. Later on I noticed I was going too fast and still decided that I was feeling strong. I think I also realized that what works for me is to say my thoughts out loud. It made them more concrete somehow, rather than just something I was thinking about. \n\n—\n\nI remember one time when my brother had managed one of his big goals in running; a sub 2:48 marathon (4:00/k pace), after many many attempts. This was way before I started running so I didn't really *get* it, but I just remember how he was just so happy that whole day, and for weeks after. I think this was the first time I felt that way after a run. I really enjoy running but the high of executing a race the way you wanted is new for me. And I haven’t been this happy at a finish line since that first half marathon, two years ago, which was very emotional in a different way. It makes me sad, of course, that I won’t share that feeling with him, but it meant so much to share it with his (and my) family; everyone was super happy with their results, almost everyone had a new PB, and I think most impressive was his daughter, aged 17, who lowered her PB by 15 minutes. \n\nIt seems that Berlin HM will be a lottery race starting next year, so I don’t know if we’ll be able to race it as a family again. But we have our sights set for something else next year…. It seems like Prague is quite likely. I can’t wait. \n\nBut before then…… Stockholm Marathon in 7 weeks. I'll have to temper my hubris.\n\n\nMade with a new [race report generator](http://sfdavis.com/racereports/) created by /u/herumph.",
    "score": 54,
    "url": "",
    "created_utc": 1744122304.0,
    "author": "stenskott",
    "permalink": "/r/running/comments/1juetwr/more_than_a_pb_success_at_berlin_half_marathon/"
  },
  {
    "title": "Do you all adjust your sleep schedule or move your training runs earlier ahead of a marathon?",
    "body": "Just curious... I'm going to do my second marathon at the end of the month and the bus leaves for the start line bright and early at 4:30am.  Is it worth it to adjust my sleep schedule and training runs a week ahead of time so that I'm waking up at 4am and running by 6am? Thanks in advance for any advice or tips on the best way to do this ",
    "score": 45,
    "url": "",
    "created_utc": 1744301092.0,
    "author": "Bonnelli72",
    "permalink": "/r/running/comments/1jw1jv7/do_you_all_adjust_your_sleep_schedule_or_move/"
  },
  {
    "title": "Optical HR sensors vs Chest strap on darker skin",
    "body": "I'm a dark skin black woman, 25, 5”2, 55kg and I run around 4-5 times a week.\n\nI used the apple watch SE for 4 years before upgrading to the Garmin 265s in February of this year. My main reason for leaving the apple eco system is that I was convinced my heart rate was just so off. \n\nWhenever I would race a 5k my average heart rate would be 200bpm (about 3-5bpm off my max heart rate) and around 180-198bpm on most other runs. Obviously this is very high and I was convinced I was fitter than this.\n\nI've seen a slight improvement since switching to garmin. With an average HR of 166bpm on an easy 10mile run.\n\nI've seen some people on here say they only noticed a discrepancy of around 5bpm when using a chest strap compared to an optical watch sensor. I've assumed that most of the people in these discussions are fairer skinned.\n\nTL/DR\nBasically my question is, for other black people, have you noticed a difference in the heart rate measurement when using a chest strap compared to a watch?\n\nObviously non-black people feel free to weigh in with your own experience and expertise!",
    "score": 45,
    "url": "",
    "created_utc": 1744035420.0,
    "author": "PreviousCaptain1758",
    "permalink": "/r/running/comments/1jtmbdy/optical_hr_sensors_vs_chest_strap_on_darker_skin/"
  },
  {
    "title": "Berlin Half Marathon Race Report",
    "body": "# Race Information\n\n* **Name:** Berlin Half Marathon\n* **Date:** April 6, 2025\n* **Distance:** 13.1 miles\n* **Location:** Berlin, Germany\n* **Time:** 1:43:21\n\n# Goals\n\n\n\n|Goal|Description|Completed?|\n|:-|:-|:-|\n||\n|A|Sub 1:40|*No*|\n|B|Sub 1:42|*No*|\n|C|PB (old PB 1:44:16)|*Yes*|\n\n# \n\nSplits\n\n|KM|Time|\n|:-|:-|\n||\n|5|00:24:53|\n|10|00:49:14|\n|15|01:13:34|\n|21.1|01:43:21|\n\n\n\n# Training\n\nI started training for this race in the middle of December last year after finishing a 5k race plan. I've been using Runna for all my training plans for the past few years.\n\nI signed up for the Berlin Half marathon around 11 months ago, setting my sights on a SuperHalfs medal after finishing London Marathon last year. Runna predicted I'd be able to complete the Berlin Half between 01:37 and 01:41 with a goal km split of 4:40.\n\nI hit the required splits pretty much consistently across all my training runs, barring two key long runs at race pace where I wasn't able to hit 4:40 pace (both runs had two 6k blocks with easy miles in between). One of those was on a particularly windy day on vacation where my selected route was also hillier that I anticipated, the other I attributed to old running shoes but I could also be distracting myself from the fact that maybe I wasn't fit enough.\n\nI'm pretty familiar with Runna and the programs it offers so there was nothing out of the ordinary/nothing I wasn't used to. I did four runs a week and had their strength training built into my running plan as well. Mileage peaked at around 60km across several of the weeks in the plan.\n\nI generally slept pretty well over the course of the training block, with the exception of a couple days before race day due to travel to Berlin.\n\n# Pre-race\n\nI started getting a bit nervous about race day on the day I went to the expo (Friday), but I was able to keep the nerves at bay somewhat over the course of Friday by doing some sightseeing and seeing some friends who lived in Berlin. We went to an improv show in the evening, which basically quelled my nerves for the next couple of days. Saturday was also a pretty nerve-free day, again doing some sightseeing to pass the time and take my mind off things. \n\nI started to get nervous on race morning, which I know is normal, but the nerves were caused by my Garmin morning report (something I've heard many people say to avoid but it can be quite hard to ignore). I felt pretty fresh, despite not sleeping well the night before. The reason for the poorer sleep was more due to eating a bit too much for dinner rather than nerves. I was mindful of ensuring I was eating enough,  but wasn't as dialled in with carb loading as I was when I did the marathon. \n\nI had a hard time eating breakfast at the hotel, sticking to things like bread and eggs. Again, not something I had planned, was just basing my food choices off of things I know go down well as well as seeing what other people were eating (there were a lot of half marathon runners at the hotel I was staying in).\n\n# Race\n\nI have been guilty of being far too fixated on an A goal in the past and spent a lot of time before the race hashing out B and C goals. I really wanted a sub-1:40 but I needed to understand that it's not the end of the world as sometimes race day conditions don't always go in your favour and neither does training. \n\nWith that being said, it was a very cold morning (about 4 degrees, with a RealFeel of 0 degrees). I didn't pack a warmer back up outfit and I think I could've done with a longer and more thorough warm up as well. Because it was so cold, I had a hard time trying to control my breathing for the first 2-3km and get comfortable with the task at hand. \n\nI got quite frustrated for the first 10km as there were quite a few people who started before me who were running considerably slower than me. This was the one thing about the race I didn't like, but I did make up about a 1000 places over the course of the race. Participants were asked about their personal bests (I inputted mine as my previous PB), rather than expected finishing times, before the race so I'm wondering if people were inputting times they didn't achieve recently. This combined with the very cold start did throw me off a bit during this portion of the race. \n\nAs the race went on and struggling to hit the splits provided by Garmin PacePro (I set a pretty conservative negative split), I reminded myself how important it is to be able to race as well as get to the start line. I think my fuelling strategy worked (SIS Beta at 30 and 1:30 mark, with a SIS Beta Nootropics at the hour mark) as that helped me tick over and did get a nice little boost for a bit when I took the nootropics gel. It was also around this point that I spotted my friends around Potsdamer Platz and got a nice boost of energy. \n\nEven if I couldn't keep up with the PacePro splits, I was able to maintain a strong pace and didn't fall off in the second half and finished with negative splits. I also felt more comfortable in the second half of the course as the roads were much wider and open compared to the first half. \n\n# Post-race and Reflections\n\nAfter crossing the finish line, I collected my medal and looked forward to a shower and a free Erdinger afterwards. I've never been to a race that had showers in the finishers' area, which was very welcome even if the hot water wasn't working. \n\nI achieved my C goal and I'm still really happy with how the race went despite the conditions as I ran a negative split and finished the race strong. The result I achieved meant that I finished outside the predicted finishing time given to me by Runna, but I do wonder how much would've changed had the weather been more favourable. Looking at runs from last year and 2023, it looks as though the weather can alter between quite cold and quite warm year to year. I did also mention having a pretty big dinner the night before the race, but I and my legs did not in any way feel sluggish because of this. On the other hand, the splits I hit in key long runs in training plans for a half or full marathon before race day are usually a strong indicator of how I finish on race day (even if a training run is a month or more away from race day). \n\nIt's a really great course with loads of long straights to help hit your stride and the finish at the Brandenburg Gate is pretty special (must feel even better during the marathon!), even if the first half can feel congested due to the narrower roads.\n\nIn hindsight, I think I need to prepare myself better for conditions that aren't in my favour as trying to power through rather than adapt could've also hampered me slightly.\n\nI've got a couple of halves in October, but wondering if I can have another crack at the sub 1:40 before then. ",
    "score": 38,
    "url": "",
    "created_utc": 1744031299.0,
    "author": "mrschmax74",
    "permalink": "/r/running/comments/1jtku0x/berlin_half_marathon_race_report/"
  },
  {
    "title": "Altitude Advice",
    "body": "Hey All,\n\nI moved to Colorado Springs from South Korea in August of last year, the altitude went from sea level to 6500-7000 minimum. Long story short, running is hellish now.  \n\nI was told I would acclimate within a few weeks, six months at absolute maximum, but it is just horrible all of the time still eight months in. Even abysmally slow running feels like I'm being choked and can never catch my breath, I never hit my stride, or get the familiar runners high. My base run pace has dropped in excess of 4 minutes a mile each. Leaving Korea I could easily hold an 8 minute pace basically indefinitely and now just keeping myself moving, at ANY pace, for 30 minutes is an incredible mental battle. \n\nI don't know how I'm supposed to train, I've kept myself somewhat together by doing HIIT since I can mentally get through very short bursts of high activity. But man, I can't imagine doing even a 10K here despite runs of that length being something I am very used to doing multiple times a week during normal training. \n\nI get my performance should be less (especially since I can barely train anymore), but I feel worse now than I did when I was very obese and just getting into running for the first time.  \n\nI stay extra hydrated here (its also very dry) and take my multivitamin.  \n  \nAny advice? ",
    "score": 34,
    "url": "",
    "created_utc": 1744243982.0,
    "author": "LSOreli",
    "permalink": "/r/running/comments/1jvkui3/altitude_advice/"
  },
  {
    "title": "Diablo 50K (April 5, 2025) - My First Long Trail Run, Race Recap",
    "body": "**Before the Race**\n\nHaving done numerous half marathons over the years - both road and trail - I started to lose interest in the road ones. Trails were different. The scenery changed, the climbs made you earn the views, and the people felt like my kind of people: offbeat, friendly, quick to chat on the uphills, supportive without making a big deal of it. Trail runners, in their quiet weirdness, made the miles go by easier.\n\nEach year, I trained hard through the late spring, summer, and fall. But once winter hit, I always backed off -January to April became my off-season. And for the last three years, like clockwork, I would see races pop up in March and April that I wanted to do. Races that sparked something. But I'd always say, 'Next year.'\n\nBecause I wasn't in race shape. Because I hadn't trained enough. Because work was busy. Always a reason.\n\nThis year was no different - at least, at first. I'd been logging 8 to 12 treadmill miles a week, just enough to stay lightly active but nowhere near race-ready. Then, about three weeks before race day, I saw it again: the Diablo Trails Challenge 50K. The race I always wanted to do. The one I always told myself I'd be ready for 'next year.' Despite best intentions, life (and work) didn't give me space for a structured training block. Still, I kept wondering: Could I do this anyway? Even untrained? Just to see what I had in me?\n\nAs race day got closer, my thoughts bounced between:\n\n\\- I really want to do this.\n\n\\- I've passed on it for years - what if next year I have a kid, get injured, get sick? There might never be a perfect time.\n\n\\- But I'm dead after a 30K when I'm trained. How can I possibly finish a 50K like this?\n\n\\- What if I get hurt? What if I have to pull out mid-race? What if I wreck myself and can't work next week?\n\nThat back-and-forth continued right up until the night before. Finally, after some intense internal dialogue and a whole lot of pacing in my kitchen, I signed up. I figured if I finished, great. If I didn't, I'd at least find out where my limit was. But I didn't want to spend another year watching this race pass by and wondering what if.\n\n**Race Morning**\n\nAfter a last-minute dash to stock up on electrolytes and trail snacks, check my gear, and hunt down clean running clothes, I received one final curveball: an email from the race organizers. 'Expect to run through 12 creeks in the first 3 miles,' it said. Great. Nothing like a surprise foot soak to kick off the day.\n\nI barely slept the night before. My brain was on a loop: Am I making a huge mistake? Will I even make it back home tonight? What if I fall and get hurt? What if I emotionally wreck myself by dropping out early? I'd never even run a flat marathon. And here I was, about to attempt a 50K with massive elevation.\n\nI decided to lean fully into ignorance. Just get to the start line, stand at the back, and go. That was the whole plan. No expectations. No pressure.\n\nRemember the game plan, I told myself:\n\n\\- Start slow - slower than slow.\n\n\\- Don't get pulled into half marathon mode.\n\n\\- Don't let the start-line energy trick you into chasing people.\n\n\\- You're not racing anyone. You're here to finish.\n\nThe gun went off. Everyone took off down the trail, charging ahead. I started running... and found myself dead last. Perfect.\n\n**The First 10 Miles**\n\nThe first 10 miles were surprisingly okay. I'd run these trails before during the half marathon, so I knew what was coming - at least in theory. I kept my heart rate under 150, walked the uphills like I promised myself I would, and made sure to take in plenty of fluids. Around mile 3, I started snacking - nothing fancy, just easing my stomach into the routine.\n\nEverything still felt under control. My heart rate was steady, the slow pace was working, and the snacks were going down well. I started to think: This might be okay. Maybe I can actually do this. Maybe all this talk about undertraining was just noise. The gear, the food, the heart rate - it was all working.\n\nPoor fool. I had no idea what was coming.\n\n**Miles 10-13: The Slide into Curry Canyon**\n\nAround mile 10, the course veered off the main trail onto an out-and-back stretch down Curry Canyon Road. I'd seen this turn on the map beforehand and didn't give it much thought. The view of Mt. Diablo loomed ahead - the main assault on that monster was coming soon, and I felt strangely confident.\n\nAs I made the turn onto the Curry Canyon spur, I passed a steady stream of runners emerging from it, and thought, Okay, I'm not that far behind everyone. I'm still in the mix.\n\nThen the downhill started. Steep. Long. And it kept going. And going. And going. 1.5 miles of downhill, one direction - and somewhere around the halfway point, the creeping realization hit: I have to climb all the way back up this before I even start climbing Diablo.\n\nA knot formed in my chest. I was in the shit now.\n\nThis was the first moment when my spirit really began to waver. The sun was out now and starting to cook the trail, the shade becoming patchy and unreliable. I tried to play music - a playlist I'd made just for this moment - hoping to lift my mood and distract myself from the climb. But like always, music jacked my heart rate up 15-20 BPM. I couldn't afford that kind of spike. I ditched the plan and climbed in silence.\n\nWhen I finally emerged from Curry Canyon and rejoined the main trail, I felt... nervous. Half a mile later, I passed the turnoff point for the half marathon - a turn I knew well from past races. I glanced down at my Garmin. 13 miles done. A half marathon. And yet I hadn't even begun the true climb.\n\nMt. Diablo still lay ahead, and with it, 19 more miles and thousands of feet of climbing.\n\nI stood there in the heat, legs already aching, and thought: Can I really continue? My own ego, my own hubris, has landed me here... and now the climb begins.\n\n**The Climb to the Summit**\n\nAt the aid station, I refilled my hydration pack, dumped in the last of my electrolytes, and inhaled a Clif bar.\n\nTime to fill the tank - I knew what was ahead. Having fueled up, I felt a bit better. Regained my composure. This is no time to give into doubt and fear, my man, I told myself.\n\nI'd done this climb before. I knew what was coming.\n\nAs I started moving again, I pulled out a peanut butter pouch - thinking it'd be a nice protein hit. Big mistake. It was like inhaling dry insulation or powdered glue. The label said \"dry roasted peanut butter with palm oil\" and it lived up to every word. It took three huge gulps of water just to choke down the first bite. Rookie mistake.\n\nThe climb was long. Grinding. But... not as bad as I feared. I think those hours on the stairmaster actually paid off. I kept it slow and steady, heart rate low, and focused on the views: green hills, wildflowers, the sweep of the East Bay softened by spring. I reminded myself how lucky I was to be out here at all - uninjured, healthy, and able to attempt something like this.\n\nIt was hot, but not scorching. The miles ticked by, and somehow, I arrived - weary but in good spirits - at the summit aid station. A volunteer gave me an ice-water sponge bath over my head and shoulders, and it was glorious.\n\nMy legs were tired, but not wrecked. The worst is over, I thought. Maybe I can actually do this.\n\nOne of the volunteers smiled and said, \"You've made it up - now you just need to go down.\" And I thought: He's right. I made it up here. I can make it down. Yes!\n\nThe real hell was about to start.\n\nIf I knew what was coming, I never would have signed up for this.\n\n**North Peak - The Breaking Point**\n\nFrom the summit of Mt. Diablo, the trail dropped into a long, 3-mile downhill stretch. The breeze cooled me down, the path was runnable, and for the first time all day, I truly believed everything is going to be okay.\n\nSure, I still had 13 miles to go - a full half marathon - but it was mostly downhill or flat. I told myself I could hike the descents, jog the flats, and cruise into the finish. A quiet confidence settled in.\n\nThat all ended - fast.\n\nThe climb to North Peak is only 0.7 miles. But the final section is a soul-crushing, spirit-destroying monster - a 16% grade trail covered in loose rock, gravel, and what might as well be marbles.\n\nAs I started the climb, my legs were already shredded. Every step felt like I was dragging dead weight uphill. I was stunned that the course would include something this steep, this poorly maintained, this late in the race.\n\nGoing up the trail, I saw another runner inching downward, sitting on the ground, using her hands and feet to brace herself. She was stuck - too afraid to move.\n\nAnother woman passed me in tears, trying to keep moving but barely holding it together. And that's when the anger set in.\n\nI questioned everything. Why would they put this in the race? If I'm going to get hurt, it'll be here. I can't break bones - I have work on Monday. What are they thinking?\n\nMy mind screamed: \"This risk isn't worth it. This is just some dumb Saturday race - turn around. Go no further.\"\n\nI stood there, exhausted, furious, watching the trail get steeper ahead. For the first time, I genuinely wondered if I should quit.\n\n**The Mind Split**\n\nAt a certain point in races like this, I know I can't trust my mind. My rational, risk-averse subconscious - the version of me that keeps me safe in everyday life - starts to creep in and take over.\n\nThe longer a run drags on, the harder it becomes, the more it turns into a battle between two voices:\n\n\\- The ambitious one - the version of me that signed up, full of hope and excitement, asking \"What if?\"\n\n\\- And the other one - the safety-first, back-out-now voice that just wants this to end.\n\nBy the time I was partway up North Peak, that battle was at 50/50. Fear and exhaustion were gaining the upper hand.\n\nFor a moment, a thought crossed my mind: If I turn around right now... would anyone even know? There's probably no one up top checking. I could just turn around. Keep running. Say I made it. Get my finish.\n\nI indulged it, briefly. But then another voice shot through: Is that who I am? Is that how I want to remember this race? A cheat? A fraud?\n\nThat would be far worse than not finishing.\n\nThat realization made me furious - at myself, for even thinking it. And with that fire, I kept climbing. Fueled by anger now, not fear.\n\nWhen I finally reached the top, my legs were screaming. My back throbbed. My sunburn was flaring to life and stinging badly.\n\nAnd there it was - a roll of stickers, left by the race organizers to prove you'd made it. I peeled one off and stuck it proudly to my bib. Yes. I was here. I made it.\n\nGoing down, I remembered a trick that I had read in some old SAS outdoor survival book which I read 20 years ago: Never look at the whole slope. Just focus on your next two or three steps.\n\nSo that's what I did - picking out solid rocks as anchor points, ignoring the loose gravel ocean around me.\n\nOne careful step after another, eyes low, moving through the fear. Eventually, I reached the bottom. I was back on the trail. The worst was over. Surely, I thought, it's gotta be smooth sailing from here to the finish.\n\n**Miles 20-23: The Grind to Juniper**\n\nThe run to the Juniper aid station was only about 4 miles, but it felt like double that. The trail narrowed into rocky, technical singletrack. It was slow going - picking through stones, taking large, uneven steps up and down, carefully moving around clusters of day hikers.\n\nAt this point, I was longing for the wide-open, gently sloping curves of the foothills. I just wanted space. Predictable terrain. Something soft underfoot.\n\nInstead, I got bees.\n\nOut of nowhere, I stumbled into a hive. A few of them followed me for five minutes as I trotted away - thankfully, they weren't aggressive. But I was rattled.\n\nThe real scare came just after that. The singletrack ended abruptly at a fire road, where the trail made a hard left. In front of me - directly in front - was a sheer drop-off into a canyon. My legs hesitated, slow to respond. I stood there staring down into the void, unable to stop completely, feeling gravity pull me forward. Thankfully, they responded in time. I veered left. Still on my feet.\n\nAnd just like that - I was back on a wide road again. It felt like bliss.\n\nBut the final stretch to Juniper dragged on. The terrain wasn't too hard, but my legs were wrecked. Even on flats, I couldn't push past a 16-minute mile. Everything hurt. Every step was a test of patience.\n\nWhen I finally arrived at the Juniper aid station, at mile 23, I seriously considered calling it. I could call my wife. Get picked up. Be in an air-conditioned car in 20 minutes. End this now. This was my mental low point.\n\nBut instead of quitting, I walked over and refilled my fluids. A volunteer handed me an ice-cold sponge and doused my head and shoulders. The water hit like magic - an electric jolt of relief. For a moment, I felt human again.\n\nJust four more miles to the next aid station. I could do that.\n\n**Miles 23-32: The Long Road Home**\n\nIt was somewhere on Burma Road that I passed the 26-mile mark and realized: I'd just completed  a marathon. Technically, my first.\n\nAbout 10% of my mind took a flicker of pride in that. A marathon, without much - or any - real training, and on hills like these? That's something.\n\nBut the other 90% of me didn't care at all. Because the task at hand was far from over.\n\nI had long since run out of food. My electrolytes were gone. Each sip of water felt like it was diluting whatever salt I had left in my system. My legs were pounded to pulp, and the sunburn made the straps of my hydration vest feel like sandpaper. I could feel the blisters blooming on both big toes - I tried to ignore them.\n\nMy legs cramped up regularly now, seizing without warning. I had two salt tabs left and was saving them like lifeboats for the next serious climb. No matter how much water I drank, I still felt dry. I started to worry - Am I doing damage? Are my kidneys okay? Did I overdo the electrolytes earlier?\n\nThe views were astonishing - majestic green hills, storybook trails weaving into the horizon. At one point, I stumbled upon a small pond in the middle of nowhere, inexplicably full of goldfish. It was beautiful. It was surreal. I wished I could appreciate it more than I did.\n\nAt the final aid station, I picked up a packet of applesauce. It was, hands down, the best thing I had ever eaten in my life.\n\nThe last 4 miles retraced the trail we'd taken earlier in the day. I knew what was coming. I knew I could do it. But I also wondered when - or if - my body might just give out. The same trails I'd climbed easily that morning now looked enormous. Every step down jarred my legs. I clung to trees, to rocks, to the trail itself when I had to take a big step. Cramping flared at the slightest shift in terrain.\n\nBut then... the final two miles. Mostly flat. Rolling. Manageable. I started to believe, really believe, that I would finish.\n\nHalf a mile from the line, I walked - just to buy myself enough in the tank to 'run' the last stretch.\n\nAnd then I saw them - my wife, the race organizer, a few strangers cheering from the finish. And in that moment, I snapped back. I actually did this. I'm not injured. I'm here. I finished.\n\nIt didn't feel triumphant. It felt peaceful. Real. Grounded in the kind of pride that no medal can give you - the kind you earn one broken step at a time.\n\nAnd none of it would've been possible without my wife - for encouraging me to sign up, for believing I could do it when I wasn't sure myself, for being there at the end. I never would've finished without her love and support.\n\nMy final time was a little over 9 hours, a number that means everything and nothing all at once. It wasn't about speed, it was about getting through it. And I did.",
    "score": 32,
    "url": "",
    "created_utc": 1744086031.0,
    "author": "barn-whiskey",
    "permalink": "/r/running/comments/1ju53gv/diablo_50k_april_5_2025_my_first_long_trail_run/"
  },
  {
    "title": "House v. NCAA is terrible for the sport",
    "body": "In the recent House v. NCAA, it aims to limit roster spots on XC teams to 17 and Track &amp; Field teams to 45. Although every athlete may now be scholarshipped, is it really what is good for the sport?\n\nFirst of all, it ruins walk-ons. Like no more walk-ons. Many rosters will fill their spots to 17. It doesn't allow for high schoolers who are seeking to run at a higher level than D3 and hope to improve. Personally, I am a junior who runs a 9:40 3200m and hope to lower it to around 9:20 by the time I leave. These times are not close to level needed to get recruited to run D1, and I am okay with that. But, I still want to try to run at a D1 level and improve towards a better time and maybe be able to make a top spot my senior year of college, but I won't even have the chance to do so. I worry that because this limits the ability to have larger rosters, many teams will need to just take runners they already know are great: Kenyans. It is obvious that a majority of Kenyans are better than high school runners, but are these rosters really going to be filled with foreigners because our own damn country is too worried about the money. Look, I want to be inviting to the United States, but should we not put our people first in some cases?\n\nIs this really the nature of college athletics? I mean the whole goal of the lawsuit is to drive more money towards the power 5 schools. Most schools will not have the ability to scholarship 105 football players. And after all, what do we go to college for? To get a higher education. Instead, the NCAA is worried about seven figure contracts for students. Don't get me wrong; I do think that these football players do deserve a piece of the pie for the revenue they bring in, but do we really have to cancel Olympic sports because they aren't as profitable? Is NCAA for student-athletes or for the money filled power five football programs? I wish XC could make money. We work just as hard as the football teams. We work our asses off for four years just to try to walk on to a program to try to be a great runner one day and enjoy being a college runner, after all we all are amateurs. I don't ask to be overly funded, just to be able to compete and enjoy the sport. But nope, we are too worried about making sure the football programs can fund their $100 million dollar training facilities. \n\nI understand that football funds a majority of our sports, but what is the nature of college sports? Is it the new professional league or is it to give high school students the opportunity to compete at a higher level? I am just frustrated. I want to just be able to walk on and run D1 and enjoy the sport for what it is, but the NCAA is too worried about limiting the amount of people on these programs that are already underfunded. I am frustrated the person who filed the case was a swimmer, and their sport will be affected as hard as ours will be. The NCAA should be for all student athletes, not just football, not just money making programs. The NCAA should help all sports. ",
    "score": 28,
    "url": "",
    "created_utc": 1744087295.0,
    "author": "oceannless",
    "permalink": "/r/running/comments/1ju5ftv/house_v_ncaa_is_terrible_for_the_sport/"
  },
  {
    "title": "Weekly Complaints & Confessions Thread",
    "body": "How’s your week of running going? Got any Complaints? Anything to add as a  Confession? How about any Uncomplaints?",
    "score": 22,
    "url": "",
    "created_utc": 1744288654.0,
    "author": "ssk42",
    "permalink": "/r/running/comments/1jvwun8/weekly_complaints_confessions_thread/"
  },
  {
    "title": "The Weekend Thread -- 11th April 2025",
    "body": "Happy Friday!!!! \n\nWe survived another week, congrats y'all. \n\nWhat's good this weekend? Who's racing, running, tapering, kayaking, hiking, camping, glamping, climbing, reading, gyming, playing with cats, gardening, sleeping, taking a lot of deep and grounding breaths, .... \n\nTell us all about it! ",
    "score": 16,
    "url": "",
    "created_utc": 1744372895.0,
    "author": "fire_foot",
    "permalink": "/r/running/comments/1jwo4p9/the_weekend_thread_11th_april_2025/"
  },
  {
    "title": "Best water packs/vests for big boobs",
    "body": "Hello, I’ve been gradually building up my distance for a few months but I’m now at a point where the distance I’m running means I need water. I’ve had friends recommend vests with water bottles at the front but I’m not sure how comfortable or practical those are for women with breasts (GG) and can’t ask without commenting on their chest (which I’d rather not do).\n\nMy sports bra is on point, no aches or pains or anything really just looking for tips and recommendations for lugging some water with me without having too much weight or bulk please ☺️",
    "score": 16,
    "url": "",
    "created_utc": 1744210610.0,
    "author": "Limp-Examination-375",
    "permalink": "/r/running/comments/1jv7sny/best_water_packsvests_for_big_boobs/"
  },
  {
    "title": "Achievements for Saturday, April 12, 2025",
    "body": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
    "score": 14,
    "url": "",
    "created_utc": 1744430492.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jx8p91/achievements_for_saturday_april_12_2025/"
  },
  {
    "title": "Social Saturday",
    "body": "*Enforcing Rule 3 (no self-promotion, social media links) is a must with a large sub such as this, but we do realize that it filters out some truly useful content that is relative to the sub. In an effort to allow that content in, we thought we'd have a weekly post to give a spot for the useful content. So...*\n\nHere's you chance!\n\nGot a project you've been working on (video, programming, etc.), share it here!\n\nWant to promote a business or service, share it here!\n\nTrying to get more Instagram followers, share it here!\n\nFound any great running content online, share it here!\n\nThe one caveat I have is that whatever is shared should be fitness related, please.",
    "score": 13,
    "url": "",
    "created_utc": 1744430490.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jx8p84/social_saturday/"
  },
  {
    "title": "Super Moronic Monday - Your Weekly Tuesday Stupid Questions Thread",
    "body": "Back once again for everything you wanted to know about running but were afraid to ask.\n\nRules of the Road:\n\nThis is inspired by eric\\_twinge's fine work in r/fitness.\n\nUpvote either good or stupid questions. Sort questions by new so that they get some love.\n\nTo the more experienced runnitors, if something is a good question or answer, add it to the FAQ.\n\nPost your question -- stupid or otherwise -- here to get an answer -- stupid or otherwise. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer. Many questions get submitted late each week that don't get a lot of action, so if your question didn't get answered, feel free to post it again.\n\nAs always, be sure to read the FAQ first. Also, there's a handy-dandy search bar to your right, and if you didn't know, you can also use Google to search runnit by using the limiter \"site:reddit.com r/running\".\n\nBe sure to check back often as questions get posted throughout the day. Sort comments by \"new\" to be sure the newer questions get some love as well.\n\n\\[Posting on behalf of u/Percinho who is busy calling his raccoon’s lawyer for them.]",
    "score": 12,
    "url": "",
    "created_utc": 1744114564.0,
    "author": "30000LBS_Of_Bananas",
    "permalink": "/r/running/comments/1juc3uo/super_moronic_monday_your_weekly_tuesday_stupid/"
  },
  {
    "title": "Achievements for Tuesday, April 08, 2025",
    "body": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
    "score": 10,
    "url": "",
    "created_utc": 1744084900.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1ju4s4y/achievements_for_tuesday_april_08_2025/"
  },
  {
    "title": "Achievements for Friday, April 11, 2025",
    "body": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
    "score": 11,
    "url": "",
    "created_utc": 1744344065.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jwh2tl/achievements_for_friday_april_11_2025/"
  },
  {
    "title": "Li'l Race Report Thread",
    "body": "\nThe Li’l Race Report Thread is for writing a short report on a recent race or a run in a new place. If your race doesn’t really need its own thread but you still want to talk about it, then post it here! Both your good and bad races are welcome.\n\nDidn't run a race, but had an interesting run to talk about.  Post it here as well!\n\nSo get to it, Runnit! In a paragraph or two, where’d you run and how’d it go?",
    "score": 10,
    "url": "",
    "created_utc": 1743998488.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jtcjet/lil_race_report_thread/"
  },
  {
    "title": "Achievements for Wednesday, April 09, 2025",
    "body": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
    "score": 10,
    "url": "",
    "created_utc": 1744171309.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1juwzg5/achievements_for_wednesday_april_09_2025/"
  },
  {
    "title": "Official Q&A for Monday, April 07, 2025",
    "body": "With over 4,000,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
    "score": 9,
    "url": "",
    "created_utc": 1743998489.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jtcjfc/official_qa_for_monday_april_07_2025/"
  },
  {
    "title": "Achievements for Sunday, April 13, 2025",
    "body": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
    "score": 8,
    "url": "",
    "created_utc": 1744516892.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jxz5hu/achievements_for_sunday_april_13_2025/"
  },
  {
    "title": "How much cross training is okay ?",
    "body": "Hello ! I've been running 4 times a week for the past six weeks coming back from a 6 months break (not due to injury). I've started slow (15-25 minutes runs) and 90% zone 1-2 and I'm now at four 45-55 minutes runs a week. Following a 80/20 intensity repartition. \n\nI decided to implement some cross training in my week that would be either cycling, elliptical, stair climbing or uphill walking to do more physical activity without running more and risking injury. At first I was thinking 4 runs and 1 cross training session or 3 runs and 2 cross training sessions.\n\nBut after doing an easy 40 minutes cycling session (easy being my cycling Zone 1 and 2), I feel like I'd like to do maybe 3-4 cross training sessions per week. Would it be okay ? Or would it lead to injury ?\nIf I'm able to do 3 or 4 sessions, should all of them be easy sessions or can I push a bit on one or two without increasing the risk of injury?\n\nThank you in advance and have a great day !\n\nPS : I'm doing the 75Hard program that asks two 45' workouts per day. For the past 30 days I've mainly been running and walking with 3 strength sessions scattered around the month. But with 4 running sessions per week, most of my workouts have been walks and I've been wanting to increase the \"level\" of physical activity for now because I feel like I can and want to do a bit more.\nJust explaining this here if it helps with context",
    "score": 7,
    "url": "",
    "created_utc": 1744278539.0,
    "author": "LegalComplaint7910",
    "permalink": "/r/running/comments/1jvu1wu/how_much_cross_training_is_okay/"
  },
  {
    "title": "Run Nutrition Tuesday",
    "body": "**Rules of the Road**\n\n1)  Anyone is welcome to participate and share your ideas, plans, diet, and nutrition plans.\n\n2)  Promote good discussion.  Simply downvoting because you disagree with someone's ideas is BAD.  Instead, let them know why you disagree with them.\n\n3)  Provide sources if possible.  However, anecdotes and \"broscience\" can lead to good discussion, and are welcome here **as long as they are labeled as such.**\n\n4)  Feel free to talk about anything diet or nutrition related.\n\n5)  Any suggestions/topic ideas?",
    "score": 8,
    "url": "",
    "created_utc": 1744084899.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1ju4s4d/run_nutrition_tuesday/"
  },
  {
    "title": "Stretching before runs made my pain worse. Just me?",
    "body": "Everyone kept telling me \"just stretch more,\" but every time I did those long hamstring or hip stretches pre-run, my lower back literally flared up, and I'd be totally miserable.\n\nWent to see a DPT and he said I was actually loosening the only support my body had! Started focusing on core stability before running recently and it's been a game-changer for me.\n\nWish the pop knowledge about \"just stretching\" were a little more specific. Hope you're all out there doing it properly and focusing on your core. My lower back is thanking me now.",
    "score": 7,
    "url": "",
    "created_utc": 1744310566.0,
    "author": "corebalancecameron",
    "permalink": "/r/running/comments/1jw5ddu/stretching_before_runs_made_my_pain_worse_just_me/"
  },
  {
    "title": "Achievements for Monday, April 07, 2025",
    "body": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
    "score": 7,
    "url": "",
    "created_utc": 1743998490.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jtcjfk/achievements_for_monday_april_07_2025/"
  },
  {
    "title": "UPF, lightweight leggings w pockets for summer running?",
    "body": "Any recommendations for leggings w sun protection and pockets that stay cool for running in hot humid weather? ",
    "score": 7,
    "url": "",
    "created_utc": 1743980977.0,
    "author": "No_Armadillo4172",
    "permalink": "/r/running/comments/1jt74op/upf_lightweight_leggings_w_pockets_for_summer/"
  },
  {
    "title": "Dri fit athletic \"under\" pant for women?",
    "body": "I (26f) am just getting into running, and I'm looking for budget friendly undergarment/compression type pants that I can wear under track shorts (specifically white ones). They'd be used for cold runs, and also in the summer for sun protection. I'm getting a bit frustrated because it seems like they make compression \"under\" pants for men, but all I can find for women are thicker, more stylish compression leggings that are made to be worn by themselves. Any suggestions will help, thanks!",
    "score": 6,
    "url": "",
    "created_utc": 1744040618.0,
    "author": "ArgyraeusV",
    "permalink": "/r/running/comments/1jtodry/dri_fit_athletic_under_pant_for_women/"
  },
  {
    "title": "Official Q&A for Thursday, April 10, 2025",
    "body": "With over 4,000,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
    "score": 4,
    "url": "",
    "created_utc": 1744257691.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jvp304/official_qa_for_thursday_april_10_2025/"
  },
  {
    "title": "Miscellaneous Monday Chit Chat",
    "body": "Happy Monday runners! \n\nHow was the weekend? What's good this week? Let's chat about it!",
    "score": 4,
    "url": "",
    "created_utc": 1744027720.0,
    "author": "fire_foot",
    "permalink": "/r/running/comments/1jtjnzq/miscellaneous_monday_chit_chat/"
  },
  {
    "title": "Achievements for Thursday, April 10, 2025",
    "body": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
    "score": 4,
    "url": "",
    "created_utc": 1744257691.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jvp30d/achievements_for_thursday_april_10_2025/"
  },
  {
    "title": "Official Q&A for Tuesday, April 08, 2025",
    "body": "With over 4,000,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
    "score": 6,
    "url": "",
    "created_utc": 1744084900.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1ju4s4n/official_qa_for_tuesday_april_08_2025/"
  },
  {
    "title": "Tuesday Shoesday",
    "body": "Shoes are a big topic in this sub, so in an effort to condense and collect some of these posts, we're introducing **Shoesday Tuesday**!  Similar to Wednesday's gear thread, but focusing on shoes.  \n\nWhat’ve you been wearing on your feet? Anything fun added to the rotation? Got a review of a new release? Questions about a pair that’s caught your eye? Here's the place to discuss.\n\n *NOTE: For you Runnitors looking to sell/trade any running gear (as well as bib transfers), head over to /r/therunningrack.*",
    "score": 4,
    "url": "",
    "created_utc": 1744084899.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1ju4s48/tuesday_shoesday/"
  },
  {
    "title": "Official Q&A for Saturday, April 12, 2025",
    "body": "With over 4,000,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
    "score": 3,
    "url": "",
    "created_utc": 1744430491.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jx8p8p/official_qa_for_saturday_april_12_2025/"
  },
  {
    "title": "Race Roll Call",
    "body": "Good morning, Runnit! Another weekend of races is approaching, so let's take a minute to see if any other Runnitors will be laying down those miles with us!\n\nIf you're racing this weekend, put a top-level comment below with the race details to help find other members of the community. See a race mentioned that looks interesting? Ask questions! Running your favorite race of the year? Tell us what makes it so awesome!\n\nThis thread is just an easy way to help Runnitors find each other in some sort of organized manner and help cheer each other on!",
    "score": 4,
    "url": "",
    "created_utc": 1744344123.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jwh3j4/race_roll_call/"
  },
  {
    "title": "Official Q&A for Wednesday, April 09, 2025",
    "body": "With over 4,000,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
    "score": 3,
    "url": "",
    "created_utc": 1744171309.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1juwzfp/official_qa_for_wednesday_april_09_2025/"
  },
  {
    "title": "London Marathon 2025 Wave Start Time Thread",
    "body": "This year London Marathon has a new Green Team for runners choose not to have kitbag drop. Green uses blue start line.\n\nWith a 2:45 estimated finish time, I have been assigned to Green Wave 1. However, the start time is 9:52-9:54, which is almost 20min late than other wave 1 starts. This means if you are fast runners in Green then 100% you will have to run with runner at much slower pace then you. I do hope I am wrong here..\n\nAs I did my research, Blue, Pink, Yellow wave 1 all start at 9:35-9:39. \nGreen wave 2 start at ~10:17, almost the same time as Blue wave 10.\n\nMy guess is that there are not enough fast runners in Green, so they have to make less waves and choose the start time best fit for most people. \nIf this is true, then Green is not a good option for people to run PB. Again, I hope I am wrong..\n\nAlso, please share your estimated time + color wave + start time, it would be helpful information.\n\nCOMPLETE wave start time and pacer information are posted here:\n[Reddit post](https://www.reddit.com/r/AdvancedRunning/s/fs79V0KJ0m)",
    "score": 3,
    "url": "",
    "created_utc": 1744142281.0,
    "author": "wg1222",
    "permalink": "/r/running/comments/1jumybt/london_marathon_2025_wave_start_time_thread/"
  },
  {
    "title": "Official Q&A for Sunday, April 13, 2025",
    "body": "With over 4,000,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
    "score": 2,
    "url": "",
    "created_utc": 1744516892.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jxz5hm/official_qa_for_sunday_april_13_2025/"
  },
  {
    "title": "Official Q&A for Friday, April 11, 2025",
    "body": "With over 4,000,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://old.reddit.com/r/running/comments/1fcsdwl/new_to_running_or_the_sub_click_here_first/?) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).",
    "score": 2,
    "url": "",
    "created_utc": 1744344065.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jwh2tc/official_qa_for_friday_april_11_2025/"
  },
  {
    "title": "What Are You Wearing Wednesday - Weekly Gear Thread",
    "body": "It's that time of week already...the gear thread! What have you picked up lately? What's working for you now that it's whatever season you believe it to be in your particular location? What have you put through rigorous testing that's proved worthy of use? We want to know!\n\nTo clear up some confusion: We’re not actually asking what you’re wearing today. It’s just a catchy name for the thread. This is the weekly gear discussion thread, so discuss gear!\n\n*NOTE:  For you Runnitors looking to sell/trade any running gear (as well as bib transfers), head over to /r/therunningrack.*",
    "score": 2,
    "url": "",
    "created_utc": 1744171308.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1juwzfg/what_are_you_wearing_wednesday_weekly_gear_thread/"
  },
  {
    "title": "The Weekly Training Thread",
    "body": "Post your training for this past week. Provide any context you find helpful like what you're training for and what your previous weeks have been like. Feel free to comment on other people's training.\n\n(This is **not** the Achievement thread).",
    "score": 1,
    "url": "",
    "created_utc": 1744516891.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1jxz5hg/the_weekly_training_thread/"
  },
  {
    "title": "Am I Still Making Progress? My Approach To Better Understand My Personal Running Data",
    "body": "**TL;DR:**  \nI picked up running again after a long break and wanted to quantify my progress — but interpreting the data was harder than I thought.\n\n**Long version:**  \nI used to run a lot years ago but took a 5-year break. Last summer, I got back into it and started running regularly again. My main goal now is to stay active while avoiding injuries, so I’m training almost exclusively in **Zone 2**.\n\nI believe personal stats don’t matter much in this context, but in case you're curious:  \n**Male, 30–40 y/o, VO2 Max 56 (from COROS), weekly mileage around 20–25 km.**\n\nOver the past few months, I *felt* I was improving — higher pace at the same heart rate — but I didn’t know by *how much*, or if I was already starting to plateau. So I wrote a small script to analyze and visualize my runs:\n\n📊 **Metrics**: [https://imgur.com/a/F1AWv3G](https://imgur.com/a/F1AWv3G)  \n📁 **Data source**: exported  `.tcx`  files from the COROS app.\n\n# My Approach:\n\nI focused on a few key metrics:\n\n* **Average pace**\n* **Average heart rate**\n* **Total elevation gain**\n* **Distance**\n\nThe goal was to assign a *fitness score* per run and track whether that score improved over time.\n\nAfter experimenting with different combinations, the best-fitting formula so far is:\n\n**fitness score = mapped pace × mapped heart rate**\n\n*(i) Note: Mapped in this case means scaling the values into a range between 0 and 1.*\n\nThe interesting (and kind of surprising) part:  \nNeither distance nor elevation gain ended up being useful in this specific formula. That second chart (blue line) shows my calculated fitness score over time — and it *does* seem to be trending up. Yay!\n\nHowever, I’m still unsure how to account for elevation gain or total distance. When I tried adding a \"mapped slope\" value, it actually made my recent scores *worse*, even though the effort felt similar (or better).\n\n# 🤔 My Questions to You\n\n* Is it reasonable to track progress using only heart rate and pace?\n* How should I factor in distance or elevation?\n* Any smarter ways you’ve found to quantify long-term running improvements?\n\nIf you’re into this sort of thing and want to analyze your own runs, let me know! I’m happy to share the code or even build a small tool where you can upload your own `.tcx` files if you're not into scripting.\n\n*Disclaimer: ChatGPT was used for editing the post and making it more visually appealing*",
    "score": 2,
    "url": "",
    "created_utc": 1744203841.0,
    "author": "WorkingLocksmith4421",
    "permalink": "/r/running/comments/1jv59m9/am_i_still_making_progress_my_approach_to_better/"
  },
  {
    "title": "Lurkers' Wednesday",
    "body": "\n#Would you rather not be a lurker?\n\n**Then what are you waiting for? Tell us all about yourself!**\n\nThe LW thread is an invitation to get more involved with the /r/running community.  \n\nNew to the sub in general?  Welcome!  Let us know more about yourself!",
    "score": 1,
    "url": "",
    "created_utc": 1744171308.0,
    "author": "AutoModerator",
    "permalink": "/r/running/comments/1juwzf8/lurkers_wednesday/"
  },
  {
    "title": "Tall runners, what clothing brands do you recommend?",
    "body": "Hey everyone, I’m a fairly tall guy and just getting back into running frequently. I’ve been looking for tall length shirts/jackets/pants/leggings (shorts aren’t an issue) and am struggling to find any running brands that sell tall length gear. \n\nHave any of you had success finding brands that specifically sell tall lengths or just run extremely long that you have experience with? I’ve seen Nike has some options but they are so pricey. \n\nFor reference, I’m about 6’7” and around 220 pounds.\n\nThank you in advance!",
    "score": 1,
    "url": "",
    "created_utc": 1744073481.0,
    "author": "Slendoh",
    "permalink": "/r/running/comments/1ju1756/tall_runners_what_clothing_brands_do_you_recommend/"
  },
  {
    "title": "My old Garmin workhorse still does more right than most new sports watches",
    "body": "I've used the 955, 255, 945, and even recently tried Coros — but I keep coming back to my old 735XT. Why? Because it's the only watch that truly nailed what matters.\n\nThe 945 came close on weight, battery, and features. Coros has a slick UI but wildly inflated battery claims. Yet the 735XT’s no-nonsense simplicity and reliability still stand out:\n\n* Slim, lightweight, genuinely comfortable\n* Reliable GPS and multisport tracking\n* Native power and sensor support\n* No bulky wrist HR bump or AMOLED gimmicks\n* Just enough features — no bloat\n* Solid battery (but ready for a modern upgrade)\n* No music, no pay, no AMOLED, no faux recovery metrics\n* No overhyped multiband GPS that wrecks battery life  \n\nWhat we really need is a **735XT+**:\n\n* More accurate GPS and long multi-day battery (\\~30–40+ hrs)\n* Native power, sensor, and zone graph support\n* Accurate training effect/load via external HRM\n* Simple real-world metrics like endurance/hill score — *done well*\n* Breadcrumb nav &amp; route elevation profile — *minimum is enough*\n* No titanium bezel pretending we’re Navy SEALs  \n\nLet’s be real — most of us don’t smash our wrists on rocks. Few need a £600+ metal-encased smart-brick with flashlight mode and pulse ox in five colours.\n\nGarmin’s great at adding — and restricting — features across more confusingly overlapping models than anyone needs. Feature bloat, wrist irritation, and increasingly unreliable wrist HR come up again and again online. What we need is a return to focused, reliable endurance tools.\n\nThe 735XT was everything a performance watch needed (for its time): slim, light, durable. No fluff, no skin burn, no wellness metrics that cause more stress than they solve. Just the right tools, the right data, and the freedom to train hard and go long.\n\nGive us that again — with a modern twist, better battery, and tighter GPS — and it might just be the most perfect endurance watch on the market.\n\nHRV and stress metrics might help sell watches, but they don’t work for everyone. Some of us want less noise, not more. We want to be empowered by data not ruled by it. Garmin should offer a stripped-back but *powerful* training tool — not every athlete needs a wellness dashboard. \n\nWe want full access to core performance features like structured workouts, power support, navigation, and real world metrics — without the distraction of recovery voodoo or daily readiness scores.\n\nThe Forerunner 55 is too limited. The 955 is overloaded. Even the 255 — probably the closest — still falls short. It’s bulkier, less intuitive, and saddled with a flaky HR sensor that opens up sleep stages and HRV tracking most of us don’t genuinely need — and certainly can’t trust. Let’s not lose the tools that work, in pursuit of features we’ve been convinced we need.\n\nSome of us want to train hard and recover smart — but guided by feel, not fear. We want a watch that *supports* intuition, not replaces it. A durable, trusted workhorse that strips back the fluff but keeps the power. **This is why the 735XT+ will sell.**\n\nI would buy it in a heartbeat.\n\nAnyone else feel the same?\n\n",
    "score": 0,
    "url": "",
    "created_utc": 1744381896.0,
    "author": "AmbitiousLobster7459",
    "permalink": "/r/running/comments/1jwraxg/my_old_garmin_workhorse_still_does_more_right/"
  },
  {
    "title": "How can I raise money for charity during a marathon in Morocco that doesn't offer fundraising options?",
    "body": "Hey everyone,\n\nI'm running a marathon later this month in Morocco, and I really want to use the opportunity to raise money for a charity. The marathon itself doesn’t offer any built-in fundraising options, so I’m trying to figure out how to do it independently. One challenge is that I’m not active on any social media, so I can’t rely on that to spread the word.\n\nAre there any platforms/channels that support personal fundraising campaigns for charitable causes?\n\nWould really appreciate any advice or experiences you can share!\n\nThanks in advance!",
    "score": 0,
    "url": "",
    "created_utc": 1744298033.0,
    "author": "Intelligent_Cable865",
    "permalink": "/r/running/comments/1jw0cai/how_can_i_raise_money_for_charity_during_a/"
  }
]