[
  {
    "title": "[COMP] In 2020, I had already been doing yoga for 8 years. It takes time, but progress is absolutely possible. Don’t buy into the narrative that flexibility is just for ex-dancers and hypermobile practitioners.",
    "body": "",
    "score": 3613,
    "url": "",
    "created_utc": 1743947582.0,
    "author": "bendyval",
    "permalink": "/r/yoga/comments/1jsum0c/comp_in_2020_i_had_already_been_doing_yoga_for_8/"
  },
  {
    "title": "Update: ditched the therapist joined a Yoga Studio",
    "body": "I had the post a couple weeks ago about my therapist sending me videos that yoga was devil worship…there were over 900 comments. Thanks for the feedback.  I did fire the therapist. I also joined a yoga studio for cheaper than the therapist costs, and have never felt better.   I have been going 2-4 times per week. I can squat down without knee pain, my back doesn’t hurt when I wake up anymore, I have more mental clarity and peace.  Whether I get a new therapist we shall see.   It was a short term couples counseling so we may or may not seek out another therapist, but yoga is here to stay! ",
    "score": 937,
    "url": "",
    "created_utc": 1744025188.0,
    "author": "Ok_Solution8537",
    "permalink": "/r/yoga/comments/1jtixii/update_ditched_the_therapist_joined_a_yoga_studio/"
  },
  {
    "title": "A reminder for when you find yourself comparing",
    "body": "I am the flexible student in class. \n\nMy hands are flat on the floor, chest to thighs in forward fold. \n\nMy legs are almost a full split in dragonfly.\n\nI’m sure some classmates assume I am “good at yoga” but the reality is I have a genetic condition that makes this easy. I’ve been able to do it since I was a kid. \n\nBodies are different, and often I wish I had a “normal” one.\n\nYou’re doing great wherever you are - don’t assume a more flexible person is more skilled, sometimes it’s just nature, and you’re not seeing the downsides. \n\n Wishing you a great practice.",
    "score": 811,
    "url": "",
    "created_utc": 1744102068.0,
    "author": "highlyunlikely587",
    "permalink": "/r/yoga/comments/1ju8wg7/a_reminder_for_when_you_find_yourself_comparing/"
  },
  {
    "title": "Savasana for Whole Class",
    "body": "I have been practicing yoga since 2018 and I love each style for different reasons. I initially fell in love with yin yoga but in the past 8 months I have started loving vinyasa flows. Recently I have been going through a troubling time and my body has been craving uninterrupted rest and meditation. In my yoga class today, I laid in savasana for the entire hour and did just that for the first time. \n\nWe started class in savasana which was easy, but as soon as the teacher started the flow, I became acutely aware of the fact that I was the only one laying down and became self conscious. Breathing through it, tuning it out and turning on my inside meditation was exactly what my body needed and to overcome the fear of being judged. It was incredibly humbling and restorative for myself. \n\nListen to your bodies and remember that most of the time, people judge you way less than you judge yourself. ",
    "score": 459,
    "url": "",
    "created_utc": 1744346878.0,
    "author": "bravocharlie8918",
    "permalink": "/r/yoga/comments/1jwhux9/savasana_for_whole_class/"
  },
  {
    "title": "I trusted yall and was bamboozled.",
    "body": "I searched through posts here looking for recommendations for yoga pants since I haven’t bought any in a few years. I’ve tried Lulu and Prana and haven’t been happy as they constantly sag. \n\nI saw Athleta being recommended fairly high and often through the posts I read. I also saw Lulu but I just ignored those recommendations. I ended up buying a pair of Athleta yoga pants in this cute pink color they have right now. \n\nMY GOD!!! They don’t cover shit. You can literally see the pattern on my panties through these things. To quote my partner “I can see the pimple on your butt” 😑 Are yall going commando? Has quality declined this much? They were $109. I am in shock! \n\nI mean the fit is amazing and the buttery soft feel is fantastic but like I might as well wear sheer tights at this point, they cover about the same amount. \n\nAnywho, still interested in some nice yoga pants and open to recommendations. Definitely returning these free show yoga pants. ",
    "score": 455,
    "url": "",
    "created_utc": 1744162192.0,
    "author": "RemarkableTeacher",
    "permalink": "/r/yoga/comments/1juu664/i_trusted_yall_and_was_bamboozled/"
  },
  {
    "title": "[COMP] It took me years to understand this about yoga",
    "body": "",
    "score": 447,
    "url": "",
    "created_utc": 1744313232.0,
    "author": "HeavyOnHarmony",
    "permalink": "/r/yoga/comments/1jw6fgy/comp_it_took_me_years_to_understand_this_about/"
  },
  {
    "title": "Donation based but people don’t donate…",
    "body": "I’ve been hosting donation based yoga classes for\nThe past several months. I’m still pretty new at teaching, so it’s more about experience and building community for me than making the money. However, i do have to pay to rent the space i teach in and it would be nice to break even. I remind people after each class that it’s donation based, my link to my Venmo is accessible, i include the information on booking confirmation and class follow up, but people still don’t send any donation. Does “donation based” imply that donations are optional? ",
    "score": 339,
    "url": "",
    "created_utc": 1743946838.0,
    "author": "Left_Weakness1996",
    "permalink": "/r/yoga/comments/1jsud24/donation_based_but_people_dont_donate/"
  },
  {
    "title": "[COMP] Tucks! Crow to headstand to crow still not working but that’s okay",
    "body": "Looking for any tips that’ll help transitioning back from headstand to crow. Seems like when I push up my arms give up. I try to engage the core and push my navel up but my arms don’t feel like it. \nAnyway Happy Thursday :) ",
    "score": 248,
    "url": "",
    "created_utc": 1744279228.0,
    "author": "Prestigious-Olive130",
    "permalink": "/r/yoga/comments/1jvu7k9/comp_tucks_crow_to_headstand_to_crow_still_not/"
  },
  {
    "title": "Saw this in White Chicks, is this asana possible?",
    "body": "",
    "score": 179,
    "url": "",
    "created_utc": 1743957356.0,
    "author": "WalkingOnTightrope",
    "permalink": "/r/yoga/comments/1jsy8pu/saw_this_in_white_chicks_is_this_asana_possible/"
  },
  {
    "title": "Yoga spirituality",
    "body": "I’ve found a teacher at my local community center that skips all of the chakra talk, discussion of higher powers or light in us or whatever and it is so refreshing. I leave feeling much lighter for it. I know it is innocuous or welcome for many, but I have a weird culty religious background. I find it very off putting but the movement and flow is so worth what that takes away. Anyone relate? Most of the classes/studios/teachers I have gone to incorporate some element of that.",
    "score": 167,
    "url": "",
    "created_utc": 1744225622.0,
    "author": "Opposite_Addition548",
    "permalink": "/r/yoga/comments/1jvdycu/yoga_spirituality/"
  },
  {
    "title": "Why does yin yoga make me want to yell?",
    "body": "I hear people talk about yin yoga being an emotional release, but everyone is usually talking about crying. Almost every time I do yin I have an urge to scream. I feel so uncomfortable in poses and I start to feel anger and agitation. Does anyone else experience this or can someone explain why it makes me angry rather than tearful?",
    "score": 158,
    "url": "",
    "created_utc": 1743987394.0,
    "author": "Anofrog",
    "permalink": "/r/yoga/comments/1jt97mo/why_does_yin_yoga_make_me_want_to_yell/"
  },
  {
    "title": "I’ve been practicing yoga for about a month and forward fold nearly kills me every time",
    "body": "I’m not completely new to yoga, I used to practice a few years ago but since then my lifestyle became so sedentary that I had to do something. And now I feel better but doing forward fold and then slowly going to mountain pose feels like I’m dying every time. I can’t feel my legs, can’t see, can’t hear anything for a few minutes after standing up. Should I just stop doing it completely? ",
    "score": 112,
    "url": "",
    "created_utc": 1744160457.0,
    "author": "Other_Carob_1928",
    "permalink": "/r/yoga/comments/1jutlz4/ive_been_practicing_yoga_for_about_a_month_and/"
  },
  {
    "title": "[COMP] Workshopping this transition from crane > pancake",
    "body": "Thinki",
    "score": 98,
    "url": "",
    "created_utc": 1744070848.0,
    "author": "BlueAndPurpleWall",
    "permalink": "/r/yoga/comments/1ju0bxt/comp_workshopping_this_transition_from_crane/"
  },
  {
    "title": "Able to do crow pose for 2 seconds!!!",
    "body": "I have been doing hot yoga consistently for about 3ish months and today for the first time I did the crow pose and I was floating in the air for a bit got super scared I was going to fall so I quickly came back down. But I was so thrilled!!  \n\nCan’t wait to try again, I feel like no one in my life would really understand and just wanted to share with others who would get it ",
    "score": 91,
    "url": "",
    "created_utc": 1743995514.0,
    "author": "FinedaySunday-nopost",
    "permalink": "/r/yoga/comments/1jtboha/able_to_do_crow_pose_for_2_seconds/"
  },
  {
    "title": "[COMP] sparrow to crow transition",
    "body": "Taught a fun bird themed class this week and cued this fun transition for some of my more intermediate/advanced students. ",
    "score": 87,
    "url": "",
    "created_utc": 1743973803.0,
    "author": "AcceptableObject",
    "permalink": "/r/yoga/comments/1jt4lrv/comp_sparrow_to_crow_transition/"
  },
  {
    "title": "Pose name?",
    "body": "What is the name of this pose and does anyone have a good guide on getting into it??",
    "score": 89,
    "url": "",
    "created_utc": 1744315315.0,
    "author": "Shreddit3000",
    "permalink": "/r/yoga/comments/1jw79rc/pose_name/"
  },
  {
    "title": "Clothes after hot yoga?",
    "body": "Hi all! I’ve been doing hot yoga for a few weeks now, and my yoga clothes end up drenched every time and I wash them right after each class. However, it’s feeling unsustainable to wash my yoga clothes almost every single day, especially as I’m moving to a high COL city soon where I won’t have in-unit laundry. What do you all do with your clothes after hot yoga? Do you do a tiny load of laundry every day or just leave your wet clothes in your laundry basket?\n\nEDIT: Thank you all so much, I wasn’t expecting to get so many responses!! This has been so helpful, some of you have ideas I would’ve never thought of (going in the shower with my clothes!). Feeling very grateful for this community! ",
    "score": 86,
    "url": "",
    "created_utc": 1744290985.0,
    "author": "Funny-Article-9838",
    "permalink": "/r/yoga/comments/1jvxnqr/clothes_after_hot_yoga/"
  },
  {
    "title": "New Yoga Teacher Seeking Guidance – Nothing Seems to Be Working",
    "body": "I’m a new yoga teacher, and for the past three months I’ve been trying to find students for my classes—with no success.\n\nI teach yoga in a beautiful park surrounded by nature and also in a lovely art studio (my sister owns the studio and kindly lets me use the space for classes).\n\nI’ve tried organizing yoga events in collaboration with a naturopath, Bach flower remedies, sound baths with Tibetan bowls, and even a ceramic artist. Each time, we manage to get 5 or 6 participants at most—but none of them are ever interested in joining a weekly yoga class afterward.\n\nI even offered a free trial class, but apart from a few people asking for info, no one ever ended up booking it.\n\nI’ve run Instagram ads multiple times, and I post 2–3 times a week.\nStill, I only have about 200 followers, and it seems like none of them are actually interested in attending my classes. I’ve tried doing polls and asking questions to better understand my audience, but I barely get any engagement.\n\nI’ve put up flyers around town, tried word-of-mouth marketing—nothing has worked.\n\nAfter three months, I’m feeling really discouraged. Becoming a yoga teacher has been a dream of mine for years. I practiced for a long time, completed a certified teacher training, and I have a beautiful space to teach in. I’m giving it everything I’ve got, but I’m seeing zero results.\n\nIt’s disheartening, especially because I haven’t been able to get even one regular student.\n\nThankfully, I’m able to host 1 or 2 yoga events a month through collaborations with other professionals, so at least I get to teach occasionally. But I can’t seem to build a consistent weekly class or attract new students.\n\nI honestly don’t know what else to try...\n",
    "score": 80,
    "url": "",
    "created_utc": 1744459922.0,
    "author": "Jazzmoon_",
    "permalink": "/r/yoga/comments/1jxfvs9/new_yoga_teacher_seeking_guidance_nothing_seems/"
  },
  {
    "title": "Where's my wrist gang at?",
    "body": "Does anybody else have hypermobile wrists or wrists where, no matter what modification you do, poses like down dog and table top are uncomfortable? I've always felt so judged at studios even by teachers who claim to be welcoming of all bodies for not being able to hack these 'hands on' poses. Has anybody else had this experience or have advice?",
    "score": 56,
    "url": "",
    "created_utc": 1744043122.0,
    "author": "theredcrusade112",
    "permalink": "/r/yoga/comments/1jtperc/wheres_my_wrist_gang_at/"
  },
  {
    "title": "I have been practicing yin yoga for 4 months now, 2-3 times per week. My muscles have always been extremely stiff and I’m quite inflexible. It’s been amazing and I’m slowly seeing some results, although I’ve noticed I’m moving really slowly at the moment and my muscles feel fatigued. Is this normal?",
    "body": "",
    "score": 50,
    "url": "",
    "created_utc": 1744124575.0,
    "author": "WildAussie_J",
    "permalink": "/r/yoga/comments/1jufqbk/i_have_been_practicing_yin_yoga_for_4_months_now/"
  },
  {
    "title": "if you had to pick one, which asana is your favorite?",
    "body": "share with me the story/connection/experience that led you to favoring this asana. 🖤",
    "score": 47,
    "url": "",
    "created_utc": 1744482341.0,
    "author": "suburbanhunter",
    "permalink": "/r/yoga/comments/1jxnvb3/if_you_had_to_pick_one_which_asana_is_your/"
  },
  {
    "title": "First Month of Yoga Review",
    "body": "I just started doing yoga in early March at a local CorePower and wanted to give my thoughts on it and also some opinions on if most peoples experiences were similar or different.\n\nSo I’m a pretty athletic person (6’2” Male) and have weightlifted for like 10 years now. I also started doing moderate/intense cardio in the last 4 years (stair master, hiking, running) because now I’m in my 30s and cardio is very important. Before I started doing yoga, I honestly was not sure where it would benefit me as a physical activity. \n\nSo I started taking yoga and immediately realized the positive benefits from it. I do stretch after each workout but yoga is different. It just feels good to be able to move into the different positions and stretch further after every session . It’s actually amazing I can touch my toes and my balance is crazy good now (just got back from a multi-day hike).\n\nThe demographic in yoga is also much different than I’m used to. Typically at gyms and cardio sessions, it is 80 percent men and people very rarely talk to each other. In yoga it really is the exact opposite. Which is a good thing because it can be nice to socialize.\n\nI would really recommend yoga for anybody and honestly I’ll continue doing it and I’m so glad I started doing it.",
    "score": 48,
    "url": "",
    "created_utc": 1744217298.0,
    "author": "Capital-World-155",
    "permalink": "/r/yoga/comments/1jvaijw/first_month_of_yoga_review/"
  },
  {
    "title": "Yoga pants",
    "body": "Hello! Has anyone come across Yoga pants they love that are cotton, wool or hemp? Basically non plastic wear? I would love to hear your thoughts before I spend the money. Thank you",
    "score": 39,
    "url": "",
    "created_utc": 1744303864.0,
    "author": "izallreal",
    "permalink": "/r/yoga/comments/1jw2nb2/yoga_pants/"
  },
  {
    "title": "Hammy’s",
    "body": "My hamstrings are so damn tight. I can’t do downward dog with my legs straight. Or fold over with my abdomen touching my thighs. Or touch my toes when in a seated position. How are you practicing? And how often? How many mins should I do it for every day?? Ty edit to add I’ve never been able to touch my toes lol ",
    "score": 31,
    "url": "",
    "created_utc": 1744161771.0,
    "author": "jaselun34",
    "permalink": "/r/yoga/comments/1juu1h5/hammys/"
  },
  {
    "title": "What’s the worst fall you’ve had",
    "body": "Was doing headstand in my small room and it was my first time successfully doing a press into headstand and was hyped and then as I was coming down I kicked over a glass of vodka and cranberry juice staining my entire room with shards of glass in my back and all over my laundry 😭😭 I’ve also fallen from headstand other times but this might be my worst ",
    "score": 30,
    "url": "",
    "created_utc": 1744344643.0,
    "author": "ocdgoslay",
    "permalink": "/r/yoga/comments/1jwh936/whats_the_worst_fall_youve_had/"
  },
  {
    "title": "Mirror or no mirrors in class? Close or far from your drishti?",
    "body": "Im a regular at two studios, one with and one without so it’s fun to think about both pros and cons. I notice with myself that I have a bit less balance with mirrors because I can see others moving while I’m trying to focus. But also like the feedback but notice without mirrors I can lock into a spot on a wall a lot easier. ",
    "score": 26,
    "url": "",
    "created_utc": 1744326682.0,
    "author": "RemoteAd1608",
    "permalink": "/r/yoga/comments/1jwblm2/mirror_or_no_mirrors_in_class_close_or_far_from/"
  },
  {
    "title": "YTT turned me off my studio:(",
    "body": "I've been so passionate about yoga since I discovered Ashtanga about a year ago, and I've become really involved in my studio. I'm on leave from my career due to PTSD, and yoga - more than anything - has helped me out myself back together. I decided to make the most of this time \"off\" by doing YTT, hoping to learn more about Yoga as a whole - beyond the asanas - and how to integrate it into my life. Well, I've just finished YTT and it's totally changed my perspective on my studio. My 200-h certification was more like 84 hours, and it was so disorganized. The focus was largely on directive speech and asanas - and now...sure, I can teach a class...but I felt like I \"saw through\" my studio through this experience and I was so disappointed. There was so little history and philosophy, and constant upselling of private sessions and whatnot. They handed us a binder with a bunch of printouts on things like chakras and Ayurveda at the beginning of the program, then we never covered any of it - but they technically list topics like these as being part of the program. They didn't discuss different styles of yoga, or the historical background - at all. \n\nI'm a quiet person, and when I taught my class at the end they said they were blown away because they didn't realize how much I'd been learning and how hard is been working...and that felt good, but if they'd been paying any attention at all throughout the course they wouldn't have been surprised. I was going to submit some videos of my teaching and a resume this week, but then - without interviewing anyone, they put the two loudest, bubbliest students (who were mediocre teachers) on the schedule. It just felt clique-ey and frankly it hurt. \n\nI believe in compensating people fairly for their work and knowledge of course, but I felt like they cared only about collecting the 3k tuition from each of us, and they didn't care much about teaching yoga. I tried to stay positive until the very end but I can't shake the feeling that they churned us through for money, and put in as little work as possible. It feels so unethical, and I can't speak out about it because I'm trying to establish myself as a teacher in this community. I still feel so lost as to where to even begin gathering the knowledge, skills, experience, and spiritual community that I'm looking for. \n\nI feel like this totally turned me off the studio, which had been my refuge and source of inspiration for the past year. I'd love some encouragement and direction, or solidarity if you've been through something similar. I'm just disappointed. ",
    "score": 26,
    "url": "",
    "created_utc": 1744162324.0,
    "author": "walkinthedust-10",
    "permalink": "/r/yoga/comments/1juu7pi/ytt_turned_me_off_my_studio/"
  },
  {
    "title": "Does anyone know what brand these are? I can’t find it anywhere. I found them at a thrift store and they are the best fitting leggings I’ve ever worn",
    "body": "",
    "score": 26,
    "url": "",
    "created_utc": 1743967835.0,
    "author": "Zestyclose-Archer-72",
    "permalink": "/r/yoga/comments/1jt2btq/does_anyone_know_what_brand_these_are_i_cant_find/"
  },
  {
    "title": "Name of this Asana?",
    "body": "I'm hoping to offer this asana in one of my classes this week but can't for the life of me find the name! Does it even have one? Thanks in advance :) ",
    "score": 27,
    "url": "",
    "created_utc": 1743967377.0,
    "author": "wi-rose",
    "permalink": "/r/yoga/comments/1jt25gw/name_of_this_asana/"
  },
  {
    "title": "Help- I can do a bow pose but can’t get a camel",
    "body": "I recently achieved a bow pose and I was ecstatic I literally called for my mom to come witness my achievement. But I can not for the life of me get into a camel I’ve tried a few times but the pose is very uncomfortable even with blocks at the highest “setting”. What’s up with this? Isn’t it basically the same pose?",
    "score": 19,
    "url": "",
    "created_utc": 1744134899.0,
    "author": "steampunkpiratesboat",
    "permalink": "/r/yoga/comments/1jujxqx/help_i_can_do_a_bow_pose_but_cant_get_a_camel/"
  },
  {
    "title": "Manduka Pro Magic Eraser “Hack”",
    "body": "Shout out to the Redditor who said to use a Magic Eraser to break in the mat.  I should have saved the info and I didn’t.\n\nI never had any major issues with slippage, but it was worth exploring.\n\nThe Magic Eraser process was quick and easy.\n\nWherever you are, thank you!",
    "score": 18,
    "url": "",
    "created_utc": 1744510562.0,
    "author": "myrealityrightnow",
    "permalink": "/r/yoga/comments/1jxxdh5/manduka_pro_magic_eraser_hack/"
  },
  {
    "title": "Jade Yoga Customer Service Nightmare",
    "body": "I thought it might be helpful to share my experience with Jade Yoga’s customer service to save people the headache that I’m experiencing. \n\nI wanted to upgrade my yoga mat and based on reviews I decided to order a mat from Jade Yoga. When it arrived I loved how sticky it was. Like glue! But I noticed a very distracting black smudge right at the top. Basically under my face in down dog. Super distracting. \n\nI contacted customer service about an exchange or return on Monday. I didn’t hear back until Wednesday. The told me just to wipe it with water. I included photos in my initial email. If she looked at the picture it clearly couldn’t be cleaned with water. I emailed her back letting her know that and I have still not received a response. It’s now Saturday and I have sent a total of six emails with no reply. \n\nI thought I was buying a luxury product, but their customer service has been terrible, initially I just wanted to exchange it for one without the mark but now I am going to return it. I can’t give a company that treats their customers like this my business. Their product seems nice, but I would recommend taking your business elsewhere.",
    "score": 16,
    "url": "",
    "created_utc": 1744476118.0,
    "author": "Sunnydayday",
    "permalink": "/r/yoga/comments/1jxli4r/jade_yoga_customer_service_nightmare/"
  },
  {
    "title": "First hot yoga practice",
    "body": "I did it! 55m been practicing a couple times a week for the past 3+ years. My former yogi mentioned a groupon 5 pack for hot yoga. First practicec was yesterday and WOW! It really is hard to describe. Harder and easier at the same time. I think I'm hooked. \n",
    "score": 18,
    "url": "",
    "created_utc": 1743941936.0,
    "author": "No-Lunch-1005",
    "permalink": "/r/yoga/comments/1jssttq/first_hot_yoga_practice/"
  },
  {
    "title": "Is liforme mats premium?",
    "body": "I am looking to gift my mom a yoga mat since she hasn’t had a good mat in years. I currently can afford some really good mats and I came across liforme. I particularly know close to zero about yoga mats. So need some advise on what would be the best mat in the market to gift my mom. What are some other brands that I could look into. ",
    "score": 17,
    "url": "",
    "created_utc": 1744364891.0,
    "author": "ReleaseEconomy3186",
    "permalink": "/r/yoga/comments/1jwm0kk/is_liforme_mats_premium/"
  },
  {
    "title": "What type of yoga is best for hip stiffness/pain?",
    "body": "I am fairly new to yoga, I have done it on and off throughout the years, but I am trying to get back to a more regular practice due to experiencing pain and stiffness in my hips. This stiffness is worrisome to me because I am only 23 and my family has a history of joint disorders including arthritis, and I really don't want to have that lol! I thought that just by staying active with regular strength and cardio would keep things from becoming stiff, but I was wrong and now I am trying to supplement yoga into my workouts because I read somewhere that it helps with mobility. \n\nI was looking through yoga videos and I was a bit overwhelmed with what poses or types of yoga would be best for restoring mobility, so any help would be greatly appreciated in figuring out what I should do for my practice. :D\n\nThank you everyone for your time! ",
    "score": 18,
    "url": "",
    "created_utc": 1744303768.0,
    "author": "xXLady_RevenantXx",
    "permalink": "/r/yoga/comments/1jw2lwe/what_type_of_yoga_is_best_for_hip_stiffnesspain/"
  },
  {
    "title": "Do you feel like you know how to use props?",
    "body": "Do you use them in poses if they’re not explicitly cued? Do you have props at home but don’t use them as much as you’d like? \n\nWhich props do you own? Do you wish you knew how to use them? \n\nEdit: I’m surprised to see mostly lovers of props here. All who know how to use their props. I was expecting more of a mix. If you’re a prop hater let me know.",
    "score": 17,
    "url": "",
    "created_utc": 1744036655.0,
    "author": "Dapper_Fault_4048",
    "permalink": "/r/yoga/comments/1jtmskm/do_you_feel_like_you_know_how_to_use_props/"
  },
  {
    "title": "I’m disabled - what type(s) of yoga would work for me?",
    "body": "Hi! I (22) have tried yoga in the past very briefly and would like to pick it up again, as a form of low intensity exercise. I’m here to ask what kind(s) of yoga you think would or would not benefit me, either from mere yoga-related knowledge or personal experience with disabilities. \n\nUnfortunately I have POTS, which means my blood tends to pool in my legs and my heart rate tends to spike (I’m talking 110 when I sit on a chair) whenever I am not fully horizontal. On top of that, I have chronic migraines that get triggered by heat and exercise. Both of these disabilities also get triggered when I bend/crouch down and then get back up; my heart and head start pounding, I tend to develop migraines, and doing this too often induces a heavy, long-lasting feeling of fatigue. Specifically, positions like downward-facing dog have really messed me up in the past. \n\nNow, I am already walking through several treatments for these disabilities with my care providers, but so far nothing has allowed me to exercise without exacerbating my symptoms. We are still searching for the right treatment. What I do know is that I need to keep exercising to prevent de-conditioning. To keep somewhat physically fit and also hopefully experience some mental benefits, I would like to try yoga again. \n\nWhat kind(s) of yoga do you think would work for me, and what kind(s) would not, or perhaps you know positions to practice or avoid? If you need more information to help me - feel free to ask. Thanks :) ",
    "score": 17,
    "url": "",
    "created_utc": 1744452710.0,
    "author": "Zestyclose_Willow403",
    "permalink": "/r/yoga/comments/1jxe18t/im_disabled_what_types_of_yoga_would_work_for_me/"
  },
  {
    "title": "Constant yawning?",
    "body": "I’ve been doing yoga for years, and just in the last couple weeks, I have noticed I’m yawning in class all the time. Nothing has changed about my breathing, I’m not extra tired the rest of the day, and I there’s no consistency with the poses that trigger the yawn. Anyone have thoughts?",
    "score": 14,
    "url": "",
    "created_utc": 1744297560.0,
    "author": "sheshops12",
    "permalink": "/r/yoga/comments/1jw05lp/constant_yawning/"
  },
  {
    "title": "Don't know how it's possible, but i was much more stressed out when i did yoga everyday.",
    "body": "The yoga itself felt good and energizing, like a cure tbh. It was plank, tadasana, urdhva tadasana with back stretching, virasana, adho + urdhva mukha svanasana. \n\nBut like an hour after that, at uni, it was so easy for my muscles to be more tense than before the excercises, i was also more emotional/impulsive in that time. I took a break with yoga, focused on strenght excercises instead and suddenly my mental health is better.\nHow can you explain it? ",
    "score": 15,
    "url": "",
    "created_utc": 1744151925.0,
    "author": "Least_Morning2698",
    "permalink": "/r/yoga/comments/1juqpcd/dont_know_how_its_possible_but_i_was_much_more/"
  },
  {
    "title": "Class Energy",
    "body": "So I think I'm in full blown fitness burnout and I know yoga is about remembering your true identity and finding bliss, BUT because it's also tied to being in the body, I am dreading my return to yoga classes.  I'm kind of locked in at least for a few more months because of a membership and I guess I could pay and just not go.  Seems ridiculous to waste money though, so I'm wondering if it will disturb the vibe of the class too much if I go and smile even though I want to flip out internally.  I know some people are energy sensitive so I'll do what I can to control my field. The negativity is just heavy and a little hard to contain and I would hate to bring such  bummer feels  to the space.  Are you usually able to tune out other peoples stuff or does all that collective breathing and moving get you on other people's wavelengths? Just trying to decide. Might have to gift my membership to someone if the energy thing is that intense for others. ",
    "score": 14,
    "url": "",
    "created_utc": 1744080276.0,
    "author": "Usual_Artist_5277",
    "permalink": "/r/yoga/comments/1ju3em5/class_energy/"
  },
  {
    "title": "How does yin yoga differ from simply holding passive stretches for 3+ minutes in terms of flexibility gains (in addition to the psychological benefits)?",
    "body": "I train in gymnastics and contortion where it’s common to hold passive stretches for over 3 minutes. I also practise yin yoga. I’ve tried to look up how yin yoga might provide unique flexibility gains that long passive stretching doesn’t but haven’t found many resources.\n\nFrom what I’ve learnt:\n\n* Yin yoga is practised without warming up and in a relatively cool environment, so it targets the fascia and connective tissue. In contrast, holding long passive stretches after a warm-up target the muscles.\n* In my personal experience, long-hold passive stretching in gymnastics and contortion focus more on front and side oversplits (hip flexion, extension, abduction, hamstrings, hip flexors), whereas yin yoga does more “hip openers” (hip external rotation). \n\nSo, in addition to the psychological benefits yin yoga offers, does it help improve flexibility in ways that simply holding passive stretches for 3+ minutes doesn’t?\n\nThanks in advance. ",
    "score": 14,
    "url": "",
    "created_utc": 1744030515.0,
    "author": "BigBigMarmott",
    "permalink": "/r/yoga/comments/1jtkk8q/how_does_yin_yoga_differ_from_simply_holding/"
  },
  {
    "title": "Taking a leave from class",
    "body": "I have been attending a Mysore Ashtanga class for over 2 years, but lately I'm just not connecting with it like I used to. It's a weekday class and I used to go daily but now I have to push myself to go 1-2 times a week. I've been picking up other things, working with a personal trainer on strength building, and some other things, so I'm still active. For those that have attended long-term, do you try and push through that period when you don't want to go, or do you allow yourself to take a break? I don't want to lose all the flexibility and the core strength I have built, but I'm just struggling to attend. I could give several different reasons; classroom changed, mat spacing is tighter, one teacher left. Ultimately though I think I'm just not feeling it and I'm not really sure why. Is this normal, and how do you handle it? I haven't really talked about it with my teacher but I am sure she knows something is up because my attendance is flagging.  \n\nAny advice is appreciated. ",
    "score": 13,
    "url": "",
    "created_utc": 1744028735.0,
    "author": "Aseneth220",
    "permalink": "/r/yoga/comments/1jtjzb4/taking_a_leave_from_class/"
  },
  {
    "title": "Knee replacement and yoga",
    "body": "\nI have avoided a knee replacement for years for a variety of reasons. The biggest reason was how it might affect my yoga practice. Things have gotten so bad I’m barely able to do much of anything. I’d love to hear from people who’ve had knee replacement and still do yoga or teachers that work with knee replacement yogis. ",
    "score": 13,
    "url": "",
    "created_utc": 1744413756.0,
    "author": "Numerous_Ad_2409",
    "permalink": "/r/yoga/comments/1jx3lh4/knee_replacement_and_yoga/"
  },
  {
    "title": "Triceps & downward dog?",
    "body": "I've been doing yoga for a few years and doing downward dog just kills my triceps for some reason. It doesn't seem to bother anyone else though. I consider myself to be in good shape, I workout my arms pretty well but when we do downward dog my triceps light up and start cramping pretty quickly. Any advice?",
    "score": 14,
    "url": "",
    "created_utc": 1744223514.0,
    "author": "lazy_phoenix",
    "permalink": "/r/yoga/comments/1jvd3au/triceps_downward_dog/"
  },
  {
    "title": "Healing journey",
    "body": "I went off into a sad state having hurt my back recently, I fell while walking my dog and I ended up straining my back badly. After almost 1 full week of bed rest and abstaining from yoga, I miss it a lot. I know I have pain still, so I’m still resting. I’m worried all my progress will disappear! I know it’s not the point but I wanted to share my experience here because it’s important to recover from injury first 🪷",
    "score": 12,
    "url": "",
    "created_utc": 1744146370.0,
    "author": "Thegoldmagician",
    "permalink": "/r/yoga/comments/1juol2n/healing_journey/"
  },
  {
    "title": "why do teachers mumble??",
    "body": "ok this is more of a rant but i’ve encountered several teachers who will turn the volume up on their music, and mumble cues throughout the entire class. or they give cues almost as throwaway lines? \n\nit is to the point where i cannot hear them at all,  especially if im in postures where i can’t turn my head to see what the instructor is doing and have to rely on spoken cues, it’s literally impossible! so there are times where im just lost in class trying to keep up because i cant hear shit, and then they give the most niche variation or transition, mumbling through it, and explaining it so poorly i end up bewildered and behind LOL\n\nwhyyy do teachers do this? it infuriates me so badly like please SPEAK UP!! im begging you to project your voice 😭  how do i kindly ask them or let them know to speak up? ",
    "score": 12,
    "url": "",
    "created_utc": 1744468200.0,
    "author": "cheerio-dust",
    "permalink": "/r/yoga/comments/1jxikth/why_do_teachers_mumble/"
  },
  {
    "title": "Newbie : Started 30 days yoga challenge today",
    "body": "I have always found yoga boring (idk why), but a few weeks ago I joined “habuild” free session (not promoting them) &amp; I enjoyed it!\nI was surprised but maybe it clicked for me.\n\nNow I am not a morning person at all (but I have been wanting to be one for like years). Today I had to get up early @6am for some personal errands - and I thought I have time let me just do yoga (now trust me i have never consciously wanted to do it but this was new). \nI was so excited I pulled up a video on yt &amp; did 30mins yoga session today (stretching + exercises + bhastrika) \nAnd I feel so gooooooood!!! 🥹🥹 I lOVE this feeling- I have never felt good after a workout (mostly felt tired and drained always)\n(Except my hands start to feel itchy &amp;red  on yoga mat) 😭\n\nI just wanted to share somewhere. I have now decided to commit to yoga for a month and see how I feel :) \n\nCan I also mix few mins of strength training with yoga? (Eventually)\n\nAny yt recommendations &amp; tips on how to be disciplined are welcome (: \nThanks for reading 🩷\n",
    "score": 10,
    "url": "",
    "created_utc": 1744425265.0,
    "author": "Fearless-Someone",
    "permalink": "/r/yoga/comments/1jx77pe/newbie_started_30_days_yoga_challenge_today/"
  },
  {
    "title": "How can i stay a part of my yoga community during recovery from abdominal surgery? Especially during the first few weeks—would it be weird to sit through a class?",
    "body": "I have an upcoming abdominal surgery that will be through my c-section scar. Surgeon said it would be 12 weeks before i could hold a plank, and probably 2-4 weeks at least before stretching other areas than my core. I go to 3-5 classes a week currently. ",
    "score": 9,
    "url": "",
    "created_utc": 1744509622.0,
    "author": "Internal-Tough6850",
    "permalink": "/r/yoga/comments/1jxx3f1/how_can_i_stay_a_part_of_my_yoga_community_during/"
  },
  {
    "title": "Reclined poses with scoliosis?",
    "body": "I've been getting into yoga recently (4 months or so), but I still haven't really gotten around a particular quirk of scoliosis. It forces the muscles on one side of your back down, and the other side up, which causes you to naturally rest on one side of the back instead of the other; it's basically impossible to be perfectly centered on your spine without putting in effort to balancing. Think trying to do a reclined pose with a tiny block on one side of your back.\n\nIn yoga, it basically forces me into a dilemma: do a reclined pose on one side of the back, or put more concentration on balancing instead of some other elements? It can also be quite painful if I have to sway from side to side on the back, as all of that weight gets put on the spine itself for a moment, and then the weight slams down on the other side of the back. Has anyone got any tips or workarounds for any of this?\n\nAs a side note, my scoliosis is not posture-related, it was caused by my spine twisting itself during my final growth spurt. I am not asking if yoga can/should reverse it, because it cannot; I would need surgery. I am also not asking if/how it can help with the effects. I am just asking how to better do poses on my back, because scoliosis makes it a bit complicated.\n\nApologies to the mods if this is a Certified Bad Post™!",
    "score": 11,
    "url": "",
    "created_utc": 1744495471.0,
    "author": "Phobic_Nova",
    "permalink": "/r/yoga/comments/1jxsnfz/reclined_poses_with_scoliosis/"
  },
  {
    "title": "Staff pose 🤷🏽‍♀️",
    "body": "I don't get staff pose. To me, it's just sitting with legs stretched out, hands next to hips, keeping a straight spine. I could sit here for hours... I'm not sure what I'm supposed to be feeling. I do have flexible hamstrings, like I can place my palms flat on the ground in forward fold so perhaps why it feels like just sitting. What can I do to get more out if tge adana.\n",
    "score": 10,
    "url": "",
    "created_utc": 1744058751.0,
    "author": "Upliftbonne",
    "permalink": "/r/yoga/comments/1jtvuky/staff_pose/"
  },
  {
    "title": "[COMP] Different window, same light…and a cat 🐱",
    "body": "A gloomy and chilly Sunday. Throwing some handstands while cooking lunch. Who else can’t help but to handstand anywhere/anytime? 😅 what’s the weirdest place you have made a handstand? For me it was back before pandemic, on my office bathroom 🙈the place was huge and no one was around so I thought why not? 🤣\nHappee Sunday everyone 🙏🏽💞",
    "score": 20,
    "url": "",
    "created_utc": 1744544218.0,
    "author": "Prestigious-Olive130",
    "permalink": "/r/yoga/comments/1jy5o80/comp_different_window_same_lightand_a_cat/"
  },
  {
    "title": "A lower priced alternative for the Root Board?",
    "body": "I have a room to practice in but unfortunately it's carpeted. I found the [Root Board](https://www.therootboard.com/), it looks great, but it's pretty outside of my budget, especially over here in the UK. Does anyone know of a similar alternative?",
    "score": 9,
    "url": "",
    "created_utc": 1744401594.0,
    "author": "ringalingthing",
    "permalink": "/r/yoga/comments/1jwz2w1/a_lower_priced_alternative_for_the_root_board/"
  },
  {
    "title": "Yoga in xian China",
    "body": "Did a class for 40 cents in xian on an app for discounts. Anyways, it was fun since I haven’t been able to do a yoga class in 2 months being on the road. Been hitting the gym or ring training though.\n\nThe teacher or 老师 helped me with technique and positioning and it sure helped a lot. Everybody said hi and I spoke broken Chinese. I really like the energy. \n\nI’ll take more discounted yoga classes around xian before travelling wherever the road takes me haha.",
    "score": 10,
    "url": "",
    "created_utc": 1744381769.0,
    "author": "PlayfulIndependence5",
    "permalink": "/r/yoga/comments/1jwr93m/yoga_in_xian_china/"
  },
  {
    "title": "Difficulty ending shavasana / finding back to body",
    "body": "Does anyone else have problems with ending shavasana and finding back to your body? I do yoga alone with video and experience this with audio meditations, too. During shavasana, I feel so calm and empty and peaceful and when it’s time to end, it’s very hard for me to wiggle my fingers and toes and sit up eventually. I cant fathom if its an “I don’t want it to end” or an “I physically can’t”. I have a history of dissociation due to psychological problems and those episodes can feel similar at times. Maybe it’s hard for me to control meditation, because my brain is used to space out uncontrollably? Does anyone have an idea on how to facilitate getting control over body and mind again?",
    "score": 9,
    "url": "",
    "created_utc": 1744112958.0,
    "author": "Master-Cranberry0",
    "permalink": "/r/yoga/comments/1jubln1/difficulty_ending_shavasana_finding_back_to_body/"
  },
  {
    "title": "If you lift both knees off your arms in crow pose, is this called anything?",
    "body": "There are the 1 legged crows, but if you take both knees off what is it called? The no legged crow? The flying crow?",
    "score": 8,
    "url": "",
    "created_utc": 1744120507.0,
    "author": "TreesFreesBrees",
    "permalink": "/r/yoga/comments/1jue52p/if_you_lift_both_knees_off_your_arms_in_crow_pose/"
  },
  {
    "title": "Seated forward fold help",
    "body": "Ever since I did this, and I had a spasm in my calf, it’s been happening more and more frequently, but only when I do the forward fold in a seated position. I noticed first I’ll feel numbness and tingling in my lower limbs bilaterally. After that, my left calf spasms. It’s extremely difficult to keep the pose in yin yoga so I do back off after a certain period of time has elapsed. If I keep pushing through eventually, I’ll get the cramp again and it’ll hurt my practice for the rest of the class. I’m wondering why my lower limbs both get so tired and numb when I’m doing a forward fold when I’m seated only. Is it because my glutes are too compressed and I am compressing my sciatic nerve too much? \n\nWhen I do a standing forward fold, I can definitely go a lot further, but when I’m seated, it’s really hard on my legs for some reason. \n\nI know that my left calf muscle is a little bit stressed in general and tends to be hypertonic, but I don’t ever experience cramps there unless I’m doing this pose for an extended period of time. It’s really only in the left leg but both legs get very numb.\n\nIf you know what to do please help me. I know that this is not exactly medical advice that I’m looking for, but I’m just wondering what’s going on.\n\nThank you so much\n",
    "score": 7,
    "url": "",
    "created_utc": 1744424189.0,
    "author": "Thegoldmagician",
    "permalink": "/r/yoga/comments/1jx6w25/seated_forward_fold_help/"
  },
  {
    "title": "Re-post: Yoga institutes in Rishikesh",
    "body": "I had posted this in other sub but did not get any responses. So here, I am again: \n\nHi all, I am looking for suggestions for a decent yoga institute in Rishikesh (even Goa is okay or any other place if the institute is really good and fits my requirements). Here are some specifics I am looking for:\n\n1. Reasonable (30-50k)\n2. Has flexible timings. I work also so I wish to continue working while learning\n3. Has some accommodation options or has reasonable accommodation nearby\n4. Safe for women.\n\nI would really appreciate that you don't give random recommendations. If you or your loved ones have really learnt yoga from these places, please let me know.\n\nI am looking for a 200 hours teacher training course. I have learnt basics in yoga and do not practice daily.",
    "score": 8,
    "url": "",
    "created_utc": 1744353763.0,
    "author": "Meera_culous",
    "permalink": "/r/yoga/comments/1jwjja4/repost_yoga_institutes_in_rishikesh/"
  },
  {
    "title": "Knees chest chin",
    "body": "Is this a good alternative to chaturanga ? I’ve been doing ashtanga quarter/half series almost daily but the amount of vinyasas are a bit hard on my shoulders/ arms. Would practicing “knees chest chin” be better or just holding a plank ",
    "score": 7,
    "url": "",
    "created_utc": 1744301788.0,
    "author": "Dangerous_Energy3309",
    "permalink": "/r/yoga/comments/1jw1tn1/knees_chest_chin/"
  },
  {
    "title": "Sutra Study Group",
    "body": "Putting together a study group to discuss the sutras and to be with people are also walk the path of yoga.. Figured I would just begin with say 1.1-1.10 or something like that, but curious how others who have put together a study group have done it? In YTT I remember we would have dharma talk time, go through the sutras but we would bounce around the book more so in book 2 where the limbs are discussed. I want your input! ",
    "score": 7,
    "url": "",
    "created_utc": 1744293418.0,
    "author": "hadyisrad",
    "permalink": "/r/yoga/comments/1jvyjcu/sutra_study_group/"
  },
  {
    "title": "Looking for guided video that changed my life",
    "body": "Looking for a guided whole body stretch/yoga flow video that I found one summer day in 2013.  It was a guided full body stretch and it was delivered by a middle-aged east-asian type man.  He wasn't doing the exercises, just instructing, but instructing down to every movement and every single breath taken.  I think he was sitting and speaking to the camera but that part is fuzzy.  I found it incredibly easy to follow and gave me a framework to start a daily movement routine which i kept up for like 5 years.  Am trying to get back into it.  I have a vivid memory of at one point being on my back with one leg pulled up and the instructor was saying to breathe, and at each exhale feel the stretch go a little deeper... something like that.  \n\n  \nDoes anyone know what i'm talking about? I have tried many many times to find this video but can not seem to conjure it up. ",
    "score": 7,
    "url": "",
    "created_utc": 1744082968.0,
    "author": "tomjoad773",
    "permalink": "/r/yoga/comments/1ju47y9/looking_for_guided_video_that_changed_my_life/"
  },
  {
    "title": "One leg falls in during seated straddle",
    "body": "Long time yogi, new to r/yoga. I have been having this issue for a while, where when I sit in a straddle and do a forward fold, I find it near impossible to keep my left toes pointed up. My right leg is totally fine, toes pointed up with minimal to no effort. The left leg falls forward, and if I try to hold it up it gets fatigued SO quickly. Any ideas on what muscle is lacking here?\n\nI also have noticed some minimal differences in stability during squat poses between my legs, which is why I'm leaning toward a specific muscle may be weaker than the other.",
    "score": 5,
    "url": "",
    "created_utc": 1744254293.0,
    "author": "whistleable",
    "permalink": "/r/yoga/comments/1jvo3k5/one_leg_falls_in_during_seated_straddle/"
  },
  {
    "title": "Breathable Clothing",
    "body": "Another post reminded me, but I wanted your recommendations on the most breathable, non-sweaty yoga clothes.  I’d love to be able to literally feel a breeze through the fabric.  Like I try to stand as close to the A.C. vent as I can.  Thanks everyone!",
    "score": 6,
    "url": "",
    "created_utc": 1744249602.0,
    "author": "Thin-Satisfaction816",
    "permalink": "/r/yoga/comments/1jvmmhw/breathable_clothing/"
  },
  {
    "title": "Natural fiber yoga pants/bike shorts",
    "body": "Hi all, I’d like to transition my wardrobe away from synthetic fibers and am looking for natural fiber workout wear, starting with yoga pants/bike shorts/running shorts/sports bras. Any recommendations?",
    "score": 5,
    "url": "",
    "created_utc": 1744224167.0,
    "author": "Possible-Landscape72",
    "permalink": "/r/yoga/comments/1jvdcsl/natural_fiber_yoga_pantsbike_shorts/"
  },
  {
    "title": "Knee pain after taking a break",
    "body": "I'm in my late 30s, low BMI, and have been attending a fast Vinyasa class 2-3 times a week for over a year. This is my main form of exercise currently. Otherwise I have a sedentary job\n\nUnfortunately, I had to take a couple of months off yoga class Dec - February due to life stuff that took precedence \n\nI've noticed that my knee caps and joints have become noticably uncomfortable, snapping and popping and sore, since I was forced to take time off from exercise. We do a lot of one leg poses in class\n\nI expected starting up again to be tough but wasn't anticipating all of the knee pain (in both knees) after classes. It literally woke me up in the night\n\nShould I just be easing in more? Is my form terrible and causing me injury? Any recommendations??\n\nI deeply love yoga and want to figure out how to protect my joints :/\n\nThanks for any insight!",
    "score": 6,
    "url": "",
    "created_utc": 1744038519.0,
    "author": "gal_dukat86",
    "permalink": "/r/yoga/comments/1jtnjwa/knee_pain_after_taking_a_break/"
  },
  {
    "title": "Towel Recommendations for XL Mat",
    "body": "After looking into a bunch of mat options, I ended up with a Lulu Big Mat in hopes I wouldn’t need a towel for hot yoga. That is not the case! The Yogitoes is long but standard width, which seemingly nullifies my big mat and I don’t love the idea of starting to sweat before I put an equa down. Suggestions please! ",
    "score": 6,
    "url": "",
    "created_utc": 1743953560.0,
    "author": "Dense_Mullet",
    "permalink": "/r/yoga/comments/1jswsr7/towel_recommendations_for_xl_mat/"
  },
  {
    "title": "Have any of you kept your liforme looking new?",
    "body": "Hi, \n\nI like the aesthetic of liforme and am looking to make a purchase. But I’m scared it will stain and look bad after a couple of uses. \n\nHave any of you kept your liforme looking new? Ideally after a couple years of usage?\n\nWhat was your trick to maintaining it? Or is the staining problem something only a minority of people experience? \n\nThanks",
    "score": 5,
    "url": "",
    "created_utc": 1744150096.0,
    "author": "LongjumpingFig6777",
    "permalink": "/r/yoga/comments/1juq1d8/have_any_of_you_kept_your_liforme_looking_new/"
  },
  {
    "title": "Vikasa (Koh Samui) - experience, recommendations?",
    "body": "I’m not super active on Reddit so not sure I have enough karma for this to be seen, but here goes:\n\nI put down a deposit for a Vikasa retreat this summer and am so, so excited — searching this sub I found a handful of recommendations but not a ton of detail (please correct me if I missed another post on this!). Looking at reviews on Trip Advisor, etc. people have mostly mentioned a lot of stairs (which I don’t mind) as well as construction noise.\n\nIs there anything from your own experience that could be helpful? Items you wish you’d packed, questions or requests to make beforehand, accommodations, excursions/activities/beaches you’d recommend? Flying in from Bangkok vs Singapore?\n\nI’ll be there for a week-long master workshop rather than a solo retreat. I’m looking forward to it regardless but would love to hear more from anyone who’s been! Thanks in advance ~",
    "score": 5,
    "url": "",
    "created_utc": 1744038106.0,
    "author": "unidentified_worm",
    "permalink": "/r/yoga/comments/1jtndrw/vikasa_koh_samui_experience_recommendations/"
  },
  {
    "title": "Yoga History and Philosophy Discussion Thread",
    "body": "Ask questions and discuss here.",
    "score": 5,
    "url": "",
    "created_utc": 1744003832.0,
    "author": "AutoModerator",
    "permalink": "/r/yoga/comments/1jtdxzz/yoga_history_and_philosophy_discussion_thread/"
  },
  {
    "title": "Yoga Nidra made me feel less relaxed?",
    "body": "I just did a yoga nidra class online.  For some reason during the class I really could sense the tension in my body.  Like I became aware of the tension and really noticed it was there.  I also couldn’t relax my mind and my thoughts either.  I feel like the session just made me more aware of how tense I was instead of actually relaxing me.  Maybe it was the instructor and the method I don’t know but usually I am very relaxed in yoga nidra.  Was I doing something wrong?",
    "score": 5,
    "url": "",
    "created_utc": 1743984992.0,
    "author": "meditation_account",
    "permalink": "/r/yoga/comments/1jt8ga5/yoga_nidra_made_me_feel_less_relaxed/"
  },
  {
    "title": "sleeping yogi ( yoganidrasana)",
    "body": "i want to be able to achieve this pose but i’m not quite able to and i was wondering if there are any good stretches i can do ",
    "score": 5,
    "url": "",
    "created_utc": 1744350547.0,
    "author": "gaylord_108",
    "permalink": "/r/yoga/comments/1jwisbq/sleeping_yogi_yoganidrasana/"
  },
  {
    "title": "Persistent Numbness in Fingers Since Starting Yoga—Anyone Experienced This?",
    "body": "I started doing yoga a few months ago, going to classes 4–5 times a week—mostly Power Vinyasa and Deep Power Flow. Not long after I started, I noticed numbness in my right hand, specifically in my pinky and ring finger. It's been constant for months now and hasn’t gone away. There is no pain, just persistent numbness.\n\nI saw a specialist and had an X-ray done, but it didn’t show anything. I’ve been in physical therapy for a while now, but honestly, it hasn’t helped much.\n\nHas anyone else experienced something like this from yoga? I’m starting to think my only option is to stop practicing altogether, which sucks. Any advice or similar experiences would be appreciated.",
    "score": 5,
    "url": "",
    "created_utc": 1744250826.0,
    "author": "Luna_Rose123",
    "permalink": "/r/yoga/comments/1jvn0xx/persistent_numbness_in_fingers_since_starting/"
  },
  {
    "title": "Looking for a yoga home in Manhattan NYC?",
    "body": "I am on a yogic path right now that started with teacher training. While I love my training, It doesn’t scream yoga home. It’s a business and that okay because without I wouldn’t be on my journey. But I do want to find a yoga home where I can grow as I am truly a novice practitioner in the truest sense. Does anyone have insight in Sivananda Yoga Vendata Center? Or have any recommendations on yoga studios to visit? ",
    "score": 4,
    "url": "",
    "created_utc": 1744078415.0,
    "author": "Fit4ParGirlie",
    "permalink": "/r/yoga/comments/1ju2t6u/looking_for_a_yoga_home_in_manhattan_nyc/"
  },
  {
    "title": "Oko Living Yoga Rug?",
    "body": "Has anyone purchased an Oko living yoga rug or a dupe of one? I have recently been looking for a yoga rug in general for my own in-home practice for Ashtanga and Kundalini. And after a few google searches, I'm now getting ALL of the ads for Oko Living. I'm intrigued, but I really can't find any reviews for it anywhere. I am really turned off by the price, but I do value that they are hand loomed and would absolutely pay more for such. I guess what I'm asking is:\n\nAre they good quality?\nHow much do they shrink after being washed?\nHow much do they shed?\nHow well does the natural rubber on the base grip on flooring like wood and tile?\nAre the ridges for the hands and feet uncomfortable?\nWhat thickness did you select, and do you like it?\nHow strongly do the medicinal herbs smell? And how long did that smell last?\n\nMy next question is does anyone have any non-Oko yoga rugs that they like and would recommend? Have you tried any one of the many dupe of them on Etsy? I want to buy something for the quality and what it can bring to my practice, rather than the hype of these ads (they're definitely drawing me in, but I want to be very conscious of what I ultimately end up choosing). I'm looking for something which, preferably, has a natural rubber coating on the back as I have all wood and tile flooring as I'd like to minimize slipping. Something that won't shrink when washed (after initial washing as I know that is normal) and doesn't stretch too much when practicing. And is preferably hand loomed from natural and/or recycled materials. \n\nAm I looking for something that doesn't exist?\n\nThank you all preemptively! \n\n",
    "score": 4,
    "url": "",
    "created_utc": 1744036326.0,
    "author": "Mist_Fury54",
    "permalink": "/r/yoga/comments/1jtmo0b/oko_living_yoga_rug/"
  },
  {
    "title": "My head feels coming out of my neck due to extreme desk job, driving. What kind of yogas+posture correction techniques could help me?",
    "body": "I am an Indian. I'll take paid courses if required. (I am currently residing in kathmandu,nepal so physical classes need to be near kathmandu valley).\n\nOffice doesn't have ergonomic chair. It's a normal chair for everyone else.\n\nI do morning walk/jogging for 45 minutes (5kms). \n\nThen in office, I stand up every 2hrs or so. However, I am feeling somewhat pain on my neck. It feels like my neck has bended like a U shape. IDK if I am telling with correct English. I'd love some yoga stuffs, stretching stuffs etc.",
    "score": 4,
    "url": "",
    "created_utc": 1744033562.0,
    "author": "Keeper-Name_2271",
    "permalink": "/r/yoga/comments/1jtlm0x/my_head_feels_coming_out_of_my_neck_due_to/"
  },
  {
    "title": "Which Yoga studio offers the best classes in San Diego?",
    "body": "I am visiting San Diego next week and was thinking of attending few yoga classes/events and would love to meet some like minded people! Please share your favourite Yoga studios, I would love to visit a few of them.\nBy the way I am a Yoga Teacher also, I live &amp; teach in SF Bay Area, I want to explore classes in SD.",
    "score": 4,
    "url": "",
    "created_utc": 1744008255.0,
    "author": "yogabyanjali",
    "permalink": "/r/yoga/comments/1jtezbw/which_yoga_studio_offers_the_best_classes_in_san/"
  },
  {
    "title": "I’m going to be starting my 200h program, when I do yoga, I feel it’s a trauma release sometimes and I can often end up in tears…",
    "body": "Is this something I should be concerned about during the 200h program? I don’t fully know what to expect during the classes (it’s over a 6 month period) ",
    "score": 4,
    "url": "",
    "created_utc": 1743957450.0,
    "author": "BowlCareful8832",
    "permalink": "/r/yoga/comments/1jsy9xo/im_going_to_be_starting_my_200h_program_when_i_do/"
  },
  {
    "title": "Retreats in South America?",
    "body": "Hi all,\n\nWondering if you all have been to any retreats (any length) in Colombia, Ecuador, Peru or Chile? I’m just looking for recommendations of nice places. \n\nI’m 22F and have been participating in yoga for 3 years but am at a crossroads with jobs. I’d be there between September and end of December!\n\nThanks in advance for recommendations &amp; advice \n ",
    "score": 3,
    "url": "",
    "created_utc": 1744389830.0,
    "author": "Significant_Bee48",
    "permalink": "/r/yoga/comments/1jwuf7h/retreats_in_south_america/"
  },
  {
    "title": "I feel an uncomfortable tingling sensation in my hip / upper thigh when transitioning from one legged downward facing dog to “knee to opposite elbow.” Anyone else experienced this or have any insight?",
    "body": "I am fairly active and have been practicing yoga on and off for several years now and this just started happening in the last few months. And it’s only when I do that specific transition where I take my leg from a one legged downward dog and cross it through to the opposite elbow.\n\nIt’s almost like a prickling shock feeling. It stays for a few moments and then goes away. But it happens every time! My instructor hadn’t heard of that happening before and I have been modifying my practice more recently.\n\nIf anyone has had similar experiences or has any insight here I would be so thankful!",
    "score": 3,
    "url": "",
    "created_utc": 1744318864.0,
    "author": "Massive_Income7507",
    "permalink": "/r/yoga/comments/1jw8oqx/i_feel_an_uncomfortable_tingling_sensation_in_my/"
  },
  {
    "title": "🧘🏿Yoga studios overseas",
    "body": "Looking for yoga studios in Oslo and Bergen, Norway. And in Ljubljana, Slovenia. ",
    "score": 3,
    "url": "",
    "created_utc": 1744246964.0,
    "author": "HairCheap2773",
    "permalink": "/r/yoga/comments/1jvlswy/yoga_studios_overseas/"
  },
  {
    "title": "Light on yoga has two versions which one should I use?",
    "body": "Hello all,\n\nI have seen there are two light on yoga books, one is \"Light on Yoga: The Definitive Guide to Yoga Practice\" and the other one is \"Light on Yoga: The Bible of Modern Yoga - Its Philosophy and Practice - By the World's Foremost Teacher\".\n\nDoes anyone know if there is a difference or something? Which one do you recommend?\n\nThank you in advance and regards",
    "score": 2,
    "url": "",
    "created_utc": 1744128383.0,
    "author": "javierguzmandev",
    "permalink": "/r/yoga/comments/1juh9m0/light_on_yoga_has_two_versions_which_one_should_i/"
  },
  {
    "title": "Good grippy towel for hot yoga?",
    "body": "Hey everyone,\n\nI’ve been doing hot power yoga on a regular basis now for years….\n\nI use a B Mat (which I think is losing some grip)….I’ve tried microfibre towels and I tried a Lululemon towel…but I still slip and slide everywhere.\n\nDoes anyone have any suggestions for good grippy towel recommendations?\n\nThanks everyone!",
    "score": 2,
    "url": "",
    "created_utc": 1744025467.0,
    "author": "HANDUBAM",
    "permalink": "/r/yoga/comments/1jtj0dw/good_grippy_towel_for_hot_yoga/"
  },
  {
    "title": "OKC studios",
    "body": "Where do you guys in Oklahoma City go to classes?  My wife and I go to Vasa, but I might want to try a few other places to change it up.",
    "score": 2,
    "url": "",
    "created_utc": 1743986378.0,
    "author": "theCAVEMAN101",
    "permalink": "/r/yoga/comments/1jt8w45/okc_studios/"
  },
  {
    "title": "Yoga with frozen shoulder",
    "body": "I work a pretty physically labourous intense job and used to do a short yoga routine in the morning to prepare my body for the day.  I loved it.\n\nI've had frozen shoulder since summer 2024 and couldn't do a lot of positions so stopped my routine.\n\nI am currently doing PT and they've recently started me on cat/cow to help remobilize my shoulder blade (yay).  What other positions can I add in to increase my practice?",
    "score": 2,
    "url": "",
    "created_utc": 1744544433.0,
    "author": "Sprinqqueen",
    "permalink": "/r/yoga/comments/1jy5q7f/yoga_with_frozen_shoulder/"
  },
  {
    "title": "question for instructors",
    "body": "would you find it rude if you taught a class and a student brought ankle or wrist weights? for an extra challenge?\nfor reference it’s a hot vinyasa flow class",
    "score": 1,
    "url": "",
    "created_utc": 1744397191.0,
    "author": "spill-the-TEAxx",
    "permalink": "/r/yoga/comments/1jwxd34/question_for_instructors/"
  },
  {
    "title": "Yoga wear for tall people",
    "body": "Hi all I’m looking for recommendations for tall-friendly yoga clothing mostly trousers/bottoms \n\nI’m female and 6ft 1, so it’s real tricky to find any trousers that are long enough, especially activewear! 😂\n\nThanks 🙏🏻 ",
    "score": 1,
    "url": "",
    "created_utc": 1744389055.0,
    "author": "Express_Ant9955",
    "permalink": "/r/yoga/comments/1jwu48h/yoga_wear_for_tall_people/"
  },
  {
    "title": "Looking for Authentic Raja & Hatha Yoga Classes (Not Just Modern Mindfulness or Hot Yoga)",
    "body": "Hi everyone,  \nI’ve recently started diving into Raja Yoga and Hatha Yoga, and I’m looking to deepen my practice with guidance from experienced teachers. Ideally, I’d love to find online classes/teachers that stay true to the traditional Indian roots of yoga.\n\nI’m **not** looking for fitness-focused or trendy styles like hot yoga or simple mindfulness meditation classes. I’m hoping to find a space where yoga is taught as a path to **self-inquiry**, **inner transformation**, and a deeper **connection with the Self**—the way it was originally practiced by yogis.\n\nIf anyone knows of teachers, studios, or communities online that align with this kind of approach, I’d really appreciate any recommendations. Or if anyone is a teacher I would love to connect with you as well. Thanks in advance!\n\n",
    "score": 1,
    "url": "",
    "created_utc": 1744151878.0,
    "author": "Fantastic-Cup6820",
    "permalink": "/r/yoga/comments/1juqord/looking_for_authentic_raja_hatha_yoga_classes_not/"
  },
  {
    "title": "Do you recommend a yin teacher training?",
    "body": "I have a 200hr cert and have been teaching hatha and restorative for a decade. If you’ve taken an in-person training I’d be interested in hearing about your experience. I’m not an online person.\nI have the Paul Grilley book and am ready to read it. A class environment would be good to augment my learning for sure but can anyone provide insight?",
    "score": 1,
    "url": "",
    "created_utc": 1744150508.0,
    "author": "AlarmingMonk1619",
    "permalink": "/r/yoga/comments/1juq6qs/do_you_recommend_a_yin_teacher_training/"
  },
  {
    "title": "Questions about The heart of yoga",
    "body": "So I started reading The Heart of Yoga by TKV Desikachar, I'm not very far in the book, but some of the first asanas he shows early on include headstands.\n\nI was a bit worried like, how the hell am I going to do that, then started looking at some videos, but also started thinking : wait, with my heart condition, aren't inverted poses like that kind of dangerous/bad?Looked around a bit and found things that seemed to confirm so.\n\nSo I guess I gotta avoid those. This ain't a problem in a way since the author reminds many times that you have to adapt the yoga to the individual.\n\nBut now I also lost a bit of trust for him. What if I didn't search online and just blindly tried the pose? (which it seems, can also be dangerous for many other reasons)\n\n  \nAnother question I have, is that he stresses a lot that you gotta have a teacher otherwise it's not the same. Maybe he'll develop more on that later on, but then if I can't get one (too expensive for me around here sadly), what is a book like that for? Am I just learning something I'm bound to practice in a bad way?\n\n  \nSorry for the stupid and badly formulated questions, english is not my first language and as much as I liked what I'm reading and i'ts already making me rethink things such as breathing, I'm confused by a few points (another being, how am I supposed to chose what asanas are good for whatever I feel today etc, all of it seems a bit overwhelming for my ADHD brain that hates choices and often gets stuck)",
    "score": 0,
    "url": "",
    "created_utc": 1744088342.0,
    "author": "AncientSlothGod",
    "permalink": "/r/yoga/comments/1ju5pub/questions_about_the_heart_of_yoga/"
  },
  {
    "title": "Online 300 hour",
    "body": "I'm thinking about buying a 300 hour ytt course.  Specifically my vinyasa practice.  I completed the 200 last year. I got a job teaching a chair yoga class once per week.  Any thoughts on an online 300 hour course?",
    "score": 1,
    "url": "",
    "created_utc": 1744051426.0,
    "author": "redzchairyoga",
    "permalink": "/r/yoga/comments/1jtstum/online_300_hour/"
  },
  {
    "title": "Resources for the learning the 26 bikram/hot yoga poses?",
    "body": "Years ago I took some hot yoga classes and till this day I still feel it was the most beneficial for my body. I tried searching on youtube for hot yoga videos and most of them are not shot well, weird angle, or the teacher doesn't teach what alternatives you could do if you are new to it. (I have not done this in a long time and am basically a complete beginner.) Are there any videos you guys could recommend me? I do not want to join a hot yoga studio, I tried that and there was some weird competition thing going on and it is so expensive I am interested only in learning the poses correctly at this point. Thanks.",
    "score": 0,
    "url": "",
    "created_utc": 1744516273.0,
    "author": "Street_Success5389",
    "permalink": "/r/yoga/comments/1jxyzei/resources_for_the_learning_the_26_bikramhot_yoga/"
  },
  {
    "title": "Need yoga poses to do that’ll help my back/neck/shoulder reset properly please read….",
    "body": "I just got a giant cyst cut out of my shoulder blade and it appeared not big but it was a huge mass behind it. Now that it’s out I am still having a bit of neck clicking and pain as well as lower back compression it feels like and my shoulder is definitely out of sorts from whatever the mass was. I don’t want to overdo it but I am also hyper mobile so I need to extra stretch to get benefits so please let me know which ones would be good for resetting everything in those places now that it’s not got the mass in the way. Thank youuu 😍🙏",
    "score": 0,
    "url": "",
    "created_utc": 1744179798.0,
    "author": "yur_toxicgf",
    "permalink": "/r/yoga/comments/1juz6a3/need_yoga_poses_to_do_thatll_help_my/"
  },
  {
    "title": "Is this a mudra?",
    "body": "Have to admit I don't know much about yoga. I have been practicing non-duality for several months involving meditaion and stying in the presence of the Witness or Awareness during the day, trying to live in the moment and not judging my sensory perceptions. Lately I have notices that my the boundaries of my \"body\" are softening as I stay in Awareness more and more. I am starting to feel tingling, aware energy pulsating all over my body.  It is like mini feelings of awareness, being and even euphoria traveling all around my body, in addition to feeling the Awareness behind me encompassing everything. Also I feel the \"need\" or \"urge\" to bring my arms over my head as if I am holding a beach ball on my head. When I do this, it gives me a sense of release or satisfaction that I can't really describe in words.  I did a google search and wound up here. Does anyone know what this is about and could you explain to me. Nothing feels bad or fearful about it. Just the opposite. But still I have curiosity. Thanks in advance!",
    "score": 0,
    "url": "",
    "created_utc": 1744307443.0,
    "author": "CompetitiveAd6364",
    "permalink": "/r/yoga/comments/1jw43of/is_this_a_mudra/"
  },
  {
    "title": "Please take a look at my routine",
    "body": "Hi dear yogis,\n\nThis is a 30 min daily routine I made with the help of chat gpt to get myself back to yoga. I have never really been physically active, but practised yoga twice for a year long in the last few years and liked it.\nI am 34 F, looking to build strength for pregnancy and healthy ageing. \nI enjoy balancing poses, stretches, hip openers.\nI hate getting out of breath and enjoy slow movements. I have twice quit because the workouts got too intense and I would get out of breath a lot.\n\nWhat would you say about this routine? Any other tips please? \n\n\nTime And Asana/Movement\n\n3 min\n\nCentering in Seated Position with Gentle Swaying\n\nFocus: Grounding and preparing mind/body. Breath: Slow, rhythmic breathing\n\n7 min\n\nFlow: Cat-Cow, Thread the Needle, Puppy Pose, Low Lunge (Anjaneyasana)\n\nFocus: Open the spine and hips gently.\nBreath: Inhale to expand, exhale to deepen each movement\n\n10 min\n\nStrength &amp; Balance: Glute Bridge (Setu Bandhasana), Tree Pose (Vrikshasana), Warrior II (Virabhadrasana II) with Side Angle Pose (Utthita Parsvakonasana), Bird-Dog Pose\n\nFocus: Core stability, pelvic strength, and balance\nBreath: Inhale to build strength, exhale while contracting muscles gently\n\n5 min\n\nHip &amp; Back Release: Reclined Figure-Four Stretch or Pigeon, Seated Spinal Twist, Forward Fold\n\nFocus: Releasing tension in hips and back\nBreath: Inhale to lengthen; exhale to deepen the twist or fold\n\n5 min\n\nCooling Down: Legs-Up-The-Wall (Viparita Karani), Reclined Butterfly, Gentle Breath Awareness\n\nFocus: Reset, calm the nervous system, and integrate the practice\nBreath: Steady, mindful breaths",
    "score": 0,
    "url": "",
    "created_utc": 1744315029.0,
    "author": "External_Bunch_3120",
    "permalink": "/r/yoga/comments/1jw75dz/please_take_a_look_at_my_routine/"
  },
  {
    "title": "why are Yogi's so obsessed with Goerg Ohm?",
    "body": "Yes his contributions were important to physics, but this really feels like a cult. ",
    "score": 0,
    "url": "",
    "created_utc": 1744032080.0,
    "author": "dayueforward",
    "permalink": "/r/yoga/comments/1jtl3k1/why_are_yogis_so_obsessed_with_goerg_ohm/"
  },
  {
    "title": "My neighbor complained to our HOA about my rooftop yoga practice",
    "body": "I've been practicing yoga on my rooftop terrace for the past few months as it has amazing sunrise views and helps me start my day peacefully. Yesterday, I received a formal notice from our HOA stating that someone complained about my \"inappropriate public displays\" and \"disturbance of community aesthetics.\" I was shocked since I practice at 6 AM when hardly anyone is awake, wear completely normal workout clothes, and make zero noise.\n\nWhen I asked for clarification, the HOA manager reluctantly admitted that my neighbor (who I've never even spoken to) submitted photos of me in various poses claiming they were \"inappropriate for children to potentially see\" and \"promoting Eastern religious practices in a family community.\" I'm literally just doing basic vinyasa flow!",
    "score": 16260,
    "url": "",
    "created_utc": 1743114663.0,
    "author": "clammyanton",
    "permalink": "/r/yoga/comments/1jlfs1o/my_neighbor_complained_to_our_hoa_about_my/"
  },
  {
    "title": "[COMP] my new party trick! (I did the other side as well)",
    "body": "",
    "score": 2291,
    "url": "",
    "created_utc": 1743607450.0,
    "author": "Mediocre_Cut9682",
    "permalink": "/r/yoga/comments/1jprb7b/comp_my_new_party_trick_i_did_the_other_side_as/"
  },
  {
    "title": "[COMP] Three-legged downdog to side plank",
    "body": "",
    "score": 1994,
    "url": "",
    "created_utc": 1742926694.0,
    "author": "bendyval",
    "permalink": "/r/yoga/comments/1jjq7cd/comp_threelegged_downdog_to_side_plank/"
  },
  {
    "title": "My counselor sent me links on why I should not do yoga",
    "body": "I mentioned to my counselor in our last session that I started yoga and was loving it for my mental health. I then received an email from her with links as to why Christians should not do yoga and how it invites evil spirits. I am a Christian, but that isn’t something that is a part of our counseling sessions. I felt like it was out of line to send me that, and not sure how I should respond if at all or let it go? It was really off putting. *update-she is a LMFT so a therapist.   My husband and I were doing couples therapy. I did express that this was out of bounds and I do not feel comfortable continuing.  She did apologize but I think missed the point.   She could have gone about this is a much better way. I had no idea I would click on a video link that said. “You’re opening demonic doors- warning against yoga.” It was shocking. * update- yes I terminated the relationship, she did apologize but I had to explain the inappropriate nature of her email and how that could be damaging.  ",
    "score": 1888,
    "url": "",
    "created_utc": 1742499509.0,
    "author": "Ok_Solution8537",
    "permalink": "/r/yoga/comments/1jfxiql/my_counselor_sent_me_links_on_why_i_should_not_do/"
  },
  {
    "title": "[COMP] Never thought I’d be able to get into grasshopper! 3 years of yoga and dedication, patience, courage, & curiosity.",
    "body": "I started my yoga journey in 2022, and I love how it feels to challenge my strength and fearlessness in arm balances. I know grasshopper isn’t a traditional pose, but I was so excited to try it whenever it was demo’d at an arm balance workshop I recently attended (the teacher actually worked it in towards the end since I asked to see it demo’d, which was so sweet and thoughtful of her to do.) I was shocked whenever I was able to do it too lol! ",
    "score": 1618,
    "url": "",
    "created_utc": 1743030872.0,
    "author": "cosmicmae",
    "permalink": "/r/yoga/comments/1jkpof4/comp_never_thought_id_be_able_to_get_into/"
  },
  {
    "title": "Finding myself again through yoga after my divorce",
    "body": "I'm a 36yo woman from Seattle. Last summer, my 10 year marriage ended suddenly when my husband told me he wanted out. I was completely lost my identity had been so wrapped up in being a wife and working at our joint business.\n\nI fell into a deep depression. I couldn't sleep, my anxiety was through the roof, and I started having panic attacks for the first time in my life. I was barely functioning for my two kids, just going through the motions.\n\nMy sister convinced me to try a beginner yoga class at her local studio. I resisted for weeks I was never athletic, and the thought of being in a room full of people in my fragile state terrified me. But eventually, I gave in just to make her stop asking.\n\nThat first class was humbling. I couldn't hold a downward dog for more than 5 seconds. My balance was nonexistent. I felt awkward and out of place. But the instructor, Sarah, was incredibly kind and helped me with modifications.\n\nWhat kept me coming back wasn't the physical aspect it was the 10 minutes of meditation at the end. For those 10 minutes, my racing thoughts would quiet just enough that I could breathe again.\n\nI started going twice a week, then three times. I bought a cheap mat and started practicing simple poses at home between dropping the kids at school and work.\n\nSix months later, I can now flow through a full vinyasa class. I've discovered muscles I never knew I had. But more importantly, my mind has transformed. The breathing techniques have helped me manage anxiety attacks. The meditation practice has helped me sit with difficult emotions instead of running from them.\n\nI've made friends at the studio something I never expected. We get coffee after Saturday morning classes sometimes. It's the first social circle I've had that's completely my own, not connected to my ex.\n\nYoga didn't fix everything I still have hard days, I'm still rebuilding my life. But it gave me tools to weather the storm and a community that holds space for me exactly as I am.\n\nFor anyone going through a major life transition who's on the fence about trying yoga please give it a chance. You don't need to be flexible or strong or peaceful. You just need to show up and breathe.",
    "score": 1229,
    "url": "",
    "created_utc": 1743895890.0,
    "author": "eirlous",
    "permalink": "/r/yoga/comments/1jsgq8i/finding_myself_again_through_yoga_after_my_divorce/"
  },
  {
    "title": "Finally tried hot yoga and I'm converted",
    "body": "My physical therapist has been suggesting yoga for my back pain for years, but I always brushed it off as \"not for me.\" After a particularly bad flare up last month, I finally caved and tried a hot yoga class.\n\nI was terrified walking in overweight guy with zero flexibility surrounded by what I assumed would be perfect yogis. But the instructor was incredibly welcoming and kept emphasizing \"your practice is yours alone.\"\n\nThree sessions in and I'm already feeling improvements in my lower back. I'm sleeping better and feeling less anxious throughout the day.\n\nThe heat was intimidating at first (I sweat more than I thought humanly possible), but it really helps my tight muscles loosen up. The mindfulness aspect has been unexpectedly powerful I've spent so long disconnected from my body.\n\nJust wanted to share with people who understand. I've gone from skeptic to advocate in just a week!\n\nThink I might try a regular vinyasa class next week to compare the difference.",
    "score": 1001,
    "url": "",
    "created_utc": 1743552991.0,
    "author": "Tlest7",
    "permalink": "/r/yoga/comments/1jpb7w5/finally_tried_hot_yoga_and_im_converted/"
  },
  {
    "title": "My relationship with yoga",
    "body": "I’m gonna have to do this forever!",
    "score": 929,
    "url": "",
    "created_utc": 1742313592.0,
    "author": "WannaBe_achBum_Goals",
    "permalink": "/r/yoga/comments/1je8dei/my_relationship_with_yoga/"
  },
  {
    "title": "[COMP] considering I couldn’t kick up to a forearm stand a month ago, this is a win 🥳",
    "body": "",
    "score": 796,
    "url": "",
    "created_utc": 1743528517.0,
    "author": "Mediocre_Cut9682",
    "permalink": "/r/yoga/comments/1jp1ewu/comp_considering_i_couldnt_kick_up_to_a_forearm/"
  },
  {
    "title": "[COMP] Uttanasana with blocks",
    "body": "",
    "score": 546,
    "url": "",
    "created_utc": 1743802904.0,
    "author": "bendyval",
    "permalink": "/r/yoga/comments/1jrnipw/comp_uttanasana_with_blocks/"
  },
  {
    "title": "Western Yoga Music and My Experience as an Indian Practitioner",
    "body": "For context: I've been practicing yoga since I was a child in Delhi. My grandmother was a yoga teacher who taught in our community for over 40 years, and I grew up attending her classes. I've been living in Canada for the past 6 years and have joined several yoga studios here. I understand that yoga evolves as it crosses cultural boundaries, and I don't expect Western yoga to mirror my experiences in India.\n\nHowever, there's one aspect of Western yoga that consistently feels jarring to me: the music. In most studios I've attended here, classes are accompanied by what's marketed as \"spiritual Indian music\" - often a strange mix of sitar samples, generic \"Om\" chanting, and ambient beats. This music bears little resemblance to anything I've ever heard in yoga spaces in India.\n\nGrowing up, our yoga sessions were typically practiced in silence or with simple rhythmic counting of breaths. When there was music, it was usually traditional bhajans (devotional songs) that had specific cultural and spiritual significance, not background ambience. The music played in Western studios often feels like it was created to match a Western imagination of what \"exotic Indian spirituality\" should sound like.\n\nI've tried explaining this to a few instructors, and while some were receptive, others defended the music as helping Western students \"connect to yoga's roots.\" But it feels more like these playlists are reinforcing stereotypes rather than creating authentic connections to yoga's cultural origins.\n\nWhat frustrates me most is seeing how this type of music has become so normalized that many practitioners now associate these sounds with \"authentic yoga.\" Meanwhile, when I mention that this isn't representative of yoga in India, I'm sometimes met with skepticism, as if my lived experience is less valid than their preconceived notions.\n\nI don't want to gatekeep yoga or suggest there's only one \"right way\" to practice. I appreciate how yoga has evolved and become accessible to people worldwide. But I wish there was more genuine curiosity about actual Indian cultural elements rather than relying on Western interpretations of what Indian spirituality sounds like.\n\nI know other Indians may have different experiences with this, but I wanted to share my perspective. Has anyone else noticed this disconnect with yoga music?",
    "score": 523,
    "url": "",
    "created_utc": 1743806618.0,
    "author": "Jasona1121",
    "permalink": "/r/yoga/comments/1jrovxx/western_yoga_music_and_my_experience_as_an_indian/"
  },
  {
    "title": "[COMP] handstand of the day",
    "body": "I think I’m getting better at it :) or maybe it was the music, what an epic banger this one is. happy weekend ",
    "score": 474,
    "url": "",
    "created_utc": 1742649080.0,
    "author": "Prestigious-Olive130",
    "permalink": "/r/yoga/comments/1jh848y/comp_handstand_of_the_day/"
  },
  {
    "title": "[COMP] Pigeon binds",
    "body": "",
    "score": 478,
    "url": "",
    "created_utc": 1742077929.0,
    "author": "bendyval",
    "permalink": "/r/yoga/comments/1jc6xhn/comp_pigeon_binds/"
  },
  {
    "title": "Manduka pro lite at TJ Maxx",
    "body": "I’m relatively new to yoga and have been using a mat from five below. I’ve been looking to upgrade ‘cause my $5 mat is now ripped up from gripping it. I saw that some of you have found the Manduka mats at Tj Maxx and Marshall’s and, luckily enough, found my new matcha pro lite on sale for $48 (normally $59.99) at Tj Maxx—I also had a $25 gift card so I feel like I’ve made out like a bandit 😂 I ran out of the store so quick omg🏃🏻‍♀️💨 if anyone lives in Brooklyn and is on the hunt for a mat, lmk and I’ll tell you in dms which Tj Maxx I got it at (there was only one other on sale, though two others regular priced). So happy!",
    "score": 370,
    "url": "",
    "created_utc": 1742517181.0,
    "author": "YourDadsFatAss",
    "permalink": "/r/yoga/comments/1jg4b52/manduka_pro_lite_at_tj_maxx/"
  },
  {
    "title": "I think my yoga teacher is grooming me, and need help drafting a text to set a boundary with her.",
    "body": "Sorry if this isn't allowed here, but I'm new to a consistent yoga practice at a studio and I've been experiencing some unsettling things from the studio owner.\n\nI can get into more specifics if requested, but I have felt uncomfortable many times because of her. When I met her, I told her I was in a bad space, so I thought she was just trying to be nice. But it's been about a month and she has increased non-corrective touching. She spontaneously ended one class early so the class could learn massage techniques, partnering everyone else up with each other so I was the odd ball out and she'd massage me, which she moaned during. She talks about sex during classes and one on one with me. She invited me to a private event by standing in front of a door, so I felt pressured to say yes before I could leave. She found out that I play piano and has been asking me every week to come in while no one else is there and play music with her. And then yesterday she privately texted me (when I never gave her my number and it wasn't a studio promo text). She again brought up the music thing, but this time with kissy faces and more innuendos. I have been pulling back on interacting at all and give her very little during our conversations.\n\nHonestly, this has made me so uncomfortable that under normal circumstances, I would just stop going. The problem is she also locked me in to a 3 month contract even though I scoured the documents upon signing because I wanted to pay month to month.\n\nSo I still have two months left. I really enjoy the studio otherwise, and there's no other studio around that does hot yoga, which I've grown to look forward to. It's somewhat possible for me to avoid her classes, but I think she will catch onto it. Plus, since she's the owner, she's at the studio a lot while the other classes are going on.\n\nSince she directly texted me when I didn't give her my number, I was thinking maybe I should use this opportunity to be direct over text. How can I address this in a way that doesn't make things awkward at the studio, but still be direct that I do not want to attend these private events or be touched by her anymore? Specifically, how can I say I don't want to play music with her? I'm not interested in it at all but it's become something that I feel expected to do.\n\nThanks for your help. It's a weird situation.\n\nEDIT: I really don't want to debate about what the term groomed means. I apologize to anyone who feels harmed by that word choice, but it was provided to me by my therapist and is reminiscent of other situations I have seen and been in.",
    "score": 350,
    "url": "",
    "created_utc": 1742062142.0,
    "author": "angrylemon8",
    "permalink": "/r/yoga/comments/1jc18gv/i_think_my_yoga_teacher_is_grooming_me_and_need/"
  },
  {
    "title": "[Comp] I think happiness is what lake-effect in the Midwest means",
    "body": "Don't know how to get rid of this weird line but I'm also technology incompetent and don't really care.",
    "score": 311,
    "url": "",
    "created_utc": 1742914332.0,
    "author": "Oceansunshine789",
    "permalink": "/r/yoga/comments/1jjl7a9/comp_i_think_happiness_is_what_lakeeffect_in_the/"
  },
  {
    "title": "Clarifying the Difference between Yin and Restorative",
    "body": "Saw something about this on another post and I answered it but I get a lot of questions from students and teachers that I mentor about this topic and want to provide some insight. \nSince this is the number one question I get asked about Yin, particularly in my YTT's, it makes me think Yin is being taught incorrectly in the studios and I feel its important to clarify:\n\nYin is not about relaxing the muscles—it’s about safely stressing the fascia and connective tissue. \nTotally different intention so totally different effect on the body.\n\nHere’s the science: your fascia (connective tissue) is like a 3D matrix that wraps around and within your muscles. It doesn’t respond to quick, muscular movement (like in Vinyasa or Hatha). It responds to long-held, passive stretches, usually in stillness and with the muscles relaxed. This puts gentle stress on the joints and fascia, which over time increases joint mobility, enhances hydration and glide between tissues, and helps prevent injury. We're talking 3–6 minute holds (sometimes more like 8min), per side, per pose, often with deep &amp; significant sensation—but never sharp or painful.\n\nI always say yin is a passive-aggressive practice. Passive because it’s all done on the floor but aggressive because of the long holds and the lack of props to support you. We’re just using gravity &amp; time to stretch us and that can be a bit much for that long. No sharpness, no pain, but definitely intense and definitely challenging. That’s how you know you’re getting into the fascia. \n\nIn contrast, Hatha, Vinyasa, and most other styles are all about muscular engagement. They build strength, coordination, stamina, and flow. They’re cardio and build endurance. Even gentle classes &amp; “slow” Hatha or vinyasa focuses on muscle engagement, alignment, and breath—not connective tissue. The muscles actually \"warm up\" really quickly, like, 15 seconds. But connective tissue takes several minutes. \n\nAnd then we have Restorative yoga, which is specifically designed to down-regulate the nervous system. That’s why we use props, and lots of them—to eliminate effort, not just reduce it. When your body feels completely supported, your brain gets the signal that it’s safe to relax deeply. There’s no stretch, no stress on the tissues, no intensity &amp; absolutely no challenge—just pure rest &amp; restoration. It’s a deep reset for your parasympathetic nervous system. That’s a extremely powerful practice too—but it’s not Yin.\n\nSo when people say Yin is easy, or offer classes called Yin to Restore or something along those lines they’re either:\n\n•Taking a Yin class that’s really just Restorative in disguise, \nOr \n•Not staying long enough to reach the depth Yin offers (mentally and physically), \nOr \n•Not relaxing the muscles fully, which makes it feel less intense but also less effective.\n\nAnd let’s be real—holding a deep stretch for 4+ minutes in stillness while your brain chatters and your body twitches to escape? That’s not easy. It’s subtle and intense. But it’s medicine for our over-stimulated, muscle-dominant modern bodies.\n\nIt’s so awesome to be curious and to notice how each class feels—that’s the sign of a thoughtful practitioner. \n\nWe need to keep exploring, ask questions, and know that each style has a different purpose and intent. \n\nJust like we train muscles with Vinyasa and Hatha, we tend the deep web of fascia with Yin—and we restore the nervous system in Restorative. \n\nAll beautiful, all valid—just all different intentions.\n\nKeep practicing and all will come 🧘🏻‍♀️",
    "score": 270,
    "url": "",
    "created_utc": 1743882314.0,
    "author": "Queasy_Equipment4569",
    "permalink": "/r/yoga/comments/1jsbucn/clarifying_the_difference_between_yin_and/"
  },
  {
    "title": "[COMP] Side Crow; Eagle Leg Variation",
    "body": "Working on arm balances in my practice a lot lately. This is side crow with eagle legs; it helps if you don’t do the full eagle legs (just simple thigh cross) until you’re flying. ",
    "score": 273,
    "url": "",
    "created_utc": 1743606425.0,
    "author": "makeshapesnotwar",
    "permalink": "/r/yoga/comments/1jpqwhf/comp_side_crow_eagle_leg_variation/"
  },
  {
    "title": "[COMP] jump to tucked and wide straddle handstand",
    "body": "Started my yoga practice at 48. I’m 54 now\n",
    "score": 271,
    "url": "",
    "created_utc": 1742362351.0,
    "author": "WannaBe_achBum_Goals",
    "permalink": "/r/yoga/comments/1jepzgk/comp_jump_to_tucked_and_wide_straddle_handstand/"
  },
  {
    "title": "Puppy Yoga gives me the ick and I’m not sure why yet.",
    "body": "Hoping to spark conversation so there can be more understanding on this. \n\nI know that puppy yoga is taking off and I love dogs but I just don’t feel right about it…something is just off. Maybe not with all puppy yoga places but I’ve been getting ads from this one: @puppy_yogaclub on Instagram, puppy-yogaclub.com \n\nOn their website it’s not specific enough for me to trust them fully. They just say they get puppies from local breeders and rescues but I’d rather have more information up front on who they’re working with. Is anyone else bothered by the lack of transparency? \n\nAlso, it’s just stretching + puppy play time. Its very cute and seems very fun I don’t doubt that, and I love yoga, I’m a second generation Indian American learning the practice &amp; it’s helping me become more grounded and connected to my heritage. And I also understand modern comforts and how we can integrate traditional yoga practices and teachings into our day-to-day life. \n\nbut there’s something very human consumptiony about all this that feels off. What do you think? \n\n",
    "score": 267,
    "url": "",
    "created_utc": 1742152152.0,
    "author": "WildVermicelli8877",
    "permalink": "/r/yoga/comments/1jct25q/puppy_yoga_gives_me_the_ick_and_im_not_sure_why/"
  },
  {
    "title": "[COMP] Morning balance upside down",
    "body": "Happy Thursday ☺️",
    "score": 227,
    "url": "",
    "created_utc": 1743677620.0,
    "author": "Prestigious-Olive130",
    "permalink": "/r/yoga/comments/1jqfarn/comp_morning_balance_upside_down/"
  },
  {
    "title": "How do you comfortably do this pose?",
    "body": "I can do the prayer squat pose with my knees more outward but I want to be able to do this pose without falling backwards. Any positions that can help accomplish this? ",
    "score": 229,
    "url": "",
    "created_utc": 1743098992.0,
    "author": "Junior_Chocolate_803",
    "permalink": "/r/yoga/comments/1jlagtc/how_do_you_comfortably_do_this_pose/"
  },
  {
    "title": "At what point do I just leave class?",
    "body": "**Edit: Thank you all so much for your affirmations and thoughts! I slept on it and decided to go to my ashtanga class this morning and it was so revitalizing and healing. I really am glad I made this post because I think I would have been stuck on it for far longer. I appreciate each of you so much.**\n\n\n\n\n\n\nI had literally the worst class in my life. It was an open vinyasa class that I've taken with a bunch of other instructors at this same studio before. It's marketed as pretty beginner friendly with some teachers beginning the class by asking if anyone is new to yoga, but to be fair I have gotten some pretty intense flows. \n\nI could tell that the instructor's style was not something I could necessarily vibe with when he started the class, but I figured that at worst I knew I was going to walk away annoyed and with a good story to laugh about later. I use yoga to be a bit more meditative and I'm not used to teachers being really social and having banter so I knew that this instructor probably wasn't for me in the long run. But even before that point though he seemed irritated where I placed my mat and really passive aggressive about how he wanted me to fix it and I think the way I handled it made him think I was purposely trying to vex him?\n\nAbout ten minutes in he had an issue with my feet placement, and I'm not sure what happened to cause the communication breakdown was but it legit felt like he was directly yelling at me. I knew at that point I was really over it, but I felt like if I just laid super low and tried to do everything he instructed I could get through but it just felt like everything was compounding so fast. The flows were faster than I was used to and he seemed very rigid in what was the right or wrong way. When someone (mostly me) got something wrong he would just repeat the same thing over and over.\n\nIt was frustrating for me and him, and I was recognizing that I was having a trigger of feeling trapped. I'm currently working through some stuff with my therapist, but I honestly was super blindsided by everything and I started crying. It was so awkward because the more I tried to stay on top of myself, the more silent tears kept streaming down my face. At a point I totally forgot that you could retreat to child's pose so I just sort of retreated to forward fold whenever I got confused because there was a lot of warrior/triangle poses that I just couldn't seem to get on the same wavelength that he wanted me to. Like even when it got to savasana everyone was laying towards the back of the class while I had laid towards the front and I didn't realize until he announced it. \n\nAll I kept thinking throughout was that I didn't want to disrupt the class, but I honestly couldn't tell if what would be more distracting - me just bouncing entirely and leaving my mat, blanket and blocks there until the class was done or me just awkwardly going through everything with silent tears and snot running down my face. I was so self-aware that all of this started because I put my mat at the front of the class. So I guess this post is half me processing what tf just happened to me, and the other is just asking like... wtf do you do in this moment?",
    "score": 228,
    "url": "",
    "created_utc": 1743224880.0,
    "author": "Head-Steak-1042",
    "permalink": "/r/yoga/comments/1jmf2uc/at_what_point_do_i_just_leave_class/"
  },
  {
    "title": "Happy baby",
    "body": "Am I the only person who spends every single moment of  happy baby pose trying to hold in a massive fart? Every time the teacher says we're going to do it I am petrified that a giant trumpet from me will echo around the studio 😕",
    "score": 227,
    "url": "",
    "created_utc": 1743028059.0,
    "author": "The_Hairy_Scrote",
    "permalink": "/r/yoga/comments/1jkoluu/happy_baby/"
  },
  {
    "title": "I just tried kundalini for the first time",
    "body": "I had absolutely zero knowledge of this style going in, I thought I was just dropping in for another class at my studio. I now realize that was an insane thing to do lmfao. I literally felt like I was going to scream and sob and then I found such a profound release. Honest to god I felt things that scared me, and I left feeling as though I was releasing pain I didn’t know I had. Can someone please tell me wtf just happened to me …",
    "score": 198,
    "url": "",
    "created_utc": 1742409082.0,
    "author": "M0nst3rtruck3r",
    "permalink": "/r/yoga/comments/1jf421r/i_just_tried_kundalini_for_the_first_time/"
  },
  {
    "title": "Yoga Etiquette Question",
    "body": "71 m who has practiced at home for some time but after missing the community of group classes, joined an independent studio.  Met w/ the studio manager who recommended chair yoga but reluctantly agreed w/ my suggestion for an assessment if I signed a waiver and paid her a $100 fee by Venmo to her personal account, she periodically glanced at me while scrolling through her phone for 15 minutes while I went through parts of my self-directed routine.\n\nShe approved me for a general membership and told me it was a 1 year minimum commitment w/ the 1st and last month in advance and that the studio required an approved mat, a towel, a strap, along with a book written by the studio owner, all of which I bought .\n\nAt the end of my first class, the teacher, young enough to be my granddaughter, told me to stay behind. She told e that she was the most experienced and popular teacher and that she spent a lot of time “curating a dynamic and compatible class experience.” She was not happy about me joining her class but agreed as a favor to the studio owner.  If I wanted to continue, I had to ditch the “hippy vibe” wear tights instead of drawstring pants and put my hair in a top-knot instead of a pony-tail.  She texted me her boyfriend’s phone number and told me to tell him that I was one of her students and go see him for a tat or a piercing.\n\nTo be honest, I am a bit overwhelmed by all of this.  Between the assessment fee, enrollment fee, 1st month, last month and yoga gear, I dropped close to $1,000.  Am I entitled to feel taken advantage of?  Is this normal?  I recognize that yoga is evolving, but a lot has changed since the last time I was active in an independent studio, where we dressed in loose cotton clothes, mostly met in a park or a church basement, had a weekly community class followed by a free dinner, and kirtan.\n\nPlease help me understand!  Thank you all so very much!!!",
    "score": 196,
    "url": "",
    "created_utc": 1743367627.0,
    "author": "Warrior-Yogi",
    "permalink": "/r/yoga/comments/1jnm7bv/yoga_etiquette_question/"
  },
  {
    "title": "How many of you guys here have read the Yoga Sutras of Patanjali?",
    "body": "Now I’m not here to talk down on or discourage anyone from whatever practices they are taking on that dub themselves with the name yoga.\n\nI just wanna know how many people actually know what yoga means and its origins.\n\nBecause while glancing this sub I’ve noticed that the psychological aspects of yoga have been completely overshadowed different poses and breathing techniques.\n\nNow I say all of this because again looking through this sub it seems that the definition of yoga given in the first line of the yoga sutras (the original treaties on yoga by patanjali) doesn’t apply to the majority of what’s being done here.\n\n“योगश्चित्तवृत्तिनिरोधः तदा द्रष्टुः स्वरूपेऽवस्थानम्” - which roughly translates to “Yoga is the cessation of movements within the mind, at which point the seer abides within his own nature”\n\nI guess I just wanted to spread the message that yoga in its truest form can be practiced while staring at a wall, while taking a walk, or even at your job.\n\nI’m not here to tell anyone that you shouldn’t be doing what it is that you do if you feel it brings you benifits I just wanted to spread a little info on the origins of yoga as I see a beautiful and rich philosophical tradition being overshadowed by a popular western workout regimen.\n",
    "score": 190,
    "url": "",
    "created_utc": 1743207748.0,
    "author": "FriendofMolly",
    "permalink": "/r/yoga/comments/1jm9xbq/how_many_of_you_guys_here_have_read_the_yoga/"
  },
  {
    "title": "I just started doing yoga today for 30 minutes and honestly I'll be doing it again",
    "body": "I will incorporate it to my life every morning from now on. I can't explain how relaxing it was. 🫶 I am shy and doing it at home will be the best thing! Although there are some grp class that I want to try but maybe in the future! 🩷",
    "score": 185,
    "url": "",
    "created_utc": 1742829276.0,
    "author": "Temporary-Run-7962",
    "permalink": "/r/yoga/comments/1jit24m/i_just_started_doing_yoga_today_for_30_minutes/"
  },
  {
    "title": "Anyone know what the name of this stretch is?",
    "body": "My insurance doesn’t cover PT and this is the only stretch that brings me relief for my lower back/hip/possibly psoas? Trying to see what muscle it targets so I can do some at home PT! Thank you!! ",
    "score": 181,
    "url": "",
    "created_utc": 1742193196.0,
    "author": "gkelley232",
    "permalink": "/r/yoga/comments/1jd6dth/anyone_know_what_the_name_of_this_stretch_is/"
  },
  {
    "title": "Can't quite understand downward dog",
    "body": "Newbie here.\n\nIt seems downward dog is the most popular rest pose, but I can't seem to get how it's supposed to feel. It's one of my least favorite poses, and either my sinuses get wacky, my wrists hurt, if I go back on legs, it's not comfortable, or I get lightheaded. Like, I just don't get where or what I'm supposed to feel...but it's certainly not comfortable. \n\nMeanwhile, I love, love, love happy baby and child's pose. Instead of downward dog, I tend to rest in child's pose. ",
    "score": 180,
    "url": "",
    "created_utc": 1742163185.0,
    "author": "sachnique",
    "permalink": "/r/yoga/comments/1jcx8gj/cant_quite_understand_downward_dog/"
  },
  {
    "title": "What's with the expensive mats?",
    "body": "So I really don't mean to put anyone in the spot, I just really don't get it. Why do so many people buy overpriced Yoga mats? And then spend two years breaking them in? Treating the surface with salt, magic erasers and whatnot? Why would anyone compromise their practice, potentially risking injuries from the slippery surface for being at some point able to actually really practice on a specific mat? I wonder the same about 120€ Yoga leggings from Lululemon and other commercialized aspects of our beautiful practice. I get it, some of those mats are durable, but most simple cork or rubber mats are just as durable and gripping and much cheaper, without the fancy brand name of course. The EU at least has super strict rules when it comes to toxic substances anyways, so I doubt it's that. Are there made more ethically? Do they have advantages I haven't unlocked in almost 20 years of practice? \n\n\nthanks for all the amazing feedback, so many of you say it DOES make a huge difference. I always found these expensive things a little off-putting and heard (and read on this sub) several salting horror stories but maybe I was wrong. Great to have such a supportive community. ",
    "score": 163,
    "url": "",
    "created_utc": 1743329179.0,
    "author": "[deleted]",
    "permalink": "/r/yoga/comments/1jn9aun/whats_with_the_expensive_mats/"
  },
  {
    "title": "Question about being a man in a yoga class",
    "body": "Hey yall, I’m a 20 year old man in college, and wanted to sign up for a beginners yoga class through my school. Is it weird for a guy in my age group to sign up for a yoga class alone? And if not is it expected that I should be in the front of the class (basically to not be behind any girls), or does that not matter as much? One of my friends that’s a girl said it doesn’t matter, while another said I should probably be in the front. \nAny advice would be appreciated.\n\nEdit: thanks yall for the advice, I signed up for the course and will just play it by ear. I’ll most likely go up front just for my own comfort and not wanting the off chance of making a girl uncomfortable, and to get extra advice from the instructor. Thanks yall and peace",
    "score": 156,
    "url": "",
    "created_utc": 1743452326.0,
    "author": "cowpieman11",
    "permalink": "/r/yoga/comments/1jod0mk/question_about_being_a_man_in_a_yoga_class/"
  },
  {
    "title": "What would this be called? COMP",
    "body": "Trying to get the legs higher and more straight up. ",
    "score": 150,
    "url": "",
    "created_utc": 1742617133.0,
    "author": "PsilocybVibe",
    "permalink": "/r/yoga/comments/1jh0boq/what_would_this_be_called_comp/"
  },
  {
    "title": "Is it normal to massage your boyfriend after class",
    "body": "Indian. Practiced yoga for over 15 years on and off. Joined hot yoga recently in a decent sized city in USA. After a class, one of practicing person at the class jumped on her boyfriend's back and started massaging him while shavasana was going on. \nAs Indian , who practiced yoga mostly in India found this very offensive because it's disrespectful to the class. But may be I'm being very reserved in my mindset. Help me understand if this is a regular behaviour and I'm just too sensitive!!",
    "score": 151,
    "url": "",
    "created_utc": 1743385990.0,
    "author": "Fun_Plastic4472",
    "permalink": "/r/yoga/comments/1jnsg79/is_it_normal_to_massage_your_boyfriend_after_class/"
  },
  {
    "title": "[COMP] After doing some straight line handstand drills",
    "body": "",
    "score": 123,
    "url": "",
    "created_utc": 1742846832.0,
    "author": "Toe_Regular",
    "permalink": "/r/yoga/comments/1jj0gda/comp_after_doing_some_straight_line_handstand/"
  },
  {
    "title": "What yoga pose has the biggest immediate impact on you ?",
    "body": "Hey fellow yogis! I’m curious—what yoga pose (asana), pranayama technique, or practice has had the most immediate impact on your body or mind? Whether it’s a physical release, mental clarity, or an energy boost, I’d love to hear what makes the biggest difference for you right away!",
    "score": 119,
    "url": "",
    "created_utc": 1742996366.0,
    "author": "Coco_Via_64",
    "permalink": "/r/yoga/comments/1jkc00z/what_yoga_pose_has_the_biggest_immediate_impact/"
  },
  {
    "title": "A \"thank you\" post :)",
    "body": "So, I had never really done yoga before. I thought it was something like meditation, that was for calming and relaxing, anti-anxiety stuff. I tried a couple exercises before and was very bored, even though I felt great afterward. \n\nLately, I've started to focus on my stress and anxiety, so I started considering yoga as an option for working on that. So, in February, I posted here asking for recommendations for at-home yoga with an online instructor. A few people suggested Yoga with Adriene, and so I checked out her channel. \n\nIt's been a month now and holy shit! I love yoga! I had no idea how much good it would do for my physical body, on top of the mental and emotional stuff! I do a lot of walking, so I'm not in terrible shape, but I feel all these other muscles showing up - my wrists are getting so strong, and I feel some new strength and shape in my forearms... I'm getting stomach muscles! And my thighs are getting some toning. I only do one video per day, and it's \\*most\\* days. I don't manage every day. And still the results are astounding!! \n\nIt's also helping with my breathing and general balance and connectivity. I fucking love yoga, I love Adriene's channel, and I just wanted to thank everyone here who helped guide me when I reached out to ask! :) ",
    "score": 114,
    "url": "",
    "created_utc": 1742298279.0,
    "author": "TSllama",
    "permalink": "/r/yoga/comments/1je309f/a_thank_you_post/"
  },
  {
    "title": "Weirdest, Funniest, Most Awkward Things you've experienced in yoga?",
    "body": "Been a while since I've seen a thread like this and it usually gives some good laughs and is a way to take yoga a little less seriously...I normally post about \"serious\" yoga stuff and need to laugh a bit.\n\nI've been practicing on and off for about 15 yrs and experienced some weird $hit 😆...only a few of these happened to me. The rest were observations / experiences of others.\n\n---\n\nNon-stop chanting from student through entire class when on one else was doing so (including teacher)\n\nPants split open in down dog, high lunge, hanumanasana\n\nPpl coming in on psychedelics, loosing their cool and having to run out midway through\n\nPpl coming in stoned and falling asleep on the floor for the entire class only to wake up in savasana and say \"oh shit, I fell asleep!!...sorry, I'm so stoned...\" 😆 (I live in a college town and attend a studio that is adjacent to campus...)\n\nSomeone telling me right after class that my \"chakras look *so* aligned now and how do I feel??\"\n\nForgetting to pee before class, but (early on in my yoga journey) being to afraid to disrupt so practicing with a full bladder for an entire class...would never recommend this. Just go pee...\n\nTerrible, awful music playing that makes you feel embarrassed to be participating \n\nWeird moaning / grunting from someone behind you and you can't quite locate it\n\nPpl doing handstands the entire class while everyone else is trying to follow the instructor\n\nSBD / egg farts from unsuspecting ppl that don't take accountability / somehow everyone ignores \n\n---\n\nThe worst / funniest, depending on your sense of humor, was probably the teacher falling off balance in warrior III demo and wiping out the altar, knocking over a bunch of lit candles and freaking out bc she thought something was going to catch on fire. I would not have wanted to be in her shoes and can understand tye concern, but as an observer it was really something 🙈😆\n",
    "score": 112,
    "url": "",
    "created_utc": 1741973838.0,
    "author": "RonSwanSong87",
    "permalink": "/r/yoga/comments/1jb9n5u/weirdest_funniest_most_awkward_things_youve/"
  },
  {
    "title": "My upside downs for the day. [COMP]",
    "body": "",
    "score": 109,
    "url": "",
    "created_utc": 1743912824.0,
    "author": "hoopyogii",
    "permalink": "/r/yoga/comments/1jslrnm/my_upside_downs_for_the_day_comp/"
  },
  {
    "title": "I think I had a trauma response in class, could use some perspective on what happened to me",
    "body": "So this morning I went into my yoga class..and long story short I think I had a trauma breakdown…all week I’ve been reluctant to go to class (even though last week was fine in yoga class)…I finally “made” myself go to flow yoga this morning.\n\nI was not feeling great at the start of the class but I was flowing fine…eventually I noticed I had to stop following the class and take moments to myself. At first I thought maybe it was due to tiredness or poor conditioning…but I noticed being able to get back into the flow without trouble…\n\nThat’s when I noticed having to stop the flow for longer periods of time. I knew something was unusual because my body didn’t want to “rest” in child’s pose…I needed to go into a yogi squat and curl up into a ball.\n\nI began shaking, rocking, sobbing, and counting…I had to stay like this for the remainder of class and had to stay past shivashana until everyone left\n\nWhat the hell happened to me??",
    "score": 107,
    "url": "",
    "created_utc": 1743141504.0,
    "author": "fidelitas88",
    "permalink": "/r/yoga/comments/1jlodlk/i_think_i_had_a_trauma_response_in_class_could/"
  },
  {
    "title": "[COMP] twisting, balancing, and a lot of coordination in this week’s flow",
    "body": "",
    "score": 107,
    "url": "",
    "created_utc": 1742659106.0,
    "author": "AcceptableObject",
    "permalink": "/r/yoga/comments/1jhbnrg/comp_twisting_balancing_and_a_lot_of_coordination/"
  },
  {
    "title": "Unpopular question - is there a way to filter out COMP posts?",
    "body": "I do not come here to *see* more yoga visually. There is already too much of that on every other internet platform. \n\nI click \"hide\" on every COMP post as I see it - bc I don't want to see it and hoping that Reddit will show me less of it....though that seems unlikely as I have my viewing options set to \"New\" posts bc otherwise the feed seems very random and hard to contextualize.\n\nDoes anyone know a way to not see these posts without manually hiding each one after it pops up?",
    "score": 101,
    "url": "",
    "created_utc": 1743610724.0,
    "author": "RonSwanSong87",
    "permalink": "/r/yoga/comments/1jpsnb0/unpopular_question_is_there_a_way_to_filter_out/"
  },
  {
    "title": "Can't resist getting upside down on a random object by a beautiful tree [COMP]",
    "body": "",
    "score": 96,
    "url": "",
    "created_utc": 1743040067.0,
    "author": "hoopyogii",
    "permalink": "/r/yoga/comments/1jksw12/cant_resist_getting_upside_down_on_a_random/"
  },
  {
    "title": "No more namaste?",
    "body": "I've been following several yoga YouTubers for years, including a couple very popular ones. I noticed many of them stop saying namaste at the end. I miss it. Is it just me or does anyone else notice the same? ",
    "score": 98,
    "url": "",
    "created_utc": 1743891289.0,
    "author": "crashrider2017",
    "permalink": "/r/yoga/comments/1jsf5kn/no_more_namaste/"
  },
  {
    "title": "People walking out mid-class",
    "body": "I’m an instructor, currently I mainly teach at a large gym so get a lot of people who’ve never done yoga, a variety of ages and fitness levels etc. I have a great group of regulars but every class will be someone new. My usual class is listed as vinyasa, which granted if you’ve never done yoga you might not know what that means but other classes on the time table are listed as slow flow, hot yoga etc. \n\nThis morning when I arrived one older lady came up to me to ask if this was slow flow and I said no, it’s vinyasa and explained it will be more of a dynamic class, but we usually take it easier being 8am on a Saturday morning. I told her if there’s anything she can’t do it’s fine and I’ll provide variations, just find what works for her. I guess what worked for her was to pack up and leave half way through. \n\nI noticed she was struggling with most poses, I would provide as many variations as I could and spent some time going up to her to assist. Often when I’d provide a more accessible variation she wouldn’t follow my instruction and therefore was unable to get any benefit from the poses. I felt terrible as an instructor and like I had failed, but I also had a full class of others who were keeping pace and taking the more advanced variations. \n\nI’ve had people walk out of my class before under similar circumstances, basically seeing it as too hard and therefore not even trying the variations. \n\nJust wondering how everyone feels about this? Of course if the person doesn’t want to be there then ok what can I do, but to not even try the variations? idk it made me feel bad, like I’m not doing my job well enough that I couldn’t provide something they could still benefit from and enjoy the full class. \n\nI’d like to be able to spend more time with her to find ways we can get the most out of the class for her, but it’s difficult to do that and run the class for everyone else at the same time. ",
    "score": 94,
    "url": "",
    "created_utc": 1743812097.0,
    "author": "eeeedaj",
    "permalink": "/r/yoga/comments/1jrqroo/people_walking_out_midclass/"
  },
  {
    "title": "Shavasana Experience",
    "body": "\nToday, I attended a flow class with a new instructor (new to me). She was very nice, and we did some poses I had never done before. I felt relaxed and wasn’t thinking about anything in particular.\n\nWhen we lay down for Shavasana, I relaxed, and after a while, I began having vivid memories of being with my father, who is deceased. They played like a movie behind my eyes—little snippets, all happy. I was very young when he passed, and I rarely think of him.\n\nThe instructor wasn’t particularly… I’m not sure what word to use. Spiritual/ grounding/ healing? Again, she was great. It was a wonderful class. She was very focused on positioning and alignment rather than breath, which was totally fine, so it wasn’t her. The music was different from what I’m used to, but nothing particularly noteworthy.\n\nI’m very confused. Has anyone else ever had this happen?\n\nEdit: Thank you so much for the comments! \nI’m so happy that others have experienced similar happy memories. It’s a comfort. I’m learning that this practice is an incredible gift in more ways than I could have ever imagined possible. \n\nPeace to you all. \n",
    "score": 93,
    "url": "",
    "created_utc": 1743116520.0,
    "author": "picklethrift",
    "permalink": "/r/yoga/comments/1jlgi3a/shavasana_experience/"
  },
  {
    "title": "[COMP] Quick yet honest practice",
    "body": "10min total, that’s all I got today. Felt amazing. Calming the mind and moving the body.  Happee weekend",
    "score": 88,
    "url": "",
    "created_utc": 1742054319.0,
    "author": "Prestigious-Olive130",
    "permalink": "/r/yoga/comments/1jby9c8/comp_quick_yet_honest_practice/"
  },
  {
    "title": "Eagle Pose Help",
    "body": "I absolutely cannot cross my arms like this in eagle pose. Has anyone else had issues like this? Is there something else I can do to help get into this position? \nI think it has to do with my tight ass shoulders, I've done a lot of work with them. But ive had no improvement with this pose. ",
    "score": 85,
    "url": "",
    "created_utc": 1742238530.0,
    "author": "Illyse",
    "permalink": "/r/yoga/comments/1jdkwqw/eagle_pose_help/"
  },
  {
    "title": "Waterworks",
    "body": "So I haven't done yoga in a long time (years) but today I decided to dust the old mat off because the beautiful morning sunlight filtering through the window made it seem like a brilliant way to wake up. And it was, I did a 30 minute session and it felt great, but to my surprise at one point during the practice tears started steadily streaming down my face. No sobbing or hitched breathing like I usually do when crying, more like turning on a literal tap after transitioning from a forward fold to mountain pose. I've heard about people crying especially during certain deep stretches/hip flexions, but this has never happened to me before and those particular movements used to be in every yoga class/video I tried.\n\nI weightlift weekly, go hiking, do deep stretches, but none of those have made me well up. I was in a good mood, not feeling particularly emotional or spiritual really, so it surprised me. Is there a scientific reason why my eyes are wetting themselves at the top of the mountain, or is it more diffuse? Have you ever cried during practice? \n\n",
    "score": 79,
    "url": "",
    "created_utc": 1742754794.0,
    "author": "EarlyWilter",
    "permalink": "/r/yoga/comments/1ji65jh/waterworks/"
  },
  {
    "title": "I’ve been wiping my mat with Lysol wipes",
    "body": "I’m a germaphobe and something that’s always made me nervous about my yoga practice is putting my face down on the same mat my feet are on. (Yes I clean off my feet before practicing, but still!) So to clean my mat after use I was using Lysol sanitizing wipes. It’s the kind that says safe to use on kitchen counters so I thought it was ok if a little residual got on me.\n\nI recently joined a studio and when my yoga teacher and classmates saw me wiping it with Lysol they freaked out. They said that’s so bad for the mat and can be dangerous for me. Is this true? \n\nThey said to use a speciality formulated yoga mat cleaning wipe or spray. But do those really kill germs?",
    "score": 70,
    "url": "",
    "created_utc": 1743399242.0,
    "author": "Princessleiawastaken",
    "permalink": "/r/yoga/comments/1jnw5ec/ive_been_wiping_my_mat_with_lysol_wipes/"
  },
  {
    "title": "Daily Affirmations. I don’t know how original this is, but it popped in my mind today.",
    "body": "I was meditating during my morning session and began working this together. My thought processes are in ( ). \n\nI am balanced. (Mind, body, soul)\nI am strong. (MBS)\nI am mindful ( of everything and everyone around me)\nI am calm. (In any situation)\n\nI made a graphic to put in my yoga den. Feel free to use it. ",
    "score": 68,
    "url": "",
    "created_utc": 1742487945.0,
    "author": "DARTHKINDNESS",
    "permalink": "/r/yoga/comments/1jfsv1k/daily_affirmations_i_dont_know_how_original_this/"
  },
  {
    "title": "[COMP] What is this pose?",
    "body": "Hi All!\nI’ve been working on getting my hips properly stacked in this pose which I’ve been taught is called flying compass. But when I look up that name it appears to be this but with the leg behind the supporting arm? Is this a variation of flying compass or a different pose? Let me know! ",
    "score": 72,
    "url": "",
    "created_utc": 1742701214.0,
    "author": "raindrop367",
    "permalink": "/r/yoga/comments/1jhqgih/comp_what_is_this_pose/"
  },
  {
    "title": "Going some very trying times but so grateful for yoga outside this morning.",
    "body": "My wife, myself and our family have such challenges going on right now. We truly are feeling the heaviest of weights right now. Right now, however, I am so grateful for my yoga practice. I am embracing all eight limbs and it’s holding me together thus far. \n\nThe weather is finally decent so this morning I went outside with my mat and my meditation cushions. I did a half hour of asanas with the morning sun forcing me to keep my eyes closed. Then pranayama and meditation. Service was brought in as well when a call interrupted my meditation. A family member, also suffering greatly, needed a quick favor. I did it with joy knowing there is great power in helping others despite our own troubles. \n\nI am nothing special. I’m sure all my asanas could use work. I’m getting older. I’m weigh a little more than I should. I try to fulfill my dharma every day with perfection but know I often fail to be the husband, father, friend and aspiring yogi I want to be. With all that being said, I am so grateful for my practice and all that it brings to my life. I am grateful for the morning sun on my face. ",
    "score": 68,
    "url": "",
    "created_utc": 1742392351.0,
    "author": "BodhisattvaJones",
    "permalink": "/r/yoga/comments/1jexgrf/going_some_very_trying_times_but_so_grateful_for/"
  },
  {
    "title": "Has anyone healed yoga butt",
    "body": "EDIT: thank you so much for all of the comments 🙏 I am going to keep going with my rehab and continue to make strengthening part of my weekly routine ☺️\n\nHello I’m not sure if this goes against rule 5 at all so apologies if it does and happy for the post to be removed out of respect for this sub ☺️\n\nDeveloped Proximal high hamstring tendonopathy  in Jan and started getting physio. I’ve been consistent with my exercises, bought an orthopaedic cushion to sit on and haven’t ran for 6 weeks but seeing minimal improvements.  \nim just doing my rehab strength, yoga and walking for exercise which for 6 weeks has been ok but it’s starting to really get me down - I miss running and I miss doing yoga freely. Im also 3 weeks into a clinical Pilates 6 week course run by physios to help strengthen the muscles around the tendon. \n\nim starting shockwave therapy with my PT in 2 weeks time so I’m hoping that improves things. im due to do my yoga teacher training inAugust so I’m feeling a bit anxious That it may not have improved by then.\n\n&gt;has anyone successfully healed this injury? 🙏\n\n  \n",
    "score": 66,
    "url": "",
    "created_utc": 1742678470.0,
    "author": "CreativeHippo9706",
    "permalink": "/r/yoga/comments/1jhj0fh/has_anyone_healed_yoga_butt/"
  },
  {
    "title": "[COMP] Been working on this flow for a little while now :)",
    "body": "",
    "score": 61,
    "url": "",
    "created_utc": 1743450496.0,
    "author": "BlueAndPurpleWall",
    "permalink": "/r/yoga/comments/1joc98u/comp_been_working_on_this_flow_for_a_little_while/"
  },
  {
    "title": "couples talking or general lack of situational awareness during class?",
    "body": "I’ve been practicing consistently for a year now, previously I did yoga for a few years as well. \n\nI find myself feeling a bit frustrated with certain couples who go to yoga together. They seem to not be aware of their surroundings in the way that others who come alone are. My studio is very clear about their no-talking rule in the rooms. But when couples see each other, it’s as if they forget everyone else exists and they’ll just start chatting while everyone around them is trying to come into the space or meditate after class. \n\nLast week, I ended up next to a couple who kept having side conversations during class, at one point they were holding hands and facing each other, fully in conversation. When I started missing cues because it was so distracting, I asked them to please stop talking. I felt awful about 1. talking during class and 2. having to advocate for a peaceful practice in a space that is supposed to be centered around consciousness and awareness. \n\nThere have been many situations like this, nothing quite as egregious but it’s frustrating to me when a couple acts more entitled to the space simply because there are 2 of them. \n\nI want yoga class to feel like a community, and I am supportive of people going to class together. I love bringing friends to class, but to me, no matter who I’m with, we all have a responsibility to everyone else in class to be respectful. \n\nMaybe I’m just venting, because I am not sure if anything can really be done. But if anyone has found a way to reframe this or approach the issue kindly, I’d love to know.",
    "score": 59,
    "url": "",
    "created_utc": 1743641215.0,
    "author": "No_Scheme_7613",
    "permalink": "/r/yoga/comments/1jq4v2m/couples_talking_or_general_lack_of_situational/"
  },
  {
    "title": "[COMP]Primal Sun Salutation with mod for injury",
    "body": "",
    "score": 60,
    "url": "",
    "created_utc": 1742737802.0,
    "author": "Aqualung1",
    "permalink": "/r/yoga/comments/1jhzotv/compprimal_sun_salutation_with_mod_for_injury/"
  },
  {
    "title": "distracting experience this morning",
    "body": "i am a regular at my yoga studio. there is another regular who i always thought was a bit out there. very nice woman, i’d say early 60’s. she comes to class and generally just stretches, i mostly see her in vinyasa classes. i have always been good with people listening to their bodies and doing what they need to. but this woman maybe does one or two poses that are in the sequence and spends the rest of class stretching on her mat. she is EXTREMELY flexible. \n\ntoday she set up next to me, cool no problem, do your thing lady. but in savasana, she as always- is stretching on her back. i swear this woman had back to back to back orgasms. full body twitching, covering her mouth with her hand, sighing loudly, put her hand in her hands while her body was jerking type orgasms. it’s my own fault for allowing it to distract me but it for sure did. \n\ni just want to know if anyone has had a similar experience. ",
    "score": 58,
    "url": "",
    "created_utc": 1743263052.0,
    "author": "Motor_Eye_6300",
    "permalink": "/r/yoga/comments/1jmp449/distracting_experience_this_morning/"
  },
  {
    "title": "Cut the slip… talk about your stickiest mat, the one that stays sticky despite buckets of sweat.",
    "body": "I sweat boat loads. Love a bmat, manduka, liforme, and lulu... but nothing seems to stand up to my sweat. Eventually, sometimes within a few minutes of vinyasa, I'm slipping and sliding. Please, share your experiences with super sweaty classes and the mats that allow your downward dog to be maximized with a blissful grippy push through the hands. Love my studio, but it's infrared heated and I sweat buckets, which makes all the \"sticky\" mats I've tried a literal hockey rink. \n\n",
    "score": 57,
    "url": "",
    "created_utc": 1742592698.0,
    "author": "mntlblndrsn",
    "permalink": "/r/yoga/comments/1jgs53b/cut_the_slip_talk_about_your_stickiest_mat_the/"
  },
  {
    "title": "Will yoga help me feel NOT Stiff",
    "body": "Ugh I’m at my wits end. I feel so stiff and twisted up!..  it’s ridiculous the way I walk around I’m SICK OF IT. \n\nHas anyone found yoga to help this? I’m working out, cleaning up my diet, lowering stress, meditating, visualizing and I FEEL STIFF ASF\n\ngive me some hope please. Anybody ",
    "score": 53,
    "url": "",
    "created_utc": 1743749116.0,
    "author": "MettaHologram",
    "permalink": "/r/yoga/comments/1jr5l5k/will_yoga_help_me_feel_not_stiff/"
  },
  {
    "title": "Vriksasana / Tree Pose",
    "body": "Is there a substantial difference between the foot placement in the first pic vs second pic? First pic is how I learned (foot face up as high as is comfortable) but second pic (foot flat to inner thigh) is how I see it online every time… just wondering ",
    "score": 57,
    "url": "",
    "created_utc": 1743574438.0,
    "author": "mintrisgi",
    "permalink": "/r/yoga/comments/1jphwm8/vriksasana_tree_pose/"
  },
  {
    "title": "Wow this is amazing!",
    "body": "I’ve just started and I love it. I’ve been struggling all my life to find a way to work out that I like and a couple days ago I found yoga and it’s so nice because I can do it inside in the comfort of my home without anyone around to judge if I fail. I can barley do 10 mins because I really feel I’m using muscles I had no idea was even there + my poor balance and it feels so good afterward. Just like nicotine honestly and no anxiety or feelings that I’m being judged. I really like that there are so many different types of yoga. For example even though I have quite limited space and no mat there’s still a lot of videos I can follow\nHonestly before I thought it was a dumb sport and nothing a ”man” should do but the fact that I can do it at home without parents lurking or friends giving negative input makes it feel very freeing.\n\n\n\n",
    "score": 54,
    "url": "",
    "created_utc": 1742428833.0,
    "author": "jamgill",
    "permalink": "/r/yoga/comments/1jfbrk0/wow_this_is_amazing/"
  },
  {
    "title": "When did you enjoy down dog",
    "body": "I’ve done yoga for years but have never really enjoyed down dog. What am I missing?  I’ve heard it takes time to find down dog restorative or relaxing. ",
    "score": 51,
    "url": "",
    "created_utc": 1743302090.0,
    "author": "dylan3883",
    "permalink": "/r/yoga/comments/1jn2u2i/when_did_you_enjoy_down_dog/"
  },
  {
    "title": "Playing my music for an in-person yoga class next week -- do you have any suggestions?",
    "body": "A studio nearby has asked me to play my original music for a 45-minute class. I've never attended a class with live music, so I'm wondering what to expect and if there's anything I need to know! Thank you :)",
    "score": 52,
    "url": "",
    "created_utc": 1743438028.0,
    "author": "Fine-Gear-6441",
    "permalink": "/r/yoga/comments/1jo75aw/playing_my_music_for_an_inperson_yoga_class_next/"
  },
  {
    "title": "What for you personally is the most emotional yoga pose?",
    "body": "For me, it’s gotta be child’s pose. Something about both the pull between my thighs and lengthening of the upper back, and just being in a low bow against the floor brings all my vulnerabilities to the surface. It feels like a deep surrender every time. ",
    "score": 51,
    "url": "",
    "created_utc": 1743532205.0,
    "author": "gratefuldaughter2",
    "permalink": "/r/yoga/comments/1jp2yxx/what_for_you_personally_is_the_most_emotional/"
  },
  {
    "title": "Liforme Yoga Mat…isn’t great",
    "body": "I’ve been practicing yoga for years. I finally bit the bullet and decided to spend $148 on a mat. Aesthetically…it’s gorgeous. I had seen a review that said the mat gathers so much dust and dirt that it’s really a distraction; I thought, “what a silly thing to complain about.” THEY WERE ABSOLUTELY CORRECT. It seriously takes away from how the mat performs. I have to stop and wipe away dust that somehow magnetizes to the mat. I brought it to a hot yoga class and the grip really was excellent; however, for normal daily practice it’s…well, it’s not worth the price tag. Unless there is a lot of heat and humidity in the air, your feet will slip. I have a $48 Ajna yoga mat I purchased on Amazon about ten years ago and I feel myself reaching for that more and more. I’m highly disappointed in myself for spending that much…I really thought it was high quality…it’s pretty, but it’s a slab of rubber for Christ sake. What was I thinking?\n\nFURTHERMORE….\n\nI searched for that “dust review” I read on their website and it’s since been deleted! \n\nLesson learned.",
    "score": 49,
    "url": "",
    "created_utc": 1742427366.0,
    "author": "Kitiara2324",
    "permalink": "/r/yoga/comments/1jfb8za/liforme_yoga_matisnt_great/"
  },
  {
    "title": "Do you like repetitive classes / sequences",
    "body": "As a student, do you prefer your teacher coming up with very unique classes (theme, focus areas, asana sequence, music) each time or do you like when their class is more predictable, with many overlaps of what’s being taught? Or maybe as a third option: rotating between a handful of „set“ classes?\n\n(Obviously this is not relevant for classes that already have only set sequences such as 26+2,  more for the hatha, vinyasa and yin folks)",
    "score": 47,
    "url": "",
    "created_utc": 1742150360.0,
    "author": "meinyoga",
    "permalink": "/r/yoga/comments/1jcscd3/do_you_like_repetitive_classes_sequences/"
  },
  {
    "title": "What type of Yoga do you do for strength?",
    "body": "There's so many different types of Yoga I've seen from Yoga where you just sit for a while to balancing in hard positions.\n\nI was wondering (as a newbie that has on and off tried different types of Yoga), what type of Yoga is best for developing strength?\n\nThanks!!!",
    "score": 47,
    "url": "",
    "created_utc": 1742733068.0,
    "author": "FantasyLover266",
    "permalink": "/r/yoga/comments/1jhy75a/what_type_of_yoga_do_you_do_for_strength/"
  },
  {
    "title": "All levels flow was advanced?",
    "body": "I just wanted to get opinions because I’m trying to get back into yoga. I signed up for an all levels flow vinyasana class and it was packed when I got there. The teacher was a mid thirties guy who gave a little bit of cult teacher vibes. He clearly has a lot of regulars. We spent about 3 seconds each pose with no warm ups or stretching in the beginning. As classes continued more and more advanced poses like standing on your head, doing back bends, holding uncomfortable poses for long periods. The only modifications he offered were how to push your body harder. This class should’ve been described differently for newcomers like me. I feel like I was in a car wreck. The kicker is I bought a 10 class pass and I’m a little apprehensive about going again. I’m going to make sure when I sign up it is not “all levels flow” (that’s the majority of classes) and he is not the teacher. Thank you for reading 😔\n\nEdited to add: I’m not physically unfit or fit. I bartend for a living so constantly on my feet/lifting/moving. I’m starting a new sobriety journey and I figure yoga would a nice addition to my routine. I understand the basics but the speed and the difficulty of poses threw me off and made it a negative experience. Thank you for the support and I’m going to try Yin Yoga on Sunday.",
    "score": 47,
    "url": "",
    "created_utc": 1743167330.0,
    "author": "kungfukitty91",
    "permalink": "/r/yoga/comments/1jluogw/all_levels_flow_was_advanced/"
  },
  {
    "title": "In-person, heated yoga",
    "body": "Appreciation post. I practice yoga weekly through Peloton at home and love it. However, I attended a local studio and practiced a heated yoga flow yesterday. It was incredible!!! While the flow was completely within my wheelhouse, the heat added a layer of difficulty and ease. I found it difficult to practice while hot, yet the heat warmed my muscles up fast, making the flow easier. I am surprisingly sore today. ",
    "score": 40,
    "url": "",
    "created_utc": 1742243888.0,
    "author": "Immediate_Fold_2079",
    "permalink": "/r/yoga/comments/1jdn4mn/inperson_heated_yoga/"
  },
  {
    "title": "Tips on maintaining a sustainable asana practice (especially if you do Ashtanga, vinyasa, power) in your 40s and beyond",
    "body": "I’d love to hear advice from older yogis about how you maintain a strong asana practice as you age. I’m F early 40s, I returned to a 6 day per week practice of a mix of Ashtanga and vinyasa about a year ago after a decade of patchy home practice. I feel great and physically I’m stronger and more flexible than ever. My practice includes lots of arm balances, inversions, splits, backbends plenty of chaturanga, jumping forward and back etc. At the same time I notice that minor aches (not necessarily yoga related) are more frequent and injury recovery time from strains etc is longer. I worry more about wear and tear from repetitive movements than I used to. As I’m heading towards peri-menopause I’m being bombarded with messaging about the importance of weight lifting and progressive overload. Currently I do yoga, some Pilates core exercises a couple of times a week, and I don’t have a car so I walk and cycle everywhere - but I don’t run or go to the gym (and I don't really want to start).\n\nYogis 40+, do you find you need to add with additional exercise forms or alternative yoga styles? Do you take supplements or protein or have you had to change your diet? Is just yoga enough if it’s an athletic type like Ashtanga, or do I really need to lift for bone strength?\n\nI’d also be interested in any books, podcasts or resources about these issues. It’s hard to get useful advice from my doctors as their understanding of “yoga” doesn’t really reflect my practice, and my yoga teachers are mostly very young.",
    "score": 43,
    "url": "",
    "created_utc": 1743933395.0,
    "author": "Competitive-Eagle657",
    "permalink": "/r/yoga/comments/1jsqong/tips_on_maintaining_a_sustainable_asana_practice/"
  },
  {
    "title": "Is it weird to take classes in other yoga studios if I own a yoga studio? Kinda",
    "body": "I own a community space where we do yoga twice a week. It’s not enough for me, however i don’t want to teach more classes or hire more teachers. I just want to go to a yoga studio and take classes everyday- specifically hot yoga which I don’t have in my space. I just feel kind of weird since people in the community know I have my space. I don’t want the owners to think I’m trying to steal students cus I’m not but also i don’t want to feel like I’m hiding my identity. I never seen any other yoga studio owner take classes elsewhere. ",
    "score": 43,
    "url": "",
    "created_utc": 1743726127.0,
    "author": "solarpunk24",
    "permalink": "/r/yoga/comments/1jqyqwh/is_it_weird_to_take_classes_in_other_yoga_studios/"
  },
  {
    "title": "Advice on negative student feedback",
    "body": "Hi all,\n\nI am looking for some advice (from anyone, but particularly other yoga teachers).\n\nI started teaching yoga over two years ago, so I am still quite “new”. I have been teaching 1-2 classes per week in those two years. These classes are usually quite small and I’ve received positive feedback mostly (of course, some constructive feedback as well). Overall, it has been a really positive community-like experience! \n\nI recently expanded my practice to teach at a “big box studio” which uses the MINDBODY app which does allow students to review every teacher and class. So far, most of my reviews have been very positive. However, I did get a few that were negative (which is ok, I’ll try and adapt to those and take their feedback into consideration). I noticed that some students wrote very negative and sometimes rude reviews for other teachers. eg: some reviews would say that teacher is inexperienced, disorganized, “skinny and not taking other peoples bodies into consideration” etc. \n\nAnd maybe this is typical. But it has been giving me so much anxiety. I am afraid that I will also receive rude reviews. I know there’s nothing I can do about this, but any tips/advice/experience from others on how you have dealt with this in the past? \n\nThank you ",
    "score": 40,
    "url": "",
    "created_utc": 1742037516.0,
    "author": "AdPuzzled6933",
    "permalink": "/r/yoga/comments/1jbswxa/advice_on_negative_student_feedback/"
  },
  {
    "title": "Sobbing during an assist",
    "body": "So I am a newly scheduled assist person at a hot yoga studio. On my first hands on whole class assisting day, I assisted a woman in child pose who started crying and convulsively sobbing after a moment. I don’t know if she was already crying or it was something I triggered. I didn’t know what to do, so I continued to breathe and give her a firm assist with the feeling like “I got you”. Any suggestions from other assistants or receivers.  I know I once was brought to tears from what I perceived was a super caring assist also in child pose, on a day I really needed a kind touch. I asked the assisting coaches and one said to continue on, the other said to drop a tissue (and move on and give space). What do you all think?\n\nEdit: lol my original feeling about assisting being fraught has been reinforced by this thread. Anyway…I did approach the assisting lead and yoga teacher about the woman’s crying as she noticed it also. As the class was ending, I did ask her if i should say something. She said, “leave her be”. I have a feeling many have a different view of what this yoga class was like and what a child’s pose assist is. This one is a hot power vinyasa class more like a work out class. The studio does offer yin, slow candlelight, and beginner classes with no assists. Either way. Thanks for the input, I  will keep everyone perspective in mind.",
    "score": 40,
    "url": "",
    "created_utc": 1743525327.0,
    "author": "WannaBe_achBum_Goals",
    "permalink": "/r/yoga/comments/1jp034i/sobbing_during_an_assist/"
  },
  {
    "title": "Weird class experience",
    "body": "I’ve been searching around for a 200 YTT for a bit (wanted to do one at my go-to studio, but gotd cancelled due to low attendance). One of my favorite instructors there mentioned that she’s doing a YTT this summer at another studio, though, with a different teacher unaffiliated to my home studio. \n\nI went to check out this other instructor’s class at the new studio. He was a bit arrogant, for starters. Just seemed like he enjoyed having an arrested audience, which I find off-putting. But the deal breaker to me was that I noticed he spent the entire class giving hands-on adjustments to *only* the two young 20-something year old women in the class. Everyone else was probably late 30s and up, and he never made an effort to go around and offer corrections to anyone else. But, he was actively putting his hands on these young womens’ hips, shifting their buttocks, rubbing their back, and holding his hands on them for long periods of time. At one point he gave a mini back massage to one of them. \n\nIt seemed that both women were regulars in his class. It seemed like the rest of the class were regulars, too. I kind of felt like I was in the twilight zone. \n\nI found it to be a major red flag. Needless to say, I won’t be signing up for the YTT knowing that he’s the other lead instructor for it. I’m not sure what to make of my favorite yoga instructor collaborating with him for the program. Do you all feel this is commonly come across in the yoga space? Am I overreacting? ",
    "score": 38,
    "url": "",
    "created_utc": 1743392791.0,
    "author": "believeme_413",
    "permalink": "/r/yoga/comments/1jnugov/weird_class_experience/"
  },
  {
    "title": "bruises on arms doing crow pose?",
    "body": "i always have these bruises after doing crow, it doesn’t really go away,my doctor said it’s ok..\nbut i don’t see anyone else in my class have bruises",
    "score": 38,
    "url": "",
    "created_utc": 1742099688.0,
    "author": "luluramsey",
    "permalink": "/r/yoga/comments/1jcdqo5/bruises_on_arms_doing_crow_pose/"
  },
  {
    "title": "Falling, failing, and finding yoga: my messy journey.",
    "body": "This is probably one of the more vulnerable things I’ve ever written. It’s wonderful to be in a place where I’m no longer ashamed of who I was as a young woman, or of the mistakes that I made along the way. Like any good story, I hope that this one demonstrates that, as humans, we are all:\n\n* Flawed\n* Worthy of love \n* Capable of more than we think\n* Deserving of forgiveness\n\nHere goes:\n\nSometimes I wonder what my life would have been like if I’d had a “me” when I was growing up. Someone to teach me yoga and lead me through self-care practices, or someone to softly tell me that my body and mind are perfect and worthy of respect, just the way that they are.\n\nFrom my late teens to early 20s I really struggled to manage my anxiety and depression. I drank and practiced self-harm to reduce anxiety, which (along with the bleak Minnesota winters) caused depression. When I was depressed, I would drink, which would then give way to more anxiety and depression. It was a vicious cycle, but I don’t blame myself. At that age, I didn’t really know any better.\n\nIn a single year I lost a close friend to suicide, had my heart broken for the first time, was fired, had a health scare, and was rejected by the university that I had dreamed of attending; a lot for any 17-year-old to handle. A few years later I fell down the stairs when I was drunk, fractured my jaw, and knocked a few of my teeth out. Combine all this with the fact that my mental health always seemed to be a shameful, “hush hush” topic amongst family and most of my friends… well, you get the picture. It was bleak, messy, and I had never felt more alone.\n\n# Possibility &amp; Hope\n\nIn 2011 I found a therapist in Minneapolis that I really trusted. Instead of prescribing me with more medication, like I requested, she taught me “anti-anxiety breath” (what I now know to be pranayama) and told me to “go exercise three times per week.”\n\nI reluctantly got a pass at the YMCA and started exercising. I’d watch the Twins play baseball on television while bopping around on the elliptical, not really sure what I was doing, but enjoying it all the same. The more I exercised, the less I drank. A few weeks later, I even found the courage to end my abusive relationship (after trying and failing multiple times). In a matter of weeks, my therapist’s advice had already begun to change my life.\n\nAs things started to improve, I got a job at a fine dining restaurant with a manager who taught me things like, “It’s okay to make mistakes, I won’t hold it against you,” and “When you mess up, don’t make excuses. Just apologize and move on.” To this day, I owe a debt of gratitude to him for teaching me about healthy conflict.\n\n# Enter: Yoga\n\nI walked into my first yoga class on a chilly night in February. It was a vinyasa class, and I had no idea what to expect. My therapist had recommended that I try yoga, but I thought it was a thing for “weird hippies.” (Funny enough, I’d soon find out that *I was* a weird hippie.)\n\nMy first impression of yoga was that everyone was insane. I was surrounded by twenty adults, all of whom were making bizzare shapes with their bodies, rolling around on the floor and breathing in unison. I hung on for dear life, trying desperately not to look like an idiot.\n\nAfter class, the instructor asked me if it was my first time doing yoga, clearly aware of the fact that I was out of my element. When I told him that yes, it was, he suggested that I join their “30 Day Yoga Challenge,” and try practicing yoga every day, for thirty days.\n\nI immediately signed up.\n\nOver the next month, I fell in love. With the practice, the challenge, and the people. The lessons in self-love and self-care, and the new eyes through which I was seeing the world. It didn’t take long before I was obsessed.\n\n# A New Perspective\n\nWith yoga came clarity. Yes, I was unhappy, but I didn’t need to stay that way. I could leave and start over if I wanted. How had I never realized that I was the one in the driver’s seat?\n\nSo, I packed up my things and moved to Chicago. Soon after, I took my first yoga teacher training (at the suggestion of an instructor that I admired), which gave me the courage to book my first solo trip around Europe. After my solo trip, I quit my job at a marketing firm to work at mushroom stand at a farmer’s market. A few months later, I decided to end my relationship, sell all my things, pack a backpack, and travel the world.\n\nIn the eight years that followed I lived in Tenerife, Costa Rica, the Cayman Islands, and mainland Spain, all the while learning about who I am, what I want, and sharing my love of yoga. **It was a snowball effect.** Life became bigger, and crazier, and more wonderful than I ever could have imagined, one small step at a time. (But that’s a story for another day.)\n\n# My Why, Your Journey\n\nLooking back, there has been one clear, guiding force throughout my life: the kindness of other people. Little pieces of advice, a listening ear, or helpful comments have led me to make large, lasting decisions that have sculpted me into the strong, confident woman that I am today.\n\nWhen it comes down to it, we cannot do it alone.\n\nIt’s our connections that make life worth living.\n\nNow, thirteen years after my first yoga class, I only have one goal: **to pass on the kindness that I was shown and make a difference for someone else.** Whether it’s through a free online class, a yoga retreat, a cup of coffee, or a phone call, it’s my dharma to use what I’ve learned to gently guide others on their own journey of self-discovery, curiosity, and joy.\n\nIf you’re struggling, I’m here for you. And if you’re celebrating, I’m here for you too. I am so grateful for this community where we can lift each other up and embrace the mysteries of life. Everything is more fun when you do it with friends.",
    "score": 37,
    "url": "",
    "created_utc": 1743431527.0,
    "author": "madisonelyseretreats",
    "permalink": "/r/yoga/comments/1jo4l7u/falling_failing_and_finding_yoga_my_messy_journey/"
  },
  {
    "title": "[COMP] Kakasana -> Bakasana",
    "body": "Phew 😮‍💨 🥵",
    "score": 35,
    "url": "",
    "created_utc": 1742678543.0,
    "author": "Prestigious-Olive130",
    "permalink": "/r/yoga/comments/1jhj1cx/comp_kakasana_bakasana/"
  },
  {
    "title": "Intimidated by vinyasa",
    "body": "Hi all, newbie here, F50, trying to get into a regular practice for physical and emotional health. \nI live in New York City and the most popular forms of yoga by far are the “flow” types. Most studios and gyms offer predominantly these—including the gym I just joined.  I know it’s a great form of exercise, but I’m extremely uncoordinated and trying to keep up with the choreography of postures and pace is not easy, even in the ‘slow-flow’ classes. I worry about injury from going too fast and not focusing on form. Does the coordination get easier with time, or is it too risky? Is vinyasa flow better suited for athletic folks? Thanks for sharing any tips or your own journey with this practice.  I know there are other forms to seek out, but I’d love to not have one more place to go (and pay for). ",
    "score": 37,
    "url": "",
    "created_utc": 1742179996.0,
    "author": "woodsytiger1118",
    "permalink": "/r/yoga/comments/1jd2wmp/intimidated_by_vinyasa/"
  },
  {
    "title": "Where are you supposed to feel the stretch in \"happy baby\"?  Is it normal that I feel sharp soreness in front hips?",
    "body": "I always feel sharp soreness in the front creases of my hips (where my torso joins my legs) whenever I do happy baby. It’s tolerable but not a 'feel-good' stretch. Does this indicate that I’m doing it incorrectly, or are there weak areas I need to address? Thanks in advance. ",
    "score": 35,
    "url": "",
    "created_utc": 1742111729.0,
    "author": "BigBigMarmott",
    "permalink": "/r/yoga/comments/1jcgjv0/where_are_you_supposed_to_feel_the_stretch_in/"
  },
  {
    "title": "Awkward question",
    "body": "So it's probably a very common thing that men have to figure out but when doing position where you're laying down. \nWhere do you put your pp ?\nIt feels pretty awkward to be trying to place it Somewhere it won't get crushed like a ravioli.\nAnyway 💀",
    "score": 33,
    "url": "",
    "created_utc": 1743078663.0,
    "author": "FALIDBA",
    "permalink": "/r/yoga/comments/1jl2se7/awkward_question/"
  },
  {
    "title": "Learning to engage the pelvic floor without clenching?",
    "body": "Hi fellow yogis 🌿\n\nI’ve been diving deeper into awareness around Moolabandha and the pelvic floor, and was chatting with my teacher recently about engaging the psoas and pelvic floor in practice - especially in poses like Downward Dog, forward folds, jump-throughs, etc. She spoke about finding a subtle “upward lift” from deep inside, rather than a strong muscular contraction.\n\nWhen I try to engage my pelvic floor, I usually end up squeezing - like I’m trying to stop peeing or clenching my anus - and it just feels tight, tense, and kind of debilitating. Not like the grounded, lifted energy I keep hearing about.\n\nI recently came across a visualisation that seemed to help: imagining a tiny seed at the base of the pelvis, and gently lifting it up through the center of the body on the exhale. Though the feeling is very subtle (maybe even imagined?), and I've not been able to replicate it in practice, only when completely relaxed and sat still / laying down.\n\nSo I guess my question is:\n\n* How did you learn to engage your pelvic floor in practice?\n* How do you tell the difference between true internal lift and just clenching or bracing?\n* Are there any cues, metaphors, or practices that helped you refine this connection?\n\nI’d love to hear from anyone who’s explored this — especially if you’ve had a “I think this might be it?” kind of moment 🙏\n\nThanks in advance for sharing your experiences!",
    "score": 35,
    "url": "",
    "created_utc": 1742726799.0,
    "author": "SwimmingInSeas",
    "permalink": "/r/yoga/comments/1jhwjwe/learning_to_engage_the_pelvic_floor_without/"
  },
  {
    "title": "No asana has done as much for me and my piriformis as",
    "body": "Supta Gomukhasana\n\nWhen I did it the first time in a class it was the first time I felt true relief in my lower back and deep glutes especially after a practice with many one-sided leg lifts. \n\nWhat pose has done the most for you? ",
    "score": 37,
    "url": "",
    "created_utc": 1742227253.0,
    "author": "elkmorning",
    "permalink": "/r/yoga/comments/1jdg5xx/no_asana_has_done_as_much_for_me_and_my/"
  },
  {
    "title": "How much do you pay for a studio membership?",
    "body": "Pretty new to yoga. I signed up for a few classes at the studio near my house and I have really enjoyed them! I've been looking into a membership with them and it's around $150/month. Is that amount for a membership normal? It seems a little steep but I could be wrong.",
    "score": 31,
    "url": "",
    "created_utc": 1743445213.0,
    "author": "nonconformistnuggets",
    "permalink": "/r/yoga/comments/1joa3pt/how_much_do_you_pay_for_a_studio_membership/"
  },
  {
    "title": "Bumps on mat?",
    "body": "Any one know what these could be? I just noticed them after this morning’s practice and it’s freaking me out! It’s a lululemon mat I’ve had for about 4 years. I practice yoga about once a week, sometimes heated, but always air out my mat and clean it when needed. It’s just in the one corner of the mat, the rest looks normal",
    "score": 35,
    "url": "",
    "created_utc": 1743467216.0,
    "author": "Giggles924",
    "permalink": "/r/yoga/comments/1joioal/bumps_on_mat/"
  },
  {
    "title": "Changes",
    "body": "Hello everyone. I'm 27 and I'm 175 cm tall and weight 90 kilos. I've been practicing yoga since I was 18 and want to become a teacher. But in the last year I haven't practiced due to depression and weight gain, I've gained 20 killos in one year. I intend to lose it doing vinyasa yoga and eating a balanced diet. I've been doing yoga 6 days a week for a month now and I love being back to the mat. Yesterday there was a change in me: I've stopped smoking! I used to smoke one pack of cigarette for two years now I've just stopped ",
    "score": 31,
    "url": "",
    "created_utc": 1742487507.0,
    "author": "warmcoffee00",
    "permalink": "/r/yoga/comments/1jfsosn/changes/"
  },
  {
    "title": "One for the teachers(?) : you're setting up for a class at 7pm, it's 6:52 I'm ready for the class on my mat, what should I do with those 8 minutes?",
    "body": "",
    "score": 30,
    "url": "",
    "created_utc": 1743778040.0,
    "author": "Dopamine_Dopehead",
    "permalink": "/r/yoga/comments/1jrdof9/one_for_the_teachers_youre_setting_up_for_a_class/"
  },
  {
    "title": "Sensations during savasana",
    "body": "hi guys, i wanted some help regarding yoga. i am a beginner and have done yoga for about 20 times this past month. i do it from this books called “yoga and kriya” and the most beginners relaxation poses ive been doing, no advanced asanas or anything.\n\n\nat last when i do savasana, i feel this tingling waves pass through my entire body and it is so so relaxing afterwards. i read about it online, not much information but something to do with prana energy. i only felt it like 4-5 times and it lasted for about 5 seconds, not more. i wanted to know if you guys know what it is and if you feel it too, and would it last for long after doing it for a while? \n\n\nalso, i dont feel this for other times when i do practice. and this makes me so frustrated and then there goes my relaxation lol. am i doing something wrong or is this normal? any particular advice? \n\n",
    "score": 31,
    "url": "",
    "created_utc": 1743345777.0,
    "author": "Relevant_Agent6209",
    "permalink": "/r/yoga/comments/1jndwy6/sensations_during_savasana/"
  },
  {
    "title": "Mastectomy & Implants - over or under the muscle?",
    "body": "Anyone have any experience with implants? I’m having a mastectomy and getting a silicon implant. The Doc said because I do so much yoga that it might be better to insert the implant over the chest muscle vs the more typical under the muscle insertion.I’m concerned about the risk of blatant rippling that is more common with over the muscle. I’m not concerned with the recovery time/pain, just the flexibility and aesthetic when I’m fully healed. I am going for a natural look. Does anyone have experience in this area? \n\nI’m petite and do a lot of hot yoga, so party bonus if you know what happens with that type of setup :) ",
    "score": 34,
    "url": "",
    "created_utc": 1742268667.0,
    "author": "Jumpin_bumpin",
    "permalink": "/r/yoga/comments/1jdw0w9/mastectomy_implants_over_or_under_the_muscle/"
  },
  {
    "title": "Crow Pose",
    "body": "Hi yogis, \n\nI (28F) am completely convinced I will never be able to do crow pose…I try building into the pose but immediately just get this sensation that my knees are digging painfully into the back of my arms, and that I’m totally incapable of lifting my body off the ground. \n\nFor some context -\n\nI’ve been practicing on and off for 4 years, with a very consistent year long phase in 2022, and consistently back at it now for 6 months. I practice 3-4 times a week (hot flow) and make myself do sculpt for one of the times. On a good week I also challenge myself to a 26 pose hot yoga sequence (the one with no vinyasa but lots of standing and balance poses).  \n\nDo you think this is just a mental block, as I have a lot of fear around it? (if so, how do I break through that?) or something that I can expect to come with more practice? …I am overweight (“skinny fat”) so maybe this pose just doesn’t happen for people with my body type / at my fitness level? Open to any thoughts / suggestions. 🙏 ",
    "score": 29,
    "url": "",
    "created_utc": 1743824720.0,
    "author": "Accomplished_Rice_31",
    "permalink": "/r/yoga/comments/1jrume2/crow_pose/"
  },
  {
    "title": "What makes a good Yin yoga class?",
    "body": "Is it the poses? The space/vibe created by the teacher? Something else? ",
    "score": 30,
    "url": "",
    "created_utc": 1742937307.0,
    "author": "meinyoga",
    "permalink": "/r/yoga/comments/1jjukje/what_makes_a_good_yin_yoga_class/"
  },
  {
    "title": "Reclined butterfly anxiety or almost panic",
    "body": "My therapist recommended trying out yin yoga, and it happened both times I tried the reclined butterfly pose. The first time I used two blocks, and I wanted to jump right out of it, a sudden rush of adrenaline and anxiety hit me, but I lived through this, and my second time I used two rolled blankets and I felt it was easier emotionally. Do you think it’s some kind of the trauma response? I started learning about the yoga meridians and seems like this area might be affected, feels like chest and head, so scared and anxious when I do it. I am new to this, I will appreciate your insights. ",
    "score": 31,
    "url": "",
    "created_utc": 1742184287.0,
    "author": "OSkylark",
    "permalink": "/r/yoga/comments/1jd46ef/reclined_butterfly_anxiety_or_almost_panic/"
  },
  {
    "title": "Is yoga difficult?",
    "body": "For context, I lift weights regularly and run. Adding yoga for extra strength and stretching. \n\nMy gym offers yoga classes, no level. Just “yoga”. Is it difficult and is there anything I need to know ahead of my first class? ",
    "score": 28,
    "url": "",
    "created_utc": 1742129515.0,
    "author": "Soggy_Performer_5669",
    "permalink": "/r/yoga/comments/1jckriq/is_yoga_difficult/"
  },
  {
    "title": "Does being sad lessen your endurance for yoga?",
    "body": "I (29F) began my yoga journey last year and I loved it. I started with 15 minutes of mild yoga every day and eventually my body adjusted and I started craving higher impact yoga workouts. I would do 3-4 classes per week, mostly Vinyasa but also Ashtanga and Rocket. \n\nThis year, I began noticing a shift in what my body wants. It's been a really difficult/sad/lonely quarter for me and probably because of that, I've been less motivated to do active yoga and have been focusing more on gentle yoga. \n\nI know that there's nothing wrong with this, it's possibly just that my emotions are taking away most of my energy but I do worry that I'm losing strength because of how mild my exercises are. Before it became a mental practice for me, my main focus was to keep fit. I built a lot of muscle last year and noticed my body transform and I worry that I'll lose that because of how unmotivated I've been this year. \n\nAnyone had a similar experience, would love to hear it! Would also appreciate thoughts/opinions on this :( ",
    "score": 28,
    "url": "",
    "created_utc": 1742730479.0,
    "author": "littlegreengoblin25",
    "permalink": "/r/yoga/comments/1jhxgpg/does_being_sad_lessen_your_endurance_for_yoga/"
  },
  {
    "title": "Is yoga supposed to be stressful?",
    "body": "Apologies for the long post or if I'm asking this on the wrong sub, but wanted to get opinions from those with experience.\n\nSo I just tried out yoga class twice (once last week and once today), two different instructors. I absolutely hated it on both occasions. I've tried sound baths twice as well and absolutely could not bear those either, was torturous for me. The purpose of my post here is to ask whether anyone else that's diagnosed autistic has had, or knows of someone that has had this experience? I searched Reddit and couldn't find anyone else with this experience but surely I can't be the only one. Perhaps anyone on this sub might be aware of people they've recommended yoga to only for it to be literally the most stressful and least \"chill\" activity?\n\nEven though I am the least flexible person I know for my age (31M), it's more the mental overstimulation of trying to follow verbal instructions. I find even the beginners' class to be a bit too fast and a verbal onslaught of complex instructions which I can only follow if I'm watching the instructor - I simply cannot understand what is being asked of me and yet everyone else manages to do this stuff with eyes closed effortlessly! I spoke to the instructor afterwards and she said I was doing well, but internally everything feels completely disconnected. Like, is this normal? Am I supposed to hate it? I've read that yoga is about mind-body connection, but I literally feel the exact opposite when doing that. I also cannot imagine a universe where even if I knew exactly what to do off by heart, I would find it relaxing or nourishing spiritually. By contrast, I feel extremely engaged when playing intense competitive fast-paced video games or when driving fast IRL, or in my day job when programming.\n\n  \nSo my question really is: do I hate yoga because I hate \"meditation\"? (I hate going on holidays too). Is yoga supposed to be relaxing (from a mental perspective)? I'm guessing that it's one of those activities that many claim is \"for everybody\" but I get the impression that if you're not a neurotypical woman with a certain lifestyle it's much less likely to be enjoyable, unless I'm missing something? Thanks in advance.",
    "score": 27,
    "url": "",
    "created_utc": 1742344660.0,
    "author": "n0d3N1AL",
    "permalink": "/r/yoga/comments/1jekp50/is_yoga_supposed_to_be_stressful/"
  },
  {
    "title": "When an instructor tells me to send love and peace throughout my body I don’t know what that means.",
    "body": "I took a yoga nidra class tonight for the first time, and the instructor would prompt me to feel love and peace in my body, and to feel it in specific parts of my body. I realized I don’t know what the means. \n\nI’m sure it’s subjective and unique to each person, but I’m not sure where to begin with feeling and sending love and peace in my body. ",
    "score": 28,
    "url": "",
    "created_utc": 1743644252.0,
    "author": "mochaboo20",
    "permalink": "/r/yoga/comments/1jq5x32/when_an_instructor_tells_me_to_send_love_and/"
  },
  {
    "title": "Setting intentions",
    "body": "Hi everyone, I hope everybody is good! \nI wanted to ask a question. I recently made a post and a user commented about setting an intention when getting on the mat. I've been reflecting on this and I'm not sure what it means. There is mixed advice online too. \n\nIs it an intention of a pose I want to be better at or a focus on something in particular like my breathing? Or is it more abstract and what I want from the day, week, year etc?\n\nA long winded way to ask: what kind of intentions do you set at the start of the practice? How do you find it influences your practice? \n\nI want to take my practice deeper, so any insight would be gratefully appreciated!",
    "score": 27,
    "url": "",
    "created_utc": 1742511223.0,
    "author": "Trixie100",
    "permalink": "/r/yoga/comments/1jg2695/setting_intentions/"
  },
  {
    "title": "Weekly attendance?",
    "body": "How often are you guys attending yoga classes a week? I recently picked up hot yoga after practicing at home the last few months. I really love it, but I’m trying to find a healthy balance between it and the other things in my life. I’m also a bit concerned about the fact that it’s hot yoga, I’m trying to stay hydrated often but it’s definitely hard. Right now I’m taking around four 1 hour classes a week. Is that pretty standard? It’s a $130 monthly membership so I want to get my moneys worth out of it too. ",
    "score": 25,
    "url": "",
    "created_utc": 1742335827.0,
    "author": "wickedbitchnorth",
    "permalink": "/r/yoga/comments/1jehg3w/weekly_attendance/"
  },
  {
    "title": "Does it matter that my feet soles are not completely on the ground while doing downward dog? And which training helps do get them on the ground?",
    "body": "",
    "score": 28,
    "url": "",
    "created_utc": 1742222680.0,
    "author": "dumb-hilly-billy",
    "permalink": "/r/yoga/comments/1jdebhb/does_it_matter_that_my_feet_soles_are_not/"
  },
  {
    "title": "Burn out",
    "body": "I’m so burnt out from my job. im a full time server at a busy restaurant and it wrecks my mind and body. it’s making me hit a wall with teaching. i don’t want to give up my classes, ive already dropped a couple. but i also want to give my students the best experience and be able to give them what they deserve. i have no time or energy to practice or take classes myself. any advice? plz be kind, im emotional about this. should i try meditating more? it sucks i have to put my passion to the side to pay my bills.. i hate it here 😭",
    "score": 27,
    "url": "",
    "created_utc": 1743521384.0,
    "author": "yazxoxoxo",
    "permalink": "/r/yoga/comments/1joyg1c/burn_out/"
  },
  {
    "title": "Yoga with no yoga in it.",
    "body": "There’s a great Tibetan Buddhist saying that goes something like “as many monks as many paths” which my first yoga teacher used during a lecture one evening. In essence what he was saying is that everyone has their own journey through this life and the yoga system, in its vastness, can accommodate all souls’ routes as they develop on this planet. [Edit: grammar]\n\nSo for some like Amma,  the hugging mother, there’s a devotional, Bhakti,  path to yoga. For others, it’s through consecrating one’s daily actions and enabling the divine to work through you: karma yoga. Then there’s Kriya, jnana, hatha, svara, Tantra, laya, and more. \n\nThe system is all-encompassing, but has the same intended outcome for all: self-development. \n\nDuring one of the first yoga lectures I attended the teacher asked how many people in the room were perfect. He explained that yoga was not for those with no flaws or who thought they were perfect; it was for people who wanted to develop physically, emotionally, mentally, and spiritually. \n\nI think it was Swami Yogananda who famously came to the West from India on the instruction of his guru Sri Yukteswar with the task of gifting yoga and Indian spirituality. Upon his return he said he’d been to the land of Christians and found no Christians, and it’s really with this sentiment I feel compelled to write this post. “Where’s the spiritual teaching in your yoga practice?” is the question I’m asking really. “Where’s the reflection of how something makes you feel, internalising rather than pointing the finger at another person?”. \n\nThere are so many posts in this group that talk about how irritating teachers are, or how this other person did this or did that. So many people seeking support for their own fragile ego so they can feel justified in making someone else wrong.  It just strikes me it’s not the place for this. We can be better than that. Being presented with and overcoming irritation of this sort is gold for our spiritual development, and yoga philosophy teaches us that being irritated by someone only hurts the irritated person. Developing empathy and compassion removes these childish and selfish irritations from life and truly develops us, and yoga, when studied and used as the tool for development it is, produces this outcome. \n\nIsn’t that what we all want? Isn’t a life free from constant and spontaneous irritation and meltdown attractive, and wouldn’t we, and all those around us, benefit?\n\nThe Yama-s and niyama-s provide the framework for spiritual development and improving our personality, but how few have any inclination to study them. The ego says we’re already perfect, or better than someone else anyway, or worse, doomed to be like this for a reason we simply accept, so there’s nothing that needs to, or can be done. And in that moment the metaphorical devil on our shoulder wins our attention, and life carries on towards its inevitable end, unchanged. \n\nCan we transform ourselves and this group from an asana pose-fest and general gossip-house where loneliness and sadness prevail into a place of real self-improvement and support? Touching your toes with your elbows (I exaggerate) or such-like wasn’t on any of yoga’s greats’ radars, and reducing it to merely a physical exercise makes us a land of yogis with no yogis.\n\n\n\n\n\n",
    "score": 27,
    "url": "",
    "created_utc": 1743240596.0,
    "author": "Akashananda",
    "permalink": "/r/yoga/comments/1jmilmm/yoga_with_no_yoga_in_it/"
  },
  {
    "title": "A yoga journey",
    "body": "I’ve dabbled in yoga my whole life however I’ve never liked it. In fact, I’ve always joked I wanted a shirt that said “I f$&amp;)ing hate yoga”. I’ve always been an avid weight lifter and runner, and before that I competitively kick-boxed for many years. That being said, I hit a bump in my health journey. Two years ago, I was misdiagnosed as depressed and it took a lot of work to resolve that it was actually perimenopause! Yaaaay. I’m just old! Well, along that journey of losing myself I gained 65 pounds, had massive joint pain and was at ground zero with fitness. A friend encouraged me to join her at her yoga studio in September for a trial, and…I liked it. I joined. I tried a few more classes and then tried hot stretch. I fell in love with that. I started going to classes three times a week, mixing in various levels and a hot stretch. Tonight I finally built up the courage to do a hot vinyasa flow and I DID IT!!! I feel amazing. I’m hooked. I sweat like a hog and I faded at the end but I did it and I’m so proud that I did the hard thing. Of course my goal is to lose these lbs (I’m down 20) but I’m strong and refreshed and mindful and in a great community. Thanks ya’ll!!! I just hope anyone else who is on a similar journey gives themselves grace and tries a class they are curious about so you can find what you love! ",
    "score": 26,
    "url": "",
    "created_utc": 1743213545.0,
    "author": "CeeJay_Dub",
    "permalink": "/r/yoga/comments/1jmbtcs/a_yoga_journey/"
  },
  {
    "title": "Introducing my boyfriend to yoga and I love it!",
    "body": "He's going through all the usual things I went through when I started - finding that one side is stiffer/tighter than the other, being doubtful about savasana and then reluctantly realising it's actually pretty good (he has tourettes and he said it actually helped with his tics that day), feeling a strange wave of an emotion from a certain pose (my first one of these I cried ad cried, weirdly his first one he laughed) - I just love seeing him discover this stuff I discovered when I started too! We're not going to \"proper\" classes, we're just doing it in the living room with youtube videos.",
    "score": 26,
    "url": "",
    "created_utc": 1742913603.0,
    "author": "DaisyBryar",
    "permalink": "/r/yoga/comments/1jjkxa2/introducing_my_boyfriend_to_yoga_and_i_love_it/"
  },
  {
    "title": "Chaturanga help pls",
    "body": "I can never flow through from plank to upward into downward without having to go on my knees while lowering from plank position into upward dog 😭 idk if my form is bad or if I just have no upper body strength. What do I do?\n\nEdit: incorrectly explained chaturanga",
    "score": 24,
    "url": "",
    "created_utc": 1742604075.0,
    "author": "carbon_sink",
    "permalink": "/r/yoga/comments/1jgw8yy/chaturanga_help_pls/"
  },
  {
    "title": "What is yall thoughts on if emotions are stored in the body?",
    "body": "Been tryna explore this more. What has your experiences been? With your mind and body connection in doing yoga related to your life and how it improved it? In terms of anxiety, trauma, etc etc or whichever way it did. Thank u",
    "score": 23,
    "url": "",
    "created_utc": 1741962266.0,
    "author": "Nido616",
    "permalink": "/r/yoga/comments/1jb53ol/what_is_yall_thoughts_on_if_emotions_are_stored/"
  },
  {
    "title": "Is this normal for Yin?",
    "body": "I did a Try It Out, 1 class free, Yin session tonight and I'm really not sure what to think. I don't know if my expectations were out of line, if I need a different teacher, or if this is normal. And I'm hoping for some insight.\n\nExpectation:  I was under the impression, from the little that I know of the Yin style, that basically the teacher would get you set up in position, get some breath regulation/pranayama going, maybe start on a path of guided meditation/relaxation, and then fade out of speaking and run the clock. (in the most basic terms)\n\nReality: The instructor talked almost non-stop. Well, to be fair there was a space of about 30 seconds when she grabbed her water bottle.\n\n\"Ok, do ______ to get into position. OK! Beautiful! Now take a deep breath, focus on a point in front of you, close your eyes. Think about your breathing, think about your space.  We will have 3 minutes of *silence* now\"...space of 3-4 breaths....\"Think about what needs to be let go of, think about releasing stress\"....space 3-4 breaths...\"think about where your are breathing from. Your mouth? nose? soles of feet? eyeballs?\"...space 3-4 breaths.....you get the idea.\n\nThe whole class was like this. \n\nWhen I think of silence, I think of, well, silence (maybe some soft music). It was really hard to concentrate on relaxing and breathing when the instructor was adding a continuous running commentary.  \n\nNot to mention, with those little 3 or 4 breath pauses, whenever she started talking again, it made me think that I should be listening for a cue...so, whenever I started to \"sink in\" she just yanked me back out.  \n\nShe talked non-stop through Savasana as well, which I've never experienced  either...and it's the reason why I am questioning if it is the style or the instructor.\n\nIs it worth it to look for a new instructor? Or is this normal for a Yin class? did I just stumble on a teacher that does not fit my relaxation needs?  Is Yin maybe just not for me? \n\nI was excited about the class and in a good mood when I went in. I left feeling nothing but frustrated and agitated. \n\nThe style itself is interesting and if I had access to a mute button, I can see really having enjoyed it. I'd like to give Yin another chance, but I don't know if another instructor might be better, or if this is just how it is done?\n\n\nOn a side note:  I am new to the restorative/meditative/relaxation side of yoga. Is \"feel the tension releasing from your eyeballs as you breathe through them\" a normal relaxation cue?  \n\nOur teacher was lying on her back, with her eyes closed, under a blanket...so impossible to see her body posture... and chattering away....the whole class opened our eyes almost in unison and glanced around at each other like \"Eyeballs? is this woman off her rocker?\"\nIf it's a more advanced visualization technique, ok, cool... but as it was, in a beginner, class...it was just weird.\n\nI'm also thinking that an instructor obliviously chilling under a blanket with her eyes closed, while 15 new students are trying to contort themselves into new and exciting positions, probably goes a long way towards answering my question....\n\n",
    "score": 23,
    "url": "",
    "created_utc": 1742354966.0,
    "author": "Ryllan1313",
    "permalink": "/r/yoga/comments/1jeo0o5/is_this_normal_for_yin/"
  },
  {
    "title": "Tree pose - how far up does your foot goes?",
    "body": "When setting up for the tree pose, my foot seems to settle somewhere at the height of my knee. I then need to move it with my hand if I want it further up my thighs. Even then, it starts sliding back down as soon as I let go. Are you'all able to get your foot higher without assistance? Are there specific muscles that need to be worked on before I can do something that resemble to what I see on youtube?",
    "score": 22,
    "url": "",
    "created_utc": 1743422350.0,
    "author": "Little-Rise798",
    "permalink": "/r/yoga/comments/1jo1gb1/tree_pose_how_far_up_does_your_foot_goes/"
  },
  {
    "title": "How to improve 3-legged dog and hip strength/flexibility",
    "body": "Basically title. I'm a dude who has been practicing regularly for years. I am in shape, relatively strong upper and lower body but for whatever reason I absolutely struggle relentlessly with 3 legged dog. I've concluded it's partially just my muscle/bone structure.\n\nI can't easily elevate my leg past essentially parallel with the ground when I kick back and up out of downward dog. I wince whenever an instructor invites the class to \"stack the hip and bend the knee.\" It's so incredibly difficult for me to get my hips/legs into form and maintain equal weight distribution in my arms.\n\nAny advice from those who've been here before? Some people make these movements look incredibly effortless and I'd be lying if I said I wasn't envious.",
    "score": 20,
    "url": "",
    "created_utc": 1742918001.0,
    "author": "desertplatypus",
    "permalink": "/r/yoga/comments/1jjmnnx/how_to_improve_3legged_dog_and_hip/"
  },
  {
    "title": "Yin yoga - doing longer pauses/breaks after every pose - yay or nay?",
    "body": "I started attending yin yoga in my yoga studio and we would take 2-3min of pause in a resting pose (shavasana, child's pose, lying, shavasana with bolster under back/upper back, etc) between each 5min yin pose, to feel the diferrence in the body and whatnot. \n\nI was checking yin yoga book from  Kassandra Reinhardt. She has a 60min yin yoga practice - 12 yin poses, 5min each, and there's no talk about the in between pauses.\n\nWhy do some people practice yin with pauses and some don't? How do you do yin yoga? ",
    "score": 22,
    "url": "",
    "created_utc": 1742236689.0,
    "author": "EveyHammond182",
    "permalink": "/r/yoga/comments/1jdk4kr/yin_yoga_doing_longer_pausesbreaks_after_every/"
  },
  {
    "title": "My wrists are trash",
    "body": "I'm really struggling, I can't seem to hold downward dog or even table top for any length of time. My wrists feel like they're on fire and my hands turned into pins and needles.\n\nIt's causing me to completely rage out and I don't know what to do, but I needy everyone's tips on working with this! ",
    "score": 21,
    "url": "",
    "created_utc": 1743905051.0,
    "author": "badjokes4days",
    "permalink": "/r/yoga/comments/1jsjkpq/my_wrists_are_trash/"
  },
  {
    "title": "Help me understand how the scandals and abuse refer to „Western Yoga“",
    "body": "Please hear me out, I’m asking this from a genuine place of interest. Maybe I  haven’t practiced yoga long enough, nor followed the media surrounding the yoga world in general and the „gurus“ in particular, to have had a lot of exposure to this?\n\n\nI read, particularly on here, about the scandals and abuse in „western yoga“. \nOf course I’m aware of the issues surrounding people like Bikram, Pathabi Jois, Iyengar and others.\n\n\nWhat I am however struggling to understand is how this is a „western yoga problem/scandal“ when the people responsible are not „Westerners“. \nAm I wrong to assume that these predators and self proclaimed gurus would do the same in India and elsewhere? \n\n\nTo be very clear here: I am NOT condoning any of the behaviour exhibited by these abusers who prey on the sexual, mental and emotional vulnerability of their victims, nor am I shaming the latter. I am simply trying to understand why this is usually mentioned in the same breath as any criticism of westernised yoga.\n\n\nThank you for your insights!",
    "score": 20,
    "url": "",
    "created_utc": 1743842649.0,
    "author": "meinyoga",
    "permalink": "/r/yoga/comments/1jrz2hu/help_me_understand_how_the_scandals_and_abuse/"
  },
  {
    "title": "Unable to press palms to mat while lunging. Is there a way to build toward this or is it just anatomical differences?",
    "body": "I've struggled a lot with the transition from three legged dog to lunge but always assumed that it was something I could build to over time. But last night I realized during my practice that in the lunge the cue was \"press your palms into the mat and kick back to plank\" and I couldn't reach my palms to the mat. Like my knee was firmly in my chest and I couldn't reach any further. Is this because I still have a bit of belly and losing that will help? Or do I just have shorter arms than my legs will allow?",
    "score": 21,
    "url": "",
    "created_utc": 1743691556.0,
    "author": "Players-Beware",
    "permalink": "/r/yoga/comments/1jqkcfj/unable_to_press_palms_to_mat_while_lunging_is/"
  },
  {
    "title": "How does one build a personal yoga practice?",
    "body": "I'm trying to build a personal practice where I don't need to follow along a class or video, but I'm a bit confused of how to do that. Do you follow someone else's flow? I know the common advice is just get on the mat everyday, but that's not really helpful and most of the time I just feel dumb for not knowing what I'm doing",
    "score": 20,
    "url": "",
    "created_utc": 1743024422.0,
    "author": "MoonriseTurtle",
    "permalink": "/r/yoga/comments/1jkn79b/how_does_one_build_a_personal_yoga_practice/"
  },
  {
    "title": "How to prep for hot yoga?",
    "body": "Obviously everyone is a little different. I did yoga for several years when I was younger and got serious about it again last year. I’ve never tried hot yoga before and am wondering if it’s a good idea to drink coffee and have the same kind of light breakfast (usually just yogurt, a banana, or a protein bar) I’d have before a normal class. I’m covered on electrolytes and tend to drink a lot of water so I’m not worried about being dehydrated, I’m just wondering if my stomach will hurt because of the heat. Sorry if this is a dumb question! I’m going to my first Bikram 26&amp;2 class tomorrow morning, and I’m excited! ",
    "score": 22,
    "url": "",
    "created_utc": 1742597618.0,
    "author": "strapinmotherfucker",
    "permalink": "/r/yoga/comments/1jgtyjl/how_to_prep_for_hot_yoga/"
  },
  {
    "title": "Yoga causing panic attack and discomfort - should i continue?",
    "body": "I tried yoga last night, as a way to try to get fitter and help my mental health. I meditate at home so i didnt think there would be problems with it, but i don't get around other people very often and seldom leave the house.\n\nI attended a class because the teacher was very supportive, but i found that yoga is harder than i thought, especially since i have gained weight the past few years, lying down and kneeling hurt, and i wasn't very flexible, i was so aware of people around me. mid way through i just started to cry and freeze in place, and i spent the last 15 minutes of the class + ending meditative part still, i'm not really sure how to describe it but i felt locked in place..\n\nis this normal and should i try to go again and push through it? i can't say i want to go back but the teacher was really kind and checked up on me after class to see how i had been, but i left quickly because i was struggling to speak/respond. does it get easier physically and mentally?\n\n  \nedit: thank you for the wonderfully considerate responses :-) i'll go back next week and persist through it/ work with it, and update the teacher on my difficulties! happy practising to the rest of you!",
    "score": 18,
    "url": "",
    "created_utc": 1743092633.0,
    "author": "breatheandrelease",
    "permalink": "/r/yoga/comments/1jl7wky/yoga_causing_panic_attack_and_discomfort_should_i/"
  },
  {
    "title": "Breathing game",
    "body": "Today I took the opportunity to focus on my breath and I played a game of counting my breaths in and out and it absolutely transformed my practise!! I flowed easier, I moved like water, it is as if I let go of any restraints in my movt and i just allowed myself to flow through!!! Game-changer!!!  I feel Thankful, for yoga, especially yoga with Kassandra, today i had iron yoga for the first time in my life and I tell you!! I am absolutely sold 🎉🎉🎉🎉🎉 I feel loved for youtube, youtube downloads, for the existence of YOGA!!!!! WOOOOW!! I feel immensely blessed!! I am absolutely fortunate to know yoga and I am thoroughly exhilared about my journey here, the adventure!!!! I love it!!! Completely and utterly!!! I like feeling this way!! It is an immense feeling of BLESSEDNESS!!!!! 🥰🥰🥰🥰🥰🥳🥳🥳🥳🥳",
    "score": 18,
    "url": "",
    "created_utc": 1742710490.0,
    "author": "uhwhaaaat",
    "permalink": "/r/yoga/comments/1jhsv0r/breathing_game/"
  },
  {
    "title": "Favorite accessories both necessary and unnecessary?",
    "body": "Obviously all you truly need for yoga is yourself but there are thousands of different types of yoga mats,towels, blocks, straps, and wheels. What are your favorites? Including ones that I didn’t mention.",
    "score": 19,
    "url": "",
    "created_utc": 1742672660.0,
    "author": "steampunkpiratesboat",
    "permalink": "/r/yoga/comments/1jhguqm/favorite_accessories_both_necessary_and/"
  },
  {
    "title": "Do you wear anything to protect your wrists? Is it a good idea?",
    "body": "My field of work requires me to heavily rely on my hands and wrists so I need to be careful with exercises, especially since my wrists are weak.\n\nI sometimes worry when doing yoga, since it requires to put so much weight on the hands and wrists. I’ve started doing some light weight training exercises to help strengthen my wrists but I was wondering if you all use any type of wearable wrist protectors, similar to how people use knee pads etc to just reduce the risk of injury or make sure the body weight is being distributed correctly while doing yoga? If so, any recommendations?\n\n\n\n\n\n",
    "score": 19,
    "url": "",
    "created_utc": 1742396406.0,
    "author": "FinalSun6862",
    "permalink": "/r/yoga/comments/1jeyz9k/do_you_wear_anything_to_protect_your_wrists_is_it/"
  },
  {
    "title": "What bottoms do you wear to practice?",
    "body": "At my studio, most people wear leggings to practice in. I always used to wear either leggings or shorts, but last few times I’ve been in joggers/sweatpants just for comfort/laziness. I ideally want bottoms that don’t irritate my skin and are breathable and are easy enough to wear for a lazy girl who likes her comfort as well as looking stylish. Any thoughts?",
    "score": 19,
    "url": "",
    "created_utc": 1742166725.0,
    "author": "GreenandWarm",
    "permalink": "/r/yoga/comments/1jcyihh/what_bottoms_do_you_wear_to_practice/"
  },
  {
    "title": "Can someone please tell me what the name of this hand mudra is?",
    "body": "",
    "score": 16,
    "url": "",
    "created_utc": 1742719519.0,
    "author": "hmmmmmmsure",
    "permalink": "/r/yoga/comments/1jhuw47/can_someone_please_tell_me_what_the_name_of_this/"
  },
  {
    "title": "Coming Back Home",
    "body": "About 30 years ago i stepped into my very first ashtanga class. Since then, I've stopped at many points along the way in countless iterations and expressions. While my 53 year old body is not the same as it was at 23, there is no denying the simple, mathematical, symmetrical, grounding beauty of ashtanga. So glad I've come back. ",
    "score": 17,
    "url": "",
    "created_utc": 1742327623.0,
    "author": "Adorable_Pangolin137",
    "permalink": "/r/yoga/comments/1jee5ky/coming_back_home/"
  },
  {
    "title": "Is timing necessary when holding poses?",
    "body": "I've recently been getting into yin yoga with a book I bought and it has sequences in it that tell you how long to hold a pose for at different levels of difficulty. Like 2 minutes for beginner etc\n\nOnly thing I don't like about this is if I am timing myself in a pose. I have to keep opening my phone, setting a timer and letting it go off, change pose then start a timer again. It feels like it ruins the flow and I can't properly relax into it having my phone in use. Can I just ditch it altogether and go off how I feel? Or is there a better way to time myself with no phone needed?",
    "score": 15,
    "url": "",
    "created_utc": 1743723204.0,
    "author": "LRAdontplay",
    "permalink": "/r/yoga/comments/1jqxpls/is_timing_necessary_when_holding_poses/"
  },
  {
    "title": "What does yoga truly mean to you—beyond asanas?",
    "body": "I practice yoga regularly, but lately, I’ve been wondering—if I have truly explored the depth of yoga beyond just asanas? My teacher often references Patanjali, but I’ve never actually dived into the Yoga Sutras myself.  \n  \nOne of my friend recently shared her experience of attending a discourse on Patanjali Yoga Sutra, and it got me thinking—how many of us actively follow the principles Patanjali talks about? Do you incorporate yamas, niyamas, pranayama, and meditation into your practice, or is yoga primarily a physical discipline for you?\n\nI’d love to hear from this community—what does yoga mean to *you*? How has your understanding evolved over time?",
    "score": 15,
    "url": "",
    "created_utc": 1743116317.0,
    "author": "FunnyOWL007",
    "permalink": "/r/yoga/comments/1jlgf1x/what_does_yoga_truly_mean_to_youbeyond_asanas/"
  },
  {
    "title": "Pregnant and so tired in the morning. I feel like I’m abandoning my practice.",
    "body": "I’m 12 weeks right now and prior to this pregnancy I would wake up before my older two kids, have some tea, journal a bit and do 20ish minutes of yoga asana. Now, I sleep through any alarm I set and when I do wake up it feels so heavy and difficult—almost like waking up from anesthesia. I’m getting at least 8 hours of sleep, drinking water when I wake up and varying my alarm tones but I still can’t manage to break through the overwhelming sleepiness. I really miss my morning time with myself and really want to have it again—especially since I know I won’t have it for awhile after the baby is born. I know we get more energy in the 2nd trimester but I’m worried the extreme morning sleepiness isn’t going to go away. I will of course bring it up to my midwife but I’m wondering if anyone else experience this or have any suggestions to help make waking up less difficult. I feel poorly like I’m not exercising enough will or dedication to my practice. ",
    "score": 16,
    "url": "",
    "created_utc": 1743019463.0,
    "author": "Certain-Ad-1413",
    "permalink": "/r/yoga/comments/1jkl7ug/pregnant_and_so_tired_in_the_morning_i_feel_like/"
  },
  {
    "title": "Does anyone take a while to feel comfortable deep breathing at the start of class? Tips welcome.",
    "body": "It’s tough for me to feel comfortable with deep breathing during maybe 15 minutes into class, like I do my breathes and try to breathe as deep as my instructor, but I find myself not being able to, and then falling slightly behind her deep breathing. After some more stretches, I start to feel my body relax and then the breathing gets easier, but I feel like I’m still not taking a truly deep breath. \n\nI’m a naturally anxious person, so I figure perhaps my body constantly feeling tense may have something to do with it. Any tips on how to take better deep breaths and relax quicker?",
    "score": 16,
    "url": "",
    "created_utc": 1742925242.0,
    "author": "mochaboo20",
    "permalink": "/r/yoga/comments/1jjplgl/does_anyone_take_a_while_to_feel_comfortable_deep/"
  },
  {
    "title": "If you could experience the first time you mastered a yoga pose again, which pose would you choose?",
    "body": "",
    "score": 16,
    "url": "",
    "created_utc": 1742511778.0,
    "author": "livstinky",
    "permalink": "/r/yoga/comments/1jg2dmz/if_you_could_experience_the_first_time_you/"
  },
  {
    "title": "Do you count breaths while holding a pose?",
    "body": "A question for yoga teachers out there.\n\nI suppose nobody wants asymmetric practice. (left/right side) So I'm wondering if you count breaths in your head to make it balanced, as in similar time spent on one side. Or does it come naturally with experience?",
    "score": 15,
    "url": "",
    "created_utc": 1743755644.0,
    "author": "Superb-Swan4688",
    "permalink": "/r/yoga/comments/1jr72j5/do_you_count_breaths_while_holding_a_pose/"
  },
  {
    "title": "Bananas and peanut butter seem to be the go to pre yoga snacks?",
    "body": "It seems that bananas and peanut butter (no necessarily together) are the go to snacks before yoga if you eat anything.  I wonder why?  I guess both are gentle on the stomach???",
    "score": 15,
    "url": "",
    "created_utc": 1743629147.0,
    "author": "dylan3883",
    "permalink": "/r/yoga/comments/1jq0bls/bananas_and_peanut_butter_seem_to_be_the_go_to/"
  },
  {
    "title": "Hypermobility and yoga",
    "body": "Does anyone have any recommendations on what kind of yoga would be okay for a person with hypermobility? I don't have any issues more than being extra bendy, but I was told it could become bad if I keep stretching too much/often/extreme. Thus my GP told me I should steer clear of exercises that risk extreme flexibility, but I've done some simpler poses at home and feel like I'd really manage as long as I don't force myself to become a pretzel.\n\nAny and all recommendations are welcome.\n\nEdit: It's clear my GP gave me a lazy speech. I'll take it all to heart and proceed with yoga. Thank you kindly for all the responses!",
    "score": 13,
    "url": "",
    "created_utc": 1742465784.0,
    "author": "GoodieLil2Shoes",
    "permalink": "/r/yoga/comments/1jflm9r/hypermobility_and_yoga/"
  },
  {
    "title": "How to get toned (see muscle) and incorporate yoga?",
    "body": "I LOVE yin yoga so much…I also love walking. I want to look toned…what should my routine look like?",
    "score": 13,
    "url": "",
    "created_utc": 1743734916.0,
    "author": "jaselun34",
    "permalink": "/r/yoga/comments/1jr1mf0/how_to_get_toned_see_muscle_and_incorporate_yoga/"
  },
  {
    "title": "kakasana - crow pose",
    "body": "how long did it take for you to achieve that pose?\ni know yoga isn't about how-much-time-can-you-do-certain-pose and im just curious really. i have been practicing yoga for about 6 months now and still have a tough time with the crow pose (can't do it but will one day!)\nshare tips on techniques and general experiences with this asana! 🙂\n\n.\n\n\nedit: guys I tried some of the tips shared here and I did 1 second of crow!!! im so excited, from where i was struggling so much to now actually doing it even if just a little bit... THANK YOOUUU YAAY IM SO HAPPY ITS WORKING ✨️✨️✨️",
    "score": 14,
    "url": "",
    "created_utc": 1743126888.0,
    "author": "quemiss",
    "permalink": "/r/yoga/comments/1jlk4ka/kakasana_crow_pose/"
  },
  {
    "title": "If you practice hot power flow tell me what you love about it!",
    "body": "I just searched the sub and found a lot of what people DON’T love about it lol. \n\nI started yoga about 12 years ago with Hot 26&amp;2, and I loved it. I fell into the trap of thinking if I wasn’t sweating, then what was the point?\n\nFast forward ten years and two children, I discovered an unheated slow flow at my local climbing gym that truly changed my life. I was out of shape postpartum and I sweated doing the simple poses (building my own heat! Something I didn’t understand before!) We gently cycled through Sun A into Sun B varations, built the flow toward a mild peak of triangle or one legged tasasana, and ended with easy bridges/legs up inversions before shavasana. It wasn’t yin or restorative, it was a vinyasa flow, but slow and unassuming, and truly formative for me. \n\nIt changed my life!!! It changed my yoga practice, my mind, my body, it prompted me to do 60 days of sun sals every day, and deepened my appreciation of yoga. I scoffed at the hot power flow classes and considered them more workout than practice. \n\nI decided to try one of the only non-hot studios in my area, which said it taught vinyasa—and the flow was completely different. It was entirely up to the teacher, it had none of the rhythm and familiarity I had come to welcome, starting with my beloved sun sals and building to that familar peak. It felt like the teacher was trying to reinvent the wheel. \n\nSo, as I got stronger, one day I went to a hot power flow class—and the sequencing was just what I love! It was just super fast paced, and super hot, but it still got me into that meditative state from the sequencing I appreciate so much. \n\nI realized I was resisting letting myself surrender to the fast pace because I thought it was “wrong” and that yoga needed to be slower, introspective, and unflashy. But I ended up realizing that my mind was even more free when I was forced to follow the fast breath to movement cuing that was pushing me (inviting me) out of my comfort zone (and of course still taking breaks if I needed to). \n\nI want to get my 200 hour training and even though I don’t want to exclusively teach hot, it’s this sequencing I want to learn. So if I go with this studio, then I’ll have more hot power flow in my life, and I want to reconcile that feeling that it’s “not real yoga” or “only a workout”. Or, that we should be building our own heat—bc I still kind of feel that way! So I’m conflicted!! \n\nSO, if you read this far, and you are a devoted hot power flow practioner, what do you love about it?? What does it add to your practice?? How do you balance the intensity of these flows with other yoga (unheated vinyasa, yin, etc)? \n\nThank you all 🙏 ",
    "score": 14,
    "url": "",
    "created_utc": 1742500835.0,
    "author": "fbc518",
    "permalink": "/r/yoga/comments/1jfy1si/if_you_practice_hot_power_flow_tell_me_what_you/"
  },
  {
    "title": "How many daily chaturangas for building muscles",
    "body": "Hello fellow yogis! \n\nI've been practicing yoga for a while, and while I appreciate the asanas, the philosophy and everything else that goes with it, after a surgery and being on the verge of diabetes, I would like to build muscle with my practice (yoga being the only type of physical activity that I truly enjoy). Has anybody done such a strength related practice? Any home practice recommendations maybe? \n\nThanks very much for your help and Namaste to the community! ",
    "score": 13,
    "url": "",
    "created_utc": 1742472250.0,
    "author": "fancypants_opinion",
    "permalink": "/r/yoga/comments/1jfnauq/how_many_daily_chaturangas_for_building_muscles/"
  },
  {
    "title": "108 sun solutions is it traditional or contemporary?",
    "body": "I've been practicing yoga for a decade, and today I ve done this 108 solstice sun salutations for the first time\n\nI felt quite intimidated by it at first, but surprisingly was a very beautiful practice. I felt very centred and didn't get tired at all throughout of it as I focused on the breath. Felt like a beautiful moving meditation \n\nAnyway the question is, I've been trying to find the origins of this practice and can't seem to. Does anyone know how it started?",
    "score": 14,
    "url": "",
    "created_utc": 1742412911.0,
    "author": "pollonguai",
    "permalink": "/r/yoga/comments/1jf5lyc/108_sun_solutions_is_it_traditional_or/"
  },
  {
    "title": "Has anyone else done this variation at the end of yoga/ Can you give a name for it?",
    "body": "Not sure if anyone else did this at the end of a class. I wanna know if its a variation or it has a different name. I used to go to yoga at the gym once a week and my teacher would have us do this at the end of class and it was my favorite.. I think it might be a variation of Savasana, we would lay on our back with arms and legs spread and would flex isolated parts of the body (feet, legs, chest, arms, hands, etc). And then sink into the mat and meditate. Couldnt find a video with the same flexing aspect and I think it really helps sink deeper into meditation. I could just do it on my own but I was curious if anyone else did it this way too.",
    "score": 15,
    "url": "",
    "created_utc": 1742326781.0,
    "author": "noopsies",
    "permalink": "/r/yoga/comments/1jedtie/has_anyone_else_done_this_variation_at_the_end_of/"
  },
  {
    "title": "How to tell if soreness after yoga class is good or bad?",
    "body": "I attend yoga class at LA Fitness 2-3 times a week and have been trying to continue since the start of the year. Monday and Friday is one instructor who encourages novices to use blocks and demonstrates easier poses. Wednesday is a different instructor who teaches above beginner level. Really like both teachers, they're incredibly encouraging and positive people. \n\nM/F teacher focused on triceps for class last week. I've been sore or in pain in my upper body every time I moved since Monday. I didn't attend Wednesday to give my body a break. I want to keep going with the classes but I'm scared I'm going to cause prolonged or permanent damage. \n\nI understand that some level of soreness makes sense after practice. I have lupus, and my stretching ability is atrocious due to limited mobility / ability to exercise as a teenager when I went through the worst of my illness. I also have costochondritis  (inflammation of the cartilage around the lungs) that has been flaring up so my upper chest hurts, too. My primary care doctor advises me to take ibuprofen for that ☹️\n\nI want to keep going to yoga class for my overall health as I'm on a ton of meds for lupus. I could use advice from those for whom yoga is a regular practice. ",
    "score": 14,
    "url": "",
    "created_utc": 1742320925.0,
    "author": "younglondon8",
    "permalink": "/r/yoga/comments/1jebdwl/how_to_tell_if_soreness_after_yoga_class_is_good/"
  },
  {
    "title": "Wrist strength? Asanas that work your arms without pressure to wrists?",
    "body": "Hi all, looking for some tips on two things: \n\n1. How to develop wrist strength\nand\n2. Asanas that develop general arm strength without putting pressure on wrist\n\nI broke my wrist many moons ago and due to other more intense injuries, it never got the care it needed. I know that developing wrist strength is crucial, but I also think it’s something I’ll be dealing with in some capacity for the rest of my life. For that reason, I’m also interested in ways I can strengthen my arms on the days my wrist is hurting. \n\nAny advice would be greatly appreciated! Thanks! \n",
    "score": 12,
    "url": "",
    "created_utc": 1743781724.0,
    "author": "hannnnnnie",
    "permalink": "/r/yoga/comments/1jrf5oq/wrist_strength_asanas_that_work_your_arms_without/"
  },
  {
    "title": "What do you envision in your practice?",
    "body": "Every time I step onto my mat, there comes a point when my muscles relax and my breath deepens, and I naturally start to envision myself as part of something larger, something in nature. Today, as I practiced breathwork to honor my spine, I found myself picturing my head as a lotus blossoming, my entire body as a single stem with roots grounding into the earth. It felt like a beautiful, fluid connection.\n\nA similar experience happens when I'm in Savasana. I imagine myself as a tree, my branches expanding outward. I feel so open, so spread out, and in that moment, I feel a deep sense of freedom. It's incredible how our bodies can lead us to these visions, aligning us with the natural world.\n\nI’m really curious about others’ experiences. What kind of imagery or feelings do you experience during your practice? Does nature or something else come to mind when you connect deeply with your breath and body? Would love to hear your thoughts!",
    "score": 14,
    "url": "",
    "created_utc": 1743602393.0,
    "author": "roaring_leo_",
    "permalink": "/r/yoga/comments/1jpp9f9/what_do_you_envision_in_your_practice/"
  },
  {
    "title": "Tips for someone new to Ashtanga?",
    "body": "I started doing yoga more regularly about a year ago, doing mostly Vinyasa and Hatha. Just recently I attended an Ashtanga workshop where they went through the history, tradition as well\nthe asanas. I have taken some classes now and it feels really good, enjoy that there are the same series of moves that one will work on and after the classes I feel great! However I feel like I will never be able to do some of the poses like headstand, some of the twist etc. Any tips and insights from other Ashtanga yogis? ",
    "score": 13,
    "url": "",
    "created_utc": 1743279663.0,
    "author": "Ok-Razzmatazz-2789",
    "permalink": "/r/yoga/comments/1jmv9ys/tips_for_someone_new_to_ashtanga/"
  },
  {
    "title": "Yoga Affirmations",
    "body": "Hi Friends! The time has come to get a new yoga mat, and I have decided to personalize it, but am having a difficult time coming up with something that comes in at 20 characters or less. I’d love to incorporate a Thich Nhat Hanh quote or mantra, for example, “No Mud, No Lotus” but am open to anything that speaks to me and pertains to deepen my practice! What are some of your favorite short affirmations? ",
    "score": 13,
    "url": "",
    "created_utc": 1742842054.0,
    "author": "l_spyro",
    "permalink": "/r/yoga/comments/1jiyf2d/yoga_affirmations/"
  },
  {
    "title": "What type of yoga am I doing?",
    "body": "Just recently joined this group and love seeing the topics discussed. However, I’m not sure where I fall within the discussions lol I have been doing yoga semi-consistently for a few years. My first introduction to yoga was Yoga With Adrienne classes from YT. I have never been to a yoga studio. I am a working mom of four, so at home classes are what works best for me. I have more recently been doing Peloton yoga classes as I also have their bike and tread. What type of yoga is that considered? I am not well versed in the different forms/practices and have no idea what type of yogi I am. I am excited to learn more from this group!",
    "score": 13,
    "url": "",
    "created_utc": 1742819508.0,
    "author": "ameliadrew",
    "permalink": "/r/yoga/comments/1jipj0l/what_type_of_yoga_am_i_doing/"
  },
  {
    "title": "When to know I’m ready",
    "body": "Hey friends,\nI hope you’re all having a lovely day. \n\nI’m after some advice/ feedback- I’ve been doing yoga for about a month or so now,and have been doing beginner vinyasa (teacher really takes their time to explain and show the pose), slow flow and yin. \nI’m wondering when is a good indicator I’m ready for a regular vinyasa class?\n\nI know I’m not there just yet, but want to know when to try without making a fool of myself/ hurting myself. \n",
    "score": 12,
    "url": "",
    "created_utc": 1742805285.0,
    "author": "CrocsAndFrowning",
    "permalink": "/r/yoga/comments/1jim06p/when_to_know_im_ready/"
  },
  {
    "title": "Coming back to my practice after years away?",
    "body": "Hey everyone. So, I did yoga in 2018 &amp; found my home studio, but then of course the pandemic closed my preferred studio, but my teachers teach at another location.\n\nHowever, I box twice a week, sometimes 3x a week. Do you think it is wise to add yoga back to my routine?\n\n\nThank you!",
    "score": 12,
    "url": "",
    "created_utc": 1742161899.0,
    "author": "Bratty_Little_Kitten",
    "permalink": "/r/yoga/comments/1jcwrf2/coming_back_to_my_practice_after_years_away/"
  },
  {
    "title": "When do you start feeling good?",
    "body": "I’ve been doing yoga for 20 days, just asking when do I get to see the benefits- the calm the energy?\nRight now am just tired and Im not exerting myself, just stretching and 5 sun salutations and pranayama",
    "score": 13,
    "url": "",
    "created_utc": 1743501300.0,
    "author": "DragonfruitFar271",
    "permalink": "/r/yoga/comments/1jortd1/when_do_you_start_feeling_good/"
  },
  {
    "title": "how best to restart long defunct practice?",
    "body": "I first started doing yoga in my mid-to-late 30s and loved it.  I had good strength, balance, and flexibility.  Then I stopped due to developing a chronic health condition and the meds I was taking for it.  Now I’m 53 and doing better health wise and want to start again, but obviously I lack the same strength and balance, though I still have a certain level of flexibility.  These days I can’t go for a mile-long walk without my lower back hurting for 2-3 days.  I also have issues with my hips now.  I know there are tons of videos on YouTube, but there are so many I don’t know what to pick: It’s overwhelming.  I still have a DVD I used to enjoy, but the pace is too fast for my current fitness level.  There’s also a nearby yoga studio I want to try, but I’m unsure which class to take that will fit my needs.  Any advice would be most welcome.  Thanks for reading.",
    "score": 13,
    "url": "",
    "created_utc": 1743286517.0,
    "author": "foresthobbit13",
    "permalink": "/r/yoga/comments/1jmxq3x/how_best_to_restart_long_defunct_practice/"
  },
  {
    "title": "Could someone recommend some not slippery leggings or pants for yoga?",
    "body": "I've been doing yoga for years and I just started a power yoga class that's been kicking my butt but it's a lot of fun.\n\nBut I'm struggling with good pants to wear to class! I have some second hand lulu lemon leggings that are too slippery for things like tree pose and (attempting) crow. \nI started wearing some leggings I have from wool&amp; which have good traction but they get too hot!\n\nWhat are your favorite pants to wear? Looking for something breathable because I get hot, good traction for poses and preferably with as little synthetic material as possible. I know that's difficult with things like leggings, but I just can't do polyester pants!",
    "score": 12,
    "url": "",
    "created_utc": 1742869435.0,
    "author": "Gryffin-thor",
    "permalink": "/r/yoga/comments/1jj91l0/could_someone_recommend_some_not_slippery/"
  },
  {
    "title": "How do I get my leg high on three legged downward dog? :(",
    "body": "",
    "score": 10,
    "url": "",
    "created_utc": 1743733555.0,
    "author": "coffeeloverr21",
    "permalink": "/r/yoga/comments/1jr16tw/how_do_i_get_my_leg_high_on_three_legged_downward/"
  },
  {
    "title": "Just getting into yoga & sculpt class",
    "body": "Hi!!\nI’m just starting my fitness journey again..\nI just went to Marshall’s to get some new workout gear and a yoga mat because I plan to take classes at core power. \n\nI refuse to by myself higher end stuff until I’m really consistent with this. Also I’m a seamstress and plan to sew a lot of my tops out of some bamboo spandex material.\n\nI was going to get a Gaiam but then decided to get this other Mat that was buried. It was wider and the quality seemed so much better. It was heavier and also super non slip. \n\nHas anyone ever heard of this brand? It says pur earth, and it was $40.\n\nAlso I’m curious if I should be getting a yoga mat towel that covers the mat? Is it helpful? \n\nThanks so much!! ",
    "score": 10,
    "url": "",
    "created_utc": 1743705719.0,
    "author": "No-Bad-5946",
    "permalink": "/r/yoga/comments/1jqqi17/just_getting_into_yoga_sculpt_class/"
  },
  {
    "title": "Is it normal to not \"spot\" people in more advanced poses?",
    "body": "Hello! Newbie to yoga, here. I have 8+ years experience in being a pole dance/fitness student and instructor. I'm no newbie to movement of the body/fitness/flexibility and have dabbled a lot in some poses such as crow, forearm stands, headstands, etc. throughout the years.\n\nI took a workshop at a local yoga studio for arm balances and \"flight training\" last week. It was a lot of fun for me. I was able to solidify what I already knew about some of these, get pointers on ones I struggled with, and started the process of learning other, new to me, balancing poses. \n\nIt bothered me a lot in this class that when some of the ladies went to do more advanced poses like headstand and forearm stands, they were kind of left...unattended? I'm honestly not trying to throw shade at the instructor. He was good at explaining the how's and why's of these poses, but I saw a few students either really struggling to kick/lift up (fair enough, we've all been there!) and if/when they got their hips over their shoulders, a lot of their shoulders were collapsing or form overall just wasn't aligned with what *I* thought it should be. Again, new to the vast majority of yoga concepts (I still don't actually know all the different forms of yoga such as ashtanga/hatha, etc. It's a learning process for sure.) I've also dumbly injured myself a lot in my 20s with fitness because I kept *trying to push through* instead of taking a step back and focusing on good form and a good foundation.\n\nI've taught head and forearm stands in my pole classes before, and I was always very diligent about spotting my students and even assisting them in \"lifting\" (like, I would grab their legs and help pull them up so that the student could appropriately engage their shoulders and stack them so they could get the feel of it.) Obviously, I know not every student is strong or experienced enough to get everything right the first time (or the second or even the thirty second time, lol).\n\nI guess I just wanted some confirmation that either A) I'm being dramatic and it's not that big of a deal or B) maybe I should consider trying classes elsewhere if this situation isn't considered \"normal\" and it just irks me. Overall, I really enjoy this studio and their classes but just felt like with how advanced some of these poses were, it should have been a little more \"hands on\", literally, if you will. \n\nI thought maybe him being a male instructor to 10 women might have attributed to the lack of spotting, which obviously includes touching the other person. But even as a female instructor to other women (and sometimes men!), I always ask \"is it okay if I touch/grab you here to spot you\". Most of the time, they're fine with it. Sometimes they're not, in which I will place a crash mat under them and watch carefully and give verbal feedback and instruction as they're going through whatever I'm teaching them. \n\nThis instructor has been through some form of official yoga training. Idk what/where it was but he talked about it in class briefly and that he'd done over 200hrs. So I'm really not trying to say that I know better, because I don't. It's just that as an experienced pole teacher and someone who thought they were invincible in their 20s and gave themselves injuries, it just looked like Injury City in that room with all the shoulders folded and elbows spread apart and it gave me low-key anxiety 😅 ",
    "score": 12,
    "url": "",
    "created_utc": 1743367304.0,
    "author": "Zealousideal-Lynx417",
    "permalink": "/r/yoga/comments/1jnm312/is_it_normal_to_not_spot_people_in_more_advanced/"
  },
  {
    "title": "Can't find a good teacher/class lately",
    "body": "18 months ago I moved cities and discovered Rocket yoga with an amazing instructor and a fun easy going group of regular students and I was hooked for 6 months. Then I went on vacation and when I returned the instructor was gone and so was rocket yoga. I tried other classes at that studio but none were for me. I tried looking around for other yoga classes I've enjoyed in the past, which are a supportive instructor in a style that lets me really get into a pose (e.g. yin, 26/2), nothing fast paced, aerobic, or weight bearing. I am good about almost daily stretching at home, but I've always found it difficult to do much of an extended solo practice at home, even with a video on (I think with my ADHD I need to be in a class where we are all doing similar types of movement). I feel really silly that I feel so stuck about this, but I don't know what to do and I miss the comfort of my regular class. Every month or so I renew my search for a class within \\~30 min of home that meets my needs, but I'm still not finding anything. I think it's weird, but where I live, most classes are heated power and heated yoga with weights (as far as I'm concerned it's just arobics but whatever) The classes are very impersonal and feel like bootcamp. Any advice?",
    "score": 11,
    "url": "",
    "created_utc": 1742882107.0,
    "author": "Aurrrrie",
    "permalink": "/r/yoga/comments/1jjcm2g/cant_find_a_good_teacherclass_lately/"
  },
  {
    "title": "Is it enough salt? Or should I add more?",
    "body": "Breaking in my Manduka travel mat. I always enjoy this part of the process. Any tips fellow yogis?",
    "score": 11,
    "url": "",
    "created_utc": 1742278903.0,
    "author": "Scubapro413",
    "permalink": "/r/yoga/comments/1jdyn73/is_it_enough_salt_or_should_i_add_more/"
  },
  {
    "title": "Calf discomfort in Pigeon",
    "body": "Hi, I've noticed over the last few months that my left calf muscle is uncomfortable in pigeon.  There is a squeezing sensation present at the top center, about three inches below the crook of the knee, almost as if someone is pressing their hand with considerable effort into the muscle and mashing it forwards or something.  The feeling shifts in character a little when I switch between flexing or pointing my foot but doesn't go away.\n\nMy right calf is fine.  On either side, depending on the day, I stay upright or put my forearms on blocks, and I know how to not push myself too far.\n\nAny ideas on what the problem might be or how I can address it?  I love pigeon and can do the supine version or seated/floor figure of four with zero discomfort anywhere.  I also know that years ago (I took a very long break from doing any yoga at all) I was able to do about what I can now in pigeon, but without the calf discomfort.\n\n41/F, mostly lean and muscular body type",
    "score": 10,
    "url": "",
    "created_utc": 1742142007.0,
    "author": "ChaoticCentury",
    "permalink": "/r/yoga/comments/1jcp4a9/calf_discomfort_in_pigeon/"
  },
  {
    "title": "Bodily function horror stories!",
    "body": "In light of a recent conversation about the dreaded yoga queef here:\nhttps://www.reddit.com/r/yoga/s/TzwwkV7X1g\n\n...it got me thinking... what are your bodily function horror stories? Ever pooed your pants in malasana? Wet yourself in savasana? Vomited in hot yoga? Do you dread the up-dog / down dog transition? Happy baby? Press to handstand?\n\nI'll admit that while I've managed to keep things under wraps so far, I can feel my vagina puffing like a steam train in any sort of inversion... forearm balance, scorpion, headstand, handstand... any slight movement feels like I'm one second away from a vart emerging like I'm giving birth to Donald Duck. And in some cases it's made me second guess what I feel safe teaching because I don't want to embarrass anyone else let alone myself.\n\nSo with that in mind... what's your most embarrassing \"oh shit please not that pose!\" pose?",
    "score": 11,
    "url": "",
    "created_utc": 1743388669.0,
    "author": "ChasteSin",
    "permalink": "/r/yoga/comments/1jnt9hy/bodily_function_horror_stories/"
  },
  {
    "title": "Best leggings for hot yoga?",
    "body": "I have a pair of lululemon aligns and generally like them (aside from a loose thread) - they’re soft and provide enough support without feeling too restrictive. But ugh $100+ for leggings is just a hard pill for me to swallow. I do want quality leggings though, cause the cheap ones from Amazon just don’t cut it for me anymore. \n\nAre there any other brands that might be a little cheaper but still are good quality? Are brands comparable (in price) like Beyond Yoga and Alo worth their $100+ price tags? ",
    "score": 11,
    "url": "",
    "created_utc": 1743082374.0,
    "author": "slh0023",
    "permalink": "/r/yoga/comments/1jl408e/best_leggings_for_hot_yoga/"
  },
  {
    "title": "Home Studios",
    "body": "I moved up to Seattle 5 years ago leaving my home hot yoga studio behind. It’s been 5 years and I still think about it everyday. I go back to visit once a year, but it’s not enough… and I can’t find a comparable studio, the vibe, community, the heat and flows anywhere here… can anyone relate.. just wanted to reminisce about great studios and how they made us feel. ❤️",
    "score": 10,
    "url": "",
    "created_utc": 1742929438.0,
    "author": "elizbaca",
    "permalink": "/r/yoga/comments/1jjrc6t/home_studios/"
  },
  {
    "title": "Addressing Hip difference",
    "body": "Hey everybody, for as long as I can remember doing pigeon on my right side is significantly harder than on my left.\n\nShould I simply do longer durations for the right side till they balance out?\n\nOr should I do other postures, and if yes, for how long? I would like both sides to be equal eventually.\n\nThank you for your energy 🙏",
    "score": 11,
    "url": "",
    "created_utc": 1742812777.0,
    "author": "1111onyourclock",
    "permalink": "/r/yoga/comments/1jinnhn/addressing_hip_difference/"
  },
  {
    "title": "Why is warrior one face and body forward and warrior two the side with arms outstretched?",
    "body": "I always thought warrior two was warrior one?  Lol",
    "score": 10,
    "url": "",
    "created_utc": 1742681669.0,
    "author": "dylan3883",
    "permalink": "/r/yoga/comments/1jhk5ff/why_is_warrior_one_face_and_body_forward_and/"
  },
  {
    "title": "Are these any good",
    "body": "",
    "score": 9,
    "url": "",
    "created_utc": 1742652560.0,
    "author": "Valuable-Size-7027",
    "permalink": "/r/yoga/comments/1jh996y/are_these_any_good/"
  },
  {
    "title": "Will my manduka mat never be as grippy as an open cell mat?",
    "body": "Hi everyone,\n\nI have been using a 5mm lululemon mat for the past year or so. It’s nice and grippy, but it started looking grimy and beat up very quickly (maybe my fault for getting a light color). \n\nI wanted to get a new mat for taking to the studio and after reading this sub I settled for a manduka prolite. The closed-cell construction is very appealing to me and it seemed like the mats are really made to last and can easily be cleaned. I love how dense the mat feels and how it looks and the size and weight are the perfect balance of cushioning and portability for my needs. \n\nBut it is SO slippery. I bought it a few weeks ago and immediately did the salt treatment, then cleaned with dish soap and used a magic eraser. It got a little better, but I still keep slipping during downward dog and warrior 1 and have to keep readjusting my hands and feet because they slowly slide away from me. My hands and feet aren’t particularly sweaty at all, but as soon as there is a little bit of sweat I have no grip anymore.\n\nI find myself wanting to keep the mat and keep using it in hopes that with more use it will get broken in. But I also wonder if my expectations are unrealistic. Maybe the closed cell construction means that it will never be quite as grippy as an open-cell mat? I don’t like hot yoga, but I like sweatier and faster vinyasa and power flows sometimes. It seems like a lot of manduka fans are using it with a towel for hit yoga. Is it possible that this is just the wrong mat for me? Any insights are appreciated!",
    "score": 10,
    "url": "",
    "created_utc": 1742556144.0,
    "author": "PipeOk2199",
    "permalink": "/r/yoga/comments/1jgeief/will_my_manduka_mat_never_be_as_grippy_as_an_open/"
  },
  {
    "title": "Mat cleaning",
    "body": "Hey everyone,\nWhat are yall using to clean your mat? I recently got this and it’s fine but it was kind of expensive, does anyone have anything that they LOVE?",
    "score": 10,
    "url": "",
    "created_utc": 1742432712.0,
    "author": "_fl_ryan",
    "permalink": "/r/yoga/comments/1jfd3q7/mat_cleaning/"
  },
  {
    "title": "Go with the flow",
    "body": "I've been practicing yoga for many years but eventually as I went into my mid 50's, I developed an issue in keeping up with the flow of classes. I am still reasonably flexible but found I would get stuck in very deep poses, like I'd gone too far (but without pain) and the time it took to get out and reset myself meant that it spoiled my experience of flow and participation. I eventually decided to practice at home which isn't a bad thing, but I miss being in the company of others and wonder how I might be able to return. Yin doesn't seem to be the answer as the deep poses are held for longer. I have been checked out by a doctor and just have the normal degeneration around my hips and spine of someone my age. Can anyone suggest a way to return to mainstream classes or is it really time to join the blue rinse brigade?",
    "score": 9,
    "url": "",
    "created_utc": 1743855658.0,
    "author": "Appleblossom70",
    "permalink": "/r/yoga/comments/1js27g6/go_with_the_flow/"
  },
  {
    "title": "Question about building muscle",
    "body": "I started doing Yoga sculpt in January and am approaching my 50th class. In the last few months I have gotten noticeably stronger and more defined. However through this process it feels that my muscles have actually compressed and gotten a bit smaller despite being more dense and toned. I eat a good amount of protein as well. I was just wondering if I would eventually put on size with yoga or if I should add a weights day if that is more my goal. \n\nSorry if this question doesn't exactly fit this subreddit.",
    "score": 10,
    "url": "",
    "created_utc": 1743768280.0,
    "author": "Protoman112358",
    "permalink": "/r/yoga/comments/1jra7ej/question_about_building_muscle/"
  },
  {
    "title": "Looking for a specific yoga instructor.",
    "body": "Hi everyone, \n\nThis is a bit random but there used to be a Yoga instructor that would post videos to Youtube; but then he decided to move to his own website to improve the monetization. \n\nHe was a black male, and his Yoga videos were good because they'd have little timers for each exercise. They also seemed to be tailored towards men. \n\nI cannot find him anywhere but I recently herniated a disc in my back &amp; was advised to do Yoga again so would like to sign up to his site.... I just have no idea who he is. \n\nAny help locating his site would be greatly appreciated, thank you.",
    "score": 8,
    "url": "",
    "created_utc": 1743697817.0,
    "author": "Lumpy-Ad-9578",
    "permalink": "/r/yoga/comments/1jqn16f/looking_for_a_specific_yoga_instructor/"
  },
  {
    "title": "Does anyone know the origin ( or back story) of cat/ cow pose?",
    "body": "",
    "score": 8,
    "url": "",
    "created_utc": 1742875909.0,
    "author": "reaeurope2",
    "permalink": "/r/yoga/comments/1jjb0lz/does_anyone_know_the_origin_or_back_story_of_cat/"
  },
  {
    "title": "My Indian friend suggested a program. Personal thoughts while travelling.",
    "body": "Hi guys, just wondering how beneficial would it be to do 15 minutes everyday. I am mainly looking to just relax my mind and my shoulders and hips. My weakest areas now since I mainly lift and box. \n\nAlso, when I went to India, I met many yogis but we are friends for something else. I’m glad to have met them to help me in my journey. \n\nIn China, it seems more for like socializing with aunties or wealthy women vs it being a daily part of life for Indians. \n\nPretty interesting contrast. ",
    "score": 9,
    "url": "",
    "created_utc": 1742788200.0,
    "author": "PlayfulIndependence5",
    "permalink": "/r/yoga/comments/1jii106/my_indian_friend_suggested_a_program_personal/"
  },
  {
    "title": "Advice on doing prolonged stretching at your desk",
    "body": "I've heard after a warm up one can sit for a long time in a stretched position.\n\nFor example, sitting in a lotus/half-lotus in front of your computer at work.\n\nI would like to hear advice how you got into the habit of doing this, and whether you find such stretching helpful.\n\nFor me the problem is that at my desk either I don't stretch at all, or I feel a slight discomfort when sitting in a stretched position. During the Yoga class such discomfort is pleasant, because I'm focused on doing the exercise and want to stretch. However, at my desk such discomfort distracts my mind from doing the regular work.",
    "score": 9,
    "url": "",
    "created_utc": 1742549744.0,
    "author": "mercury0114",
    "permalink": "/r/yoga/comments/1jgcxvi/advice_on_doing_prolonged_stretching_at_your_desk/"
  },
  {
    "title": "studios in SF?",
    "body": "I practiced yoga at a studio for two years, going anywhere from 4-5 times a week. These classes were all warm/hot and were described as hot vinyasa, power flow, or warm ying yang. There were many opportunities in these classes to be exposed to, learn, and work your way up to more challenging variations such as birds of paradise, inversions, arm balances, and binds. Instructors regularly cued for all variations and it was here where I really fell in love with yoga, seeing others in class work through these more advanced poses.\n\nI recently moved to San Francisco and i’m having troubles finding a studio or instructor that teaches in a similar way, so i’m asking if anyone has a recommendation that they feel like matches what I described above.\n\nThe studios that I have tried here are all really great, but I often wish there were more challenging. I don’t feel super comfortable doing more advanced poses especially if my instructor hasn’t cue for it as I worry it could be distracting or doing too much, so I would love to find a class where this is more encouraged.\n\nMy time at the old studio was completely siloed so i’m not sure if what i’m describing is a particular style of yoga… if so please share :)\n",
    "score": 10,
    "url": "",
    "created_utc": 1742528254.0,
    "author": "junisobel",
    "permalink": "/r/yoga/comments/1jg7u8n/studios_in_sf/"
  },
  {
    "title": "It it ok to fail?",
    "body": "I have been doing yoga for a few weeks following YouTube routines. I’ve been using different beginner routines but have found a couple of times that I can’t hold the poses for the whole time due to either strength or balance issues but is this ok or should I look for a different routine if I fail? From bodyweight workouts I know that I would improve over time but since this disrupts the whole routine I’m not sure if I should look for something easier?",
    "score": 9,
    "url": "",
    "created_utc": 1742408663.0,
    "author": "AJS_123",
    "permalink": "/r/yoga/comments/1jf3w5m/it_it_ok_to_fail/"
  },
  {
    "title": "Tight hamstrings, how can I fix them?",
    "body": "Hey everyone. Since I can remember I have problems with my hamstrings and muscle cramps. For an example, when climbing up the stairs my hamstrings get so tight that I must stop or else I will trip down and fall. I have a feeling like my legs are going in slow motion, it's really strange. The biggest problem of all is doing weighted squats, or squats in general. I feel like I got PTSD every time I try to squat. \n\nDidn't know where to look for an answer except here 😅\n\nHas anyone had/encountered the same problem?\nDoes anyone know any good stretches, that I can try at home?\n\nThanks in advance!",
    "score": 10,
    "url": "",
    "created_utc": 1742371642.0,
    "author": "Realistic_Meaning155",
    "permalink": "/r/yoga/comments/1jes0wh/tight_hamstrings_how_can_i_fix_them/"
  },
  {
    "title": "Iyengar‘s 1984 yoga demo at the Barbican, London",
    "body": "I’ve been seeing a lot of video clips of Iyengar demonstrating asana as well as giving speeches/lectures about yoga philosophy.\n\nWhat I have not been able to figure out yet is the background of this happening? \nAs in: what kind of event was this and who were the audience? What was it promoted as? Was it part of a broader event?\n\nCan anyone shed some more light here? \n\nThank you",
    "score": 9,
    "url": "",
    "created_utc": 1742111291.0,
    "author": "meinyoga",
    "permalink": "/r/yoga/comments/1jcggl5/iyengars_1984_yoga_demo_at_the_barbican_london/"
  },
  {
    "title": "Yoga Studio Owners (Non-Franchise)",
    "body": "For those of you who own a yoga studio, why did you open one?\n\nAre you  yoga instructor yourself?\n\nHow much investment did it require, if you don’t mind my asking? \n\nWhat’s the hardest part of owning a studio?\n\nDid you take over an existing studio or build one?\n\nIs it just yoga or combined with something else? Heated? Not heated?\n\nAnd what are some hard lessons learned?\n\nI have two spaces I’m looking at and it occurs to me they’d be ideal for studios. But I’m not an instructor and have no interest in becoming a yoga teacher, so I’d be entirely dependent on hiring instructors to keep a studio opened. I wonder if that should stop me cold in my tracks. \n\nI have a Y6 and a private studio about 15 minutes from me in two directions, but nothing closer to me, and with the growth in the area, I think it might be something a lot of area residents would be interested in. \n\nAside from the things I can see at the studios at which I practice, I’m sure there’s a lot that isn’t immediately noticeable to me so I’m wondering what it all entails.\n\nAlso, would you do it again, if you could choose?\n\n",
    "score": 7,
    "url": "",
    "created_utc": 1743740257.0,
    "author": "sffood",
    "permalink": "/r/yoga/comments/1jr392s/yoga_studio_owners_nonfranchise/"
  },
  {
    "title": "How much should deepening a stretch hurt?",
    "body": "Should it be super painful? How do I know if I am going too hard?",
    "score": 8,
    "url": "",
    "created_utc": 1743555621.0,
    "author": "jackcoleman777",
    "permalink": "/r/yoga/comments/1jpc3xz/how_much_should_deepening_a_stretch_hurt/"
  },
  {
    "title": "I can do a full camel pose easily, but I can't do plough pose at all. I have quite tight hamstrings and calves, but I think my mid-back muscles are also tight. What should I focus on to improve my halasana? Currently, my legs can't even touch a chair.",
    "body": "",
    "score": 8,
    "url": "",
    "created_utc": 1743511139.0,
    "author": "ibiliss",
    "permalink": "/r/yoga/comments/1jouk3x/i_can_do_a_full_camel_pose_easily_but_i_cant_do/"
  },
  {
    "title": "This sounds ridiculous, but maybe there ate things that can help.",
    "body": "I'd like to try yoga. It's  quiet, which is  great, because I live in an apartment and have fussy neighbors. Because  I'm aging  (62 in July) I'd like to work on strength, balance and  flexibility. Also, I hate the gym. There's  always a  handy excuse to not go - I love being home and it would be hard to find excuses not to go home. Yoga is pretty perfect. \n\nMy problem (this is embarrassing) is that sitting on the floor  hurts. I have a yoga mat, but it still hurts. Some of it is flexibility, which is good. The more I do it the easier it will get. The bigger problem is that even with a pretty thick and well reviewed mat, my ankle bones, hip bones and  tailbone feel like they're grinding into the  bare floor.\n\nAny advice on how to make this work would be very much appreciated.\n\n",
    "score": 9,
    "url": "",
    "created_utc": 1743261978.0,
    "author": "Debbborra",
    "permalink": "/r/yoga/comments/1jmoq42/this_sounds_ridiculous_but_maybe_there_ate_things/"
  },
  {
    "title": "Marking my mat",
    "body": "I’ve had a LifeForme for years, and I really enjoy the markings on it, in addition to the grip. A big problem I’ve had with LifeForme is that it is too thin, and my knees hurt in tabletop or anything similar. I tried the Manduka GRP mat at my studio and just ordered one for myself, the cushion and grip are just perfect. \n\n…but I’m trying to think of a good way to put markings on it, so I can ensure my poses are symmetrical throughout class. My initial thought is to take a black Sharpie marker and very very carefully measure and draw a single skinny line longitudinally down the middle. However, there is the possibility that I make a mistake, or it smudges as I practice and sweat on it. Another option is finding some very good high-quality tape, but the only thing I can find is really thick tape, and me cutting it would also not look great. \n\nDoes anyone have any suggestions to mark my mat myself while also making it look good?",
    "score": 7,
    "url": "",
    "created_utc": 1743196992.0,
    "author": "utahmilkshake",
    "permalink": "/r/yoga/comments/1jm61xf/marking_my_mat/"
  },
  {
    "title": "Pants....",
    "body": "Help a short (5'3) girl out. I'm looking for high waisted yoga pants that don't assume I'm 5'9.\n\nFitted or floppy, standard yoga pants or loose with breathable fabrics. They all have their place!",
    "score": 8,
    "url": "",
    "created_utc": 1743112266.0,
    "author": "OtterSnoqualmie",
    "permalink": "/r/yoga/comments/1jlety0/pants/"
  },
  {
    "title": "Happy Spring",
    "body": "108 Sun Salutations this morning.   Enjoy the day!",
    "score": 8,
    "url": "",
    "created_utc": 1742572894.0,
    "author": "michaelkane911",
    "permalink": "/r/yoga/comments/1jgk9yh/happy_spring/"
  },
  {
    "title": "Iyengar Journey: Finding a Mentor",
    "body": "Hey all! So I have been teaching vinyasa for 11 years now, I started when I was 18 and I’m 29 now. Through those years I got a 200 hour at my local studio in Colorado, it was a good intro to yoga but I wanted to learn more. I moved to LA and received a 2nd 200 hour from YogaWorks and then completed my 500 hour with them as well. My yoga mentor was on her path to get Iyengar certified and so she taught the YogaWorks way but with Iyengar alignment. Now she is a full Iyengar teacher and I want to follow that path as well. While I enjoy vinyasa, Iyengar yoga just works for me and my journey. I moved back to Colorado and found two places in Denver that offer Iyengar teachings, but their trainings are not souly focused around getting Iyengar certified. I was wondering if anyone was going through the certification process and how they found a mentor? ",
    "score": 9,
    "url": "",
    "created_utc": 1742235024.0,
    "author": "darylanne333",
    "permalink": "/r/yoga/comments/1jdjfgf/iyengar_journey_finding_a_mentor/"
  },
  {
    "title": "What is your personal interpretation of “if you want more” add one/modifications?",
    "body": "When the instructor cues a pose, and then says “if you want more, you can bind or lift your leg or whatever”, do you focus first on achieving a full expression of the asana and only adding on if that isn’t enough, or do you try the add-on even if you’re not maxing out on the original pose?",
    "score": 7,
    "url": "",
    "created_utc": 1742155306.0,
    "author": "Pixelated_jpg",
    "permalink": "/r/yoga/comments/1jcuak1/what_is_your_personal_interpretation_of_if_you/"
  },
  {
    "title": "Thoughts on Autobiography of a Yogi?",
    "body": "I'm wondering what feelings people have about Yogananda's Autobiography of a Yogi.  \n\nMost book discussions I've seen here seem to be in the modern/popular expression yoga (i.e. the lineage of Krishnamacarya -- Desikachar, Iyengar, Jois, etc.), whereas Yogananda's book is pretty full on traditional and far out in a lot of ways.  \n\nSteve Jobs arranged for everyone at his memorial to receive a copy which is an interesting endorsement.  Though I suspect it is a bit too much bhakti and Hinduism for many.\n\nI always thought that Paul Brunton's A Search in Secret India, written about 10 years earlier  (1934) was a more easily digested version of something similar-- a westerner going to India in search of spiritual giants and ultimately finding Ramana Maharshi. \n\n",
    "score": 7,
    "url": "",
    "created_utc": 1743872414.0,
    "author": "idigthisisland",
    "permalink": "/r/yoga/comments/1js81ik/thoughts_on_autobiography_of_a_yogi/"
  },
  {
    "title": "What to expect from a workshop?",
    "body": "I'm going to an inversions and arm balances workshop tomorrow, and honestly I'm nervous. I've been going to a class locally each week since the beginning of 2024 and then doing more at home with apple fitness+, but now I want to go further.\n\nI have lost a lot of weight in the last year (nearly 70 lbs), and gained strength, but my wobbly bits still get in the way sometimes. I can do a couple of seconds of crow when I'm warmed up, and last week managed a plough with an assist, then into a shoulder stand. I can't do binds because my arms still don't reach all the way around, and my practice isn't elegant. Have I bitten off more than I can chew? Please reassure me that I'm not going to be sat watching other people and feeling crap about myself.",
    "score": 8,
    "url": "",
    "created_utc": 1743772498.0,
    "author": "madameniamh",
    "permalink": "/r/yoga/comments/1jrbldu/what_to_expect_from_a_workshop/"
  },
  {
    "title": "Secondhand websites for workout clothes?",
    "body": "I practice hot vinyasa and other hot athletic classes at my studio about 4-5 times a week. I haven't bought new workout clothes in MANY years and I'm at the point now that some items are too far gone and I need some new items.\n\nI don't want to buy new, even from 'ethical' companies. But the thrift stores in my area never have anything it seems!\n\nSo I'm looking for advice for online shopping second hand. I know Patagonia and Girlfriend Collective have sites that you can buy their clothing that they buy back from customers and then resell. Other than those, all I know of is Poshmark... Or I guess eBay?\n\nWhile I'm here.. anyone have any advice about material they specifically love or hate for hot classes? ",
    "score": 7,
    "url": "",
    "created_utc": 1743700655.0,
    "author": "Ok-Professor-9201",
    "permalink": "/r/yoga/comments/1jqo9kx/secondhand_websites_for_workout_clothes/"
  },
  {
    "title": "Hot yoga temperatures",
    "body": "What temperate are your hot yoga rooms? I’m just curious because when I first started at my current studio it was around 95 and lately it’s been 101-103 and I have never sweated so much in my life. Wondering what temps are ‘normal’",
    "score": 7,
    "url": "",
    "created_utc": 1743646141.0,
    "author": "samsquanch129",
    "permalink": "/r/yoga/comments/1jq6kzl/hot_yoga_temperatures/"
  },
  {
    "title": "Jumping to forward fold - legs land in squat??",
    "body": "Hello again fellow redditor yogis. I keep a fairly consistent yoga practice at home and have started recently playing around with the “jump forward to forward fold” cue from downward dog. But I realise that when I do this my ankles splay towards the side like I’m heading into a squat. I have a fairly long legs and short upper body - I wonder if it might be an anotomy issue or do I have to practice more hips lifting upwards and if so what drills can I do? I haven’t found a studio that I like (living somewhere in SE Asia) so rely on YouTube videos and a lot of online instruction. Thank you in advanced. ",
    "score": 8,
    "url": "",
    "created_utc": 1743577863.0,
    "author": "Dramatic_Drive5361",
    "permalink": "/r/yoga/comments/1jpiosh/jumping_to_forward_fold_legs_land_in_squat/"
  },
  {
    "title": "Friday Late Night Yoga Class for a group of 8 working moms",
    "body": "Hi All,   \n  \nI am teaching a 60-minute yoga/ slow flow class to a group of 8 ladies who are all working moms. The class is on a Friday at 8 pm; we will be going for drinks after as a group. Could you please help suggest a theme that is suited for this class? Given its end of week and all ladies are managing work/ family, I would love to keep it simple. Any meditation techniques? Any pointers for Savasana?\n\nHappy to hear your thoughts on how to make this an engaging and unique experience!\n\n  \nThanks,",
    "score": 8,
    "url": "",
    "created_utc": 1743031261.0,
    "author": "Mental_Advice8645",
    "permalink": "/r/yoga/comments/1jkptqe/friday_late_night_yoga_class_for_a_group_of_8/"
  },
  {
    "title": "Do you know this brand ?",
    "body": "Got this too used and I love the fit and feel but I don’t recognize the logo. Does anyone know this brand ?",
    "score": 7,
    "url": "",
    "created_utc": 1742996834.0,
    "author": "OGraineshadow",
    "permalink": "/r/yoga/comments/1jkc5y8/do_you_know_this_brand/"
  },
  {
    "title": "Flooring/Practice Space?",
    "body": "I was doing a yoga video this morning and the trainer had us going on our toes a lot and I struggled with the balance issue - in wondering if part of my issue is that I’m practicing on a mat on top of a carpeted floor? I remember back to some PT exercises where she had me stand on a cushion and it made me wonder if I’m doing that to myself. Am I just struggling with balance or would this affect any of it? ",
    "score": 7,
    "url": "",
    "created_utc": 1742667434.0,
    "author": "arcticfriday",
    "permalink": "/r/yoga/comments/1jheuzy/flooringpractice_space/"
  },
  {
    "title": "Down dog subscription",
    "body": "Hey I'm kinda new and thinking about buying a subscription. Do you know when the price will be lower? I mean usually like in holidays' sales.\nrn it's 40$/year\nIt's not bad for such a recommended app but I saw people buy it for 25$ which is more than 50% off\nI'm not trying to be griddy. 15$ is a lot of money for me",
    "score": 8,
    "url": "",
    "created_utc": 1742437813.0,
    "author": "AvielDan",
    "permalink": "/r/yoga/comments/1jfesk6/down_dog_subscription/"
  },
  {
    "title": "Savasana Buzzing",
    "body": "Hey! I'm new to the community. I've practiced yoga for 2+ years. Sometimes in Savasana I get this weird buzzy/tingling sensation. My whole body almost vibrates. Is this a normal sensation?  ",
    "score": 7,
    "url": "",
    "created_utc": 1742408764.0,
    "author": "xsecretgardenx",
    "permalink": "/r/yoga/comments/1jf3xl8/savasana_buzzing/"
  },
  {
    "title": "Savasana duration",
    "body": "How long do you guys think savasana should be? I try to aim for 8-10mins for a 70min class but ive also seen way shorter and way longer ones",
    "score": 6,
    "url": "",
    "created_utc": 1742318383.0,
    "author": "Icy_Cheetah6112",
    "permalink": "/r/yoga/comments/1jeabf6/savasana_duration/"
  },
  {
    "title": "1st time doing yoga",
    "body": "Hey all! I've been told that I'd love yoga for a long time by many people and am ready to try it out. My plan is to have a 30-60 minute routine to replace my daily stretching on the weekends. I'm hoping to really improve my flexibility, but also my breathwork and coordination. It seems like Hatha, Yin, and Vinyasa are maybe what I should look for? Are there other types, or two types, that would be best for me? Maybe just Hatha could hit all my wants? Are there highly recommended beginner classes on YouTube I should check out? Thanks in advance!",
    "score": 6,
    "url": "",
    "created_utc": 1743833437.0,
    "author": "Physical_Relief4484",
    "permalink": "/r/yoga/comments/1jrwx3s/1st_time_doing_yoga/"
  },
  {
    "title": "Please explain how yoga butt feels to a hypochondriac",
    "body": "So... I am panicking a bit. I have this pain  that I haven't felt until now. It is not strong, but it is unexpected, because when I am not in any stretched position I feel normal. I went to class today, first forward fold, and it started hurting. It is in the back inter thigh. Thoughts? ",
    "score": 7,
    "url": "",
    "created_utc": 1743706459.0,
    "author": "dazed_and_confused91",
    "permalink": "/r/yoga/comments/1jqqtkh/please_explain_how_yoga_butt_feels_to_a/"
  },
  {
    "title": "What are your favorite transitions?",
    "body": "I'm trying to spice up my flow, and playing with new combinations. \n\nCurrently, my new favorite transition is three legged dog to side crow splits, and then I try and land in a side plank with my leg floating. \n\nOther transition that I just started is high lunge, sweep back to skandasana, and then sweep into warrior 3 before I jump back.\n\nBut I'd love to hear what you like, what you're working on, ways to shake up my flow. I want to challenge myself on spicy flows because it clears my mind (I have to singularly focus on it) which calsn me. I don't know all the pose names but I'd love to learn! ",
    "score": 6,
    "url": "",
    "created_utc": 1743640944.0,
    "author": "presque-veux",
    "permalink": "/r/yoga/comments/1jq4ro5/what_are_your_favorite_transitions/"
  },
  {
    "title": "Podcast recommendations for yoga, meditation and pseudo science?",
    "body": "Hi all! I’m looking for good podcasts that discuss yoga and yoga related topics. \n\nI’m also curious if there’s any podcasts or specific episodes that discuss the criticisms of pseudo science wellness culture, like energy healing, etc. \n\nThank you!  ",
    "score": 7,
    "url": "",
    "created_utc": 1743608855.0,
    "author": "mochaboo20",
    "permalink": "/r/yoga/comments/1jprvts/podcast_recommendations_for_yoga_meditation_and/"
  },
  {
    "title": "Sinus pain with inverted poses",
    "body": "I've been doing yoga since 16 on and off (35 now) and I've always had an issue of intermittent sinus pain when doing inversions like down dog, upward bow etc.\n\nI've asked a few doctors and they just shrug. Thoughts? It's not every time, usually if I have a mildly runny nose. What can I do to stop the pain, as it has really impacted my practice.",
    "score": 6,
    "url": "",
    "created_utc": 1743452938.0,
    "author": "Psychological_Roof85",
    "permalink": "/r/yoga/comments/1jod9ge/sinus_pain_with_inverted_poses/"
  },
  {
    "title": "What's your most favorite flow for a 10-15 minute practice?",
    "body": "Looking for your go-to flow sequence for when you only have 10-15 minutes but still want to get in a daily practice! \n\nI'm still crafting mine, so open to suggestions but so far I find myself doing some iteration of the following: \nHigh mountain into forward fold with high mountain backend 3x &gt; table top into cat cows (as many as needed) &gt; thread the needle &gt; push up from table top into DD, walk the dog, plank, chataranga into either cobra or UD depending on my mood &gt; back to DD, walk up to forward fold, warrior 1 &gt; humble warrior &gt; some version of balance either tree or warrior 3 &gt; table top &gt; pigeon &gt; butterfly &gt; happy baby",
    "score": 6,
    "url": "",
    "created_utc": 1743291067.0,
    "author": "maeasm3",
    "permalink": "/r/yoga/comments/1jmzaz5/whats_your_most_favorite_flow_for_a_1015_minute/"
  }
]